[
    {
        "course_code": "GMS AN 702",
        "course_title": "Neurobiology of Learning and Memory",
        "description": "Graduate Prerequisites: consent of instructor This course covers the neurobiological bases of learning and memory from the cellular to the systems level. Initial sessions cover the behavioral aspects of learning and memory--how it is operationally defined and what are the different theoretical concepts from cognitive psychology that are current. Subsequent sessions investigate the neurophysiological, neuroanatomical, and neurochemical mechanisms of memory at the cellular level and then move on to the study of systems that function at the level of the whole organism. Concentration is on studies in mammals, particularly primates. 2 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS AN 704",
        "course_title": "Experimental Design and Statistical Methods",
        "description": "Graduate Prerequisites: consent of instructor This course provides a working understanding of experimental design and statistical analysis. Each class consists of lectures, examples of problems and discussion of theoretical issues underlying a particular experimental design. Both parametric and non-parametric approaches to data analysis will be explored. 2 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS AN 707",
        "course_title": "Neuro Aging",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 708",
        "course_title": "Clinical Anatomy",
        "description": "Graduate Prerequisites: Gross Anatomy An advanced anatomy course consisting of both guided laboratory dissection and related lectures on clinical anatomy by physicians in a variety of clinical specialties. Laboratory dissections are based on actual surgical approaches; whenever possible, and the relationship between gross anatomy radiographic anatomy is continually emphasized. 2 cr, Spring sem.",
        "prerequisites": "Gross Anatomy"
    },
    {
        "course_code": "GMS AN 715",
        "course_title": "Professional Skills for Students in the Biomedical Sciences",
        "description": "Graduate Prerequisites: consent of instructor This course discusses many of the professional skills and ethical issues that are part of an academic biomedical career. Some of the topics include funding mechanisms, determination of authorship, intellectual property, conflict of interest, human and animal subject protection, reviewing responsibilities and mentoring. 2 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS AN 716",
        "course_title": "Developmental Cognitive Neuroscience",
        "description": "Graduate Prerequisites: background in neuroscience This course discusses the development of the nervous system and higher cognitive function through lectures by faculty engaged in research on these topics and through discussion of current primary literature. Emphasis is on primate and human brain systems involved in cognition. This course is designed to complement the Cognitive Neuroscience course offered in the Spring semester. 4 cr., Fall sem.",
        "prerequisites": "background in neuroscience"
    },
    {
        "course_code": "GMS AN 718",
        "course_title": "Methods in Neuroscience",
        "description": "This course will provide a general overview of major techniques and methods used in contemporary neuroscience research. Lectures (accompanied by practical demonstrations in many cases) by faculty who are experts in these approaches will provide students with the knowledge to understand methods to probe the brain from molecules to behavior. 4 cr, Spring sem."
    },
    {
        "course_code": "GMS AN 719",
        "course_title": "Hum Gross Anat",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 722",
        "course_title": "Cell Org Tissue",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 723",
        "course_title": "Human Body Syst",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 724",
        "course_title": "Advanced Neuroanatomy",
        "description": "This course builds on the foundation in neuroanatomy obtained in departmental neuroscience courses by examining the structure of the human central nervous system in greater detail. Discussions center around readings in advanced neuroanatomy textbooks such as The Human Central Nervous System: A Synopsis and Atlas by Rudolf Nieuwenhuys. A laboratory component provides students the opportunity to perform dissections of specific brain areas and white matter pathways in human brain specimens. 4 cr, Spring sem."
    },
    {
        "course_code": "GMS AN 725",
        "course_title": "Neuroanatomy",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 726",
        "course_title": "Found Histology",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 777",
        "course_title": "Cell/Mol Neuro",
        "description": "Graduate Prerequisites: Consent of the instructor This course description is currently under construction.",
        "prerequisites": "Consent of the instructor"
    },
    {
        "course_code": "GMS AN 803",
        "course_title": "Res Practicum",
        "description": "Varied topics in laboratory research.. Var. cr, Fall, Spring and Summer sems."
    },
    {
        "course_code": "GMS AN 804",
        "course_title": "Spfc Topic Anat",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 805",
        "course_title": "Teaching Practicum in the Biomedical Sciences (Practicum, Vesalius 3)",
        "description": "Graduate Prerequisites: GMS AN 806 Students, putting theory into practice, work in collaboration with a selected faculty mentor in one of the following formats: large lecture, small lecture or seminar, workshop, or even proposing and developing a new course. Students may enroll in this course multiple times for different mentored experiences. Var cr, Fall & Spring sem.",
        "prerequisites": "GMS AN 806"
    },
    {
        "course_code": "GMS AN 806",
        "course_title": "Foundations in Teaching in the Biomedical Sciences (Vesalius 1)",
        "description": "This course offers instruction in the theory of teaching, presentation skills, and teaching methods. Effective teaching practices are taught and refined, and the methods of teaching in different formats (one-on-one, small group, large lecture, etc.) are evaluated. Lesson plan and support plan construction and the understanding of assessment and evaluation tools are particularly emphasized. 2 cr. Spring sem."
    },
    {
        "course_code": "GMS AN 807",
        "course_title": "Neuro Vis Sys",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 809",
        "course_title": "Applied Teachng",
        "description": "Graduate Prerequisites: AN 806 This course description is currently under construction.",
        "prerequisites": "AN 806"
    },
    {
        "course_code": "GMS AN 810",
        "course_title": "Systems Neurobiology",
        "description": "Graduate Prerequisites: consent of instructor; undergraduate course in biological aspects of neuroscience (neurophysiology and neuroanatomy) or Medical Neuroscience This course will cover the major sensory, motor, regulatory, and associative/integrative neural systems in depth from the basic cellular, neurophysiological, and neurochemical properties of the each to their overall function. 4 cr. Fall sem",
        "prerequisites": "consent of instructor; undergraduate course in biological aspects of neuroscience (neurophysiology and neuroanatomy) or Medical Neuroscience"
    },
    {
        "course_code": "GMS AN 811",
        "course_title": "Cognitive Neuroscience",
        "description": "Graduate Prerequisites: consent of instructor This course will cover topics in the various domains of higher cortical function, including attention, language, visuospatial abilities, memory and executive function. It will also cover topics in learning, sleep, addiction, and behaviors under the influence of circadian rhythms. 4 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS AN 815",
        "course_title": "Writing",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 820",
        "course_title": "Inter Systems",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS AN 901",
        "course_title": "Anatomy Res",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 902",
        "course_title": "Anatomy Res",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS AN 904",
        "course_title": "Research Practicum",
        "description": "Varied topics. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS BC 600",
        "course_title": "Biology, Chemistry and Physics of Natural and Man-made Hazards",
        "description": "This course provides a broad overview of physical, chemical and biological aspects of man-made and natural hazards. Hazards range from the everyday-thunderstorms, winter, chemical spills, disease clusters-to the extraordinary-powerful hurricane, earthquakes, dirty bombs, and pandemic. This course will teach details essential to every healthcare emergency manager to prepare for known and emerging threats, including threats to the infrastructure essential to healthcare delivery. Emphasis will be placed on the increasing number of technological hazards, both those that may be intentionally introduced to those created because of the international connectivity provided by airplanes. Discussion will include the short, medium and long term impact to human populations and infrastructures of the various hazards and the impacts on triage and triage decision making processes. 3 cr"
    },
    {
        "course_code": "GMS BC 610",
        "course_title": "Medical Consequences of Natural and Man-made Hazards",
        "description": "This course provides a broad overview of medical consequences of man-made and natural hazards. Hazards can directly impact people's lives, as well as indirectly by damaging an area's health infrastructure. This course will teach details essential to every healthcare emergency manager to prepare for known and emerging threats, including discussing external and internal hazards. Emphasis will be placed on human population effects, and the wide range of multiple interdependent aspects of social, cultural and physical infrastructures. Discussion will include the short, medium and long term impact on healthcare delivery, including the importance of psychological concerns such as morale and post-event counseling. 3 cr"
    },
    {
        "course_code": "GMS BC 620",
        "course_title": "Psychology and Sociology of Disasters and Methods of Risk Communication",
        "description": "This course surveys psychological and social factors affecting community and individual responses to disasters. Emphasis is placed on groups who may experience greater impact as a result of disability, social, economic, or racial disparities. This course explores the methods of risk communications to diverse audiences including considerations of subjectivity of risk, translating complex concepts into clear concise informative messages, and recognizing time sensitivity of information. 3 cr"
    },
    {
        "course_code": "GMS BC 630",
        "course_title": "Ethical & Policy Issues in Health and Medical Services Emergency Management",
        "description": "This course explores the complex issues surrounding ethical, legal and policy issues concerning health and health care delivery under crisis conditions. Issues evaluated include end-of-life decision making, implications of triage, medical malpractice, insurance company regulation and liability. Additionally, the interrelationships of the various levels, and often competing branches, of government will be evaluated. 3 cr"
    },
    {
        "course_code": "GMS BC 640",
        "course_title": "Experimental Design and Statistics",
        "description": "This course will explore various methods of experimental design and systems thinking applications for students to use in management and resource allocation modeling activities. We will review various methods of data collection and use, standard mathematical and statistical methods for assigning estimators, and the resulting application of these elements in systems modeling activities. The purpose of this course is to make students aware of methods and practices for analyzing complex systems. The outcome of these types of analysis aid in planning and management of ongoing crisis or disaster contingency and operations. 2 cr"
    },
    {
        "course_code": "GMS BC 650",
        "course_title": "Community Health and Emergency Management",
        "description": "Public Health is a multidisciplinary field that aims to prevent disease and death and to promote a healthy quality of life. Public Health surveillance, intervention, and evaluation intervene at the population and societal level, taking on the effort to advance the health and safety of the greatest amount of people. This course will explore the multiple concentrations of public health, focusing on epidemiology and environmental health. In order to understand what public health is and how it should be applied during an emergency, this course will discuss specific epidemiological disasters in history, the scientific and statistical perspective associated with collecting, analyzing, interpreting and utilizing data, and the interconnectedness that is required to rapidly evaluate and manage disasters. 3 cr"
    },
    {
        "course_code": "GMS BC 692",
        "course_title": "Directed Study",
        "description": "Var cr"
    },
    {
        "course_code": "GMS BC 700",
        "course_title": "The Disaster Lifecycle",
        "description": "This course focuses on examining health needs and health care delivery methods to prepare for, respond to, recover from, and mitigate impacts of crises. Preparedness consists of being ready for any kind of emergency no matter what the source of the disaster. Practically this means looking at preparedness from an all-hazards perspective and developing the complicated array of policies, methods and programs. Disaster response is a complicated multi-institutional operation requiring sophisticated planning, logistics and communications. Response planning emphasizes the interface and coordination requirements of the National Response Framework. Recovery involves all the necessary actions to reinstate normal operations including reconstitution of necessary data, hardware, software, personnel, supplies and facilities. Recovery actions are focused on issues and decisions that occur after immediate response needs are addressed. Current and proposed Federal, state, local and private nonprofit disaster recovery methods are discussed. This course addresses these issues through discussion of the cycle of planning, training, equipping, exercising and mission continuity processes and reviewing case studies of current and past governmental and private methods. 3 cr"
    },
    {
        "course_code": "GMS BC 710",
        "course_title": "Methods and Practices of Incident Command",
        "description": "This course examines command and control processes, including Incident and Unified Command Structures, under crisis and disaster management situations for health and medical services. Use of simulations tools will be accomplished (such as Incident Commander: A Crisis Training Simulation) to provide training of community management level incident command actions, based on the Federal Emergency Management Agency (FEMA) mandated command structures articulated in the National Incident Management System. Additionally, decision making under uncertainty and emerging social and operational network theory will be evaluated and discussed. 3 cr"
    },
    {
        "course_code": "GMS BC 730",
        "course_title": "Principles, Methods, and Practices of Modeling and Simulation",
        "description": "This course involves instructing students in various methods and practices of modeling and simulation with specific focus on applicability to biomedical health and medical services crisis management. Using estimates and probability of events students will design dynamic simulation modeling support tools to aiding in measures to be taken to prevent, mitigate, and recover from a disaster. Specific modeling applications to be performed will be through a unique hands-on experience in the development and use of computer-based models to study policy- and decision making. The STELLA software system will be used in the course. 3 cr"
    },
    {
        "course_code": "GMS BC 971",
        "course_title": "Research Practicum and Thesis I - Designing Crisis Management Research",
        "description": "This is the first phase of a directed research and development project in biomedical crisis management. During this course students identify an area of the crisis management process on which to perform research and design a modeling and simulation exercise. 2 cr"
    },
    {
        "course_code": "GMS BC 972",
        "course_title": "Research II",
        "description": "This is the capstone course for the Program. Utilizing the base of knowledge gained throughout the previous year, and applying learned methods in modeling and simulation, this practicum provides the student with an opportunity to perform a guided research activity focused on health care under crisis.The specific objective of this capstone requirement is to prepare the student to be able to directly contribute to the process of crisis management and to equip the student with practical experience in evaluating and planning for future potential crises conditions. 2 cr"
    },
    {
        "course_code": "GMS BI 777",
        "course_title": "Techniques in Biomedical Research",
        "description": "Graduate Prerequisites: consent of instructor Success in biomedical research requires proposing, developing and testing a novel hypothesis. The generation of a novel hypothesis in turn requires the ability to apply the scientific method and then implement the appropriate techniques to address the experimental question. This course will complement the Foundations in Biomedical Sciences (FiBS) curriculum by providing students with a comprehensive understanding of the core experimental methods used in biomedical research. By the end of this course, students will master the concepts behind a wide range of experimental techniques and technologies and then be prepared to apply the most appropriate experimental system to a given biological question. Biochemical knowledge regarding \"how things work\" and \"how to cook from scratch in the lab\" will enable students to develop their own experimental research strategies. Specific topics to be covered include: the scientific method/lab basics, cell culture and gene transfer, protein extraction and analysis, DNA and cloning, PCR, DNA-protein interactions and chromatin, RNA and quantitative PCR, lipids, transgenic and knockout mice, mass spectrometry, flow cytometry, microarray and next generation sequencing, histology and confocal microscopy. This course is team taught and will use lectures, in class discussions, and focused problem sets. A concise final written assignment is designed to test the students' mastery of the subject matter. 2 cr., Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BI 778",
        "course_title": "Molecular Mechanisms of Cardiovascular Disease",
        "description": "The course deals with research topics relevant to cardiovascular disease including lipoproteins, atherosclerosis, oxidative stress, diabetes, hypertension, congenital heart abnormalities, gene therapy, stem cell therapies and others. Emphasis is placed on molecular and cellular mechanisms of normal vascular function and of vascular dysfunction leading to disease. Each session is taught by an expert in the field. Each student presents an original paper assigned by the instructors and writes and presents a review. Offered alternate years. 2 cr, Fall sem."
    },
    {
        "course_code": "GMS BI 793",
        "course_title": "Mass Spectrometry, Proteomics and Functional Genomics",
        "description": "Graduate Prerequisites: consent of instructor The application of mass spectrometry to protein, glycoconjugate and carbohydrate structures has propelled developments in proteomics and functional genomics. This course describes how to use mass spectrometry to answer structural and functional questions in biomedical research. The course explores the background necessary to effectively design mass spectrometric (MS) experiments and interpret data. Students gain a full understanding of modern MS and its effective use in research. Lectures are devoted to instrumentation, ionization methods, applications to proteins, lipids, carbohydrates, glycoconjugates, nucleic acids and uses of the technology in proteomics, biotechnology and medicine. 2 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 775",
        "course_title": "Human Neuropsychology I",
        "description": "Graduate Prerequisites: consent of instructor This course focuses on the relationship of the field of neuropsychology to other medical and scientific disciplines. Includes neuropsychological assessment, electrical activity of the brain, the study of attention, cerebral dominance, pathologies of language, traumatic brain injuries, PTSD and Parkinson's Disease. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 776",
        "course_title": "Human Neuropsychology II",
        "description": "Graduate Prerequisites: consent of instructor This course focuses on the relationship of the field of neuropsychology to other medical and scientific disciplines. Includes neuropsychological and pathological aspects of neurological disease. Topics include dementing diseases, memory, epilepsy, child development, neurotoxicant exposures, and brain stimulation treatments. 4 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 778",
        "course_title": "Basic Neuro",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 779",
        "course_title": "Beg Basic Neuro",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS BN 780",
        "course_title": "Behavioral and Biological Aspects of Stress and Trauma",
        "description": "Graduate Prerequisites: consent of instructor This course provides an overview of theory and research on stress and trauma, with attention to biological, psychological, and social factors. Special emphasis placed on gender issues, developmental factors, psychopathology, and physical health. 2 cr, Spring semester.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 782",
        "course_title": "Forensic Neurop",
        "description": "Graduate Prerequisites: Human Neuropsychology course or some other introduction to the study of brain-behavior relations; consent of instructor This course description is currently under construction.",
        "prerequisites": "Human Neuropsychology course or some other introduction to the study of brain-behavior relations; consent of instructor"
    },
    {
        "course_code": "GMS BN 791",
        "course_title": "Directed Studies in Behavioral Neuroscience",
        "description": "Var cr, Fall sem."
    },
    {
        "course_code": "GMS BN 792",
        "course_title": "Directed Studies in Behavioral Neuroscience",
        "description": "Var cr, Spring sem."
    },
    {
        "course_code": "GMS BN 794",
        "course_title": "Brain Dominance",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 795",
        "course_title": "Cognitive Neuroscience of Memory and Perception",
        "description": "Graduate Prerequisites: consent of instructor The study of normal and abnormal perception and memory is related to brain structure and function. This seminar covers theoretical and clinical issues about how abilities change in normal and abnormal (e.g., Alzheimer's disease) conditions, using a variety of methods. 4 cr, Fall or Spring sem. on demand.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 796",
        "course_title": "Neuropsychological Assessment I",
        "description": "Graduate Prerequisites: consent of instructor Overview of neuropsychological tests used for cognitive assessment in clinical and research settings. Focus is on determining appropriate outcome measures to quantify brain behavior relationships. Students will learn the Boston Process Approach for qualitative measurements and standardized assessment procedures of quantitative measurements in the differential diagnosis and symptomatology of neurological and neuropsychiatric syndromes. The course prepares students to design neuropsychological assessment batteries for research studies. Students work with the instructor to develop a research protocol for neurological populations of interest to the student. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 797",
        "course_title": "Neuroassess 2",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 798",
        "course_title": "Cns Functions",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 821",
        "course_title": "Seminar in Neuroimaging",
        "description": "Graduate Prerequisites: consent of instructor Overview of neuroimaging techniques available as adjuncts to neuropsychological measures of human brain damage. Intended for students with limited background in the application of neuroimaging techniques for the study of neuropsychiatric illnesses. Techniques, including MRI, fMRI, DTI, MRS, PET and SPECT will be covered with relevance to selected neurobehavioral disorders. 2 cr, Spring sem..",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 891",
        "course_title": "Case Studies Np",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS BN 892",
        "course_title": "Case Studies",
        "description": "2 cr, Spring sem."
    },
    {
        "course_code": "GMS BN 893",
        "course_title": "Child Clinical Neuropsychology",
        "description": "Graduate Prerequisites: consent of instructor Covers general theoretical issues (e.g., intrauterine and postnatal development of the brain, handedness and lateralization of function, and recovery of function and neurobehavioral plasticity); diagnostic entities (e.g., attention deficit disorder, effects of early brain damage, developmental language disorders, dyslexia, and effects of malnutrition); and assessment and treatment (development of attention, social, spatial abilities, and language). 4 cr, Fall or Spring sem, on demand.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BN 991",
        "course_title": "Research in Behavioral Neuroscience",
        "description": "Var cr, Fall sem."
    },
    {
        "course_code": "GMS BN 992",
        "course_title": "Research in Behavioral Neuroscience",
        "description": "Var cr, Spring sem."
    },
    {
        "course_code": "GMS BR 700",
        "course_title": "Biological Core Technology Research Practicum",
        "description": "The 8-credit course spans three semesters and consists of 2 practica and culminates with a capstone project or thesis."
    },
    {
        "course_code": "GMS BT 104",
        "course_title": "Medical Terminology 1",
        "description": "Understanding medical terminology is fundamental for anyone working in the sciences. It is the language of the technician or researcher involved in biotechnology, biomedical investigations, or clinical research. Students learn the analysis and construction of medical words within a context of scientific concepts. After the basics, students learn the anatomy and diseases of the following systems: male and female reproductive, cardiovascular, respiratory, and blood. Technology fee applies to online section only."
    },
    {
        "course_code": "GMS BT 106",
        "course_title": "Medical Terminology 2",
        "description": "Prereq: GMS BT 104 (Med Term 1) or consent of program director. Continue building your medical vocabulary as you learn the anatomy and diseases of the following systems: digestive, urinary, lymphatic/immune and endocrine. Technology fee applies to online section only."
    },
    {
        "course_code": "GMS BT 110",
        "course_title": "Introduction to Biomedical Laboratory Sciences",
        "description": "Prereq: One semester of biology, two semesters of chemistry and BT 208 (Ess. Math for Biotech) or consent of program director. Provides a theoretical and practical foundation in laboratory science. Students are introduced to the scientific method, laboratory mathematics, chemistry, biochemistry, cell and molecular biology, and immunology. Students learn hands-on solution making, electrophoresis, protein quantitation and other commonly used laboratory methods. Emphasis is placed on lab safety, proper handling of instruments, careful following of written instructions for lab procedures, maintenance of lab notebooks, and data collection, presentation and analysis. Laboratory course."
    },
    {
        "course_code": "GMS BT 201",
        "course_title": "Anatomy and Physiology 1",
        "description": "Prereq: One semester of biology. This course provides a practical understanding of anatomic structures and coordinates this knowledge with the various functions of the human body. Also explored are regulatory processes that integrate cells, tissues, organs and systems. Topics include: organization of the body, tissue development, cellular structure and function as well as the integumentary (skin), skeletal, and muscular systems. The last third of the course focuses on the nervous system. The course incorporates clinical material throughout."
    },
    {
        "course_code": "GMS BT 202",
        "course_title": "Anatomy and Physiology 2",
        "description": "Prereq: GMS BT 201 (A&P 1) or consent of program director. This course is the second half of an intensive sequence designed to integrate the structure with the function of the human body. The course covers the endocrine, cardiovascular, lymphatic and immune, respiratory, digestive, urinary and reproductive systems. Students study these systems as they relate to homeostasis and clinical disorders. Laboratory exercises on each system are incorporated into the course materials."
    },
    {
        "course_code": "GMS BT 205",
        "course_title": "Scientific Writing and Communication",
        "description": "This course will provide students with training in fundamental writing mechanics, basic scientific writing, and oral presentations. The class will help to develop the ability to communicate science effectively in a variety of contexts, including how to present science to non-expert audiences. The course will be taught in two parts: Part-1: Will teach and reiterate fundamental writing skills that students need to master in order to write clearly, concisely, and effectively; Part-2: Will contain a number of writing and presentation exercises that prepare students to write a full-length report of a scientific study. Examples of class topics include: Defining what is good writing; Writing basics--punctuation, grammar, parallelism; Paragraphs, logic flow and organization; Dissecting a scientific abstract, etc."
    },
    {
        "course_code": "GMS BT 208",
        "course_title": "Essential Math for Biotechnology",
        "description": "Prereq: College algebra. This course prepares students for math calculations commonly used in biotech/biomedical laboratories, and in BLCS courses such as BT 110 (Intro Biomed Lab Sci), BT 411 (Protein Purific.), and BT 454 (Cell Culture). Topics include scientific notation, metric system, solution concentration, dilutions, and logarithmic scales. Some classes are held in the laboratory so that students can apply math skills to solution making, serial dilutions and standard curves. Students also develop strategies for solving word problems and explore the essential elements of data organization, summarization and presentation. Some laboratory exercises."
    },
    {
        "course_code": "GMS BT 210",
        "course_title": "Medical Writing in Clinical Research",
        "description": "Prereq: GMS BT 560 GCP or equivalent or consent of program director. This course introduces students to the structure, content, and regulatory requirements of documents created for the clinical research industry. Students learn about FDA regulations and ICH guidelines for drugs and biologics, the AMA Manual of Style, and other common industry standards. Students learn to apply these industry standards to compose clinical research documents such as a clinical study protocol, informed consent form, and clinical study results."
    },
    {
        "course_code": "GMS BT 290",
        "course_title": "Disease and Public Health",
        "description": "Prereq: GMS BT 104 or 106 Medical Terminology or equivalent or permission of program director. This course is designed to familiarize students with concepts of public health as a field of study and how different diseases impact society. We will use the Boston Public Health Commission report on the \"Health of Boston\" as a template for learning about healthcare disparities, social justice, cancer screening, cancer incidence and mortality, infectious diseases and environmental factors that impact people and population health. Students will begin to make connections between previous coursework, such as cell biology, pathology and anatomy, as well as new concepts, including epidemiology, immunology and experimental designs, as they pertain to the study of human disease. The goal of the course is to give students a knowledge-base that can prepare them for thinking critically should they decide to work in a research, diagnostic or public health setting."
    },
    {
        "course_code": "GMS BT 301",
        "course_title": "Introduction to Biomedical Research Laboratory Techniques",
        "description": "Prereq: GMS BT110 and GMS BT208. This course will focus on the fundamental laboratory skills that students need to prepare for a career in the biomedical sciences. The course emphasizes the theoretical as well as the applied aspects of basic methodologies in research. The course is reinforced with applied, hands-on laboratory sessions that provides practical experience in the topics covered in the preceding lectures. The majority of class time will be designed to provide students with ample hands-on time in the lab to practice their skills in the presence of the course instructor. The course will focus on providing students with a set of basic laboratory skills, such as safety practices, laboratory mathematics, documentation, and good laboratory ethics. Students will also be educated in research methodology, data analysis, and data presentation. Topics covered include solution chemistry; protein extraction and detection using Western blot and ELISA; the basic principles of immunohistochemistry; cell culture basics, and RNA extraction. Students, even those with some previous laboratory hands-on experience, will benefit from this course because of its combined focus on the theoretical and applied aspects of laboratory techniques/methods. The proposed topics of study would include: Introduction to Proteins Protein Detection Methods; Gene Expression; Principles of Immunohistochemistry and Protein Colonization; Microscopy and Imaging, etc."
    },
    {
        "course_code": "GMS BT 342",
        "course_title": "Cell Biology",
        "description": "Prereq: GMS BT110, GMS BT208, and GMS BT301. This course introduces students to eukaryotic cell structure and function, and covers various cellular components -- including the plasma membrane, mitochondria and the cytoskeleton -- and examine their roles in the cell. Additionally, students explore essential cellular processes including cell communication and the cell cycle. The course also highlights the unique features of some specialized cell types such as germ and stem cells."
    },
    {
        "course_code": "GMS BT 405",
        "course_title": "Biochemistry",
        "description": "Prereq: Satisfactory completion of 1 semester of college biology with lab, 2 semesters of college chemistry with lab, and GMS BT342. This course introduces students to the fundamental biochemical principles that underlie cell function. Topics include the structure and function of biomolecules, including proteins, lipids, carbohydrates and nucleic acids, as well as the metabolic pathways involved in their synthesis and degradation. Emphasis is given to metabolic regulation and mechanisms of enzyme action."
    },
    {
        "course_code": "GMS BT 426",
        "course_title": "Medical Microbiology",
        "description": "Prereq: one semester of biology and two semesters of chemistry. Provides the student with an understanding of clinically important microorganisms. Students become familiar with the classification, pathogenicity, identification, and prevention and treatment of diseases caused by bacteria, fungi, and parasites as well as the workings of a modern clinical microbiology laboratory. Laboratory course."
    },
    {
        "course_code": "GMS BT 436",
        "course_title": "Human Genetics",
        "description": "Prereq: one semester of biology and two semesters of chemistry, BT 342 (Cell Bio) or BT 413 (Mol Bio). This course focuses on human genetics with a strong emphasis on the relationship between DNA structure, disease manifestation, and inheritance. The course reviews the molecular mechanisms underlying the flow of information within a cell from DNA to protein, population genetics, genetics of immunity and cancer, reproductive technologies, epigenetics, genomics and cancer stem cells. The class includes lectures and student presentations."
    },
    {
        "course_code": "GMS BT 440",
        "course_title": "Genetics, Ethics, and the Law",
        "description": "This online class explores the newest information and legal and bioethical implications in human genetics, using audio-visuals, actual cases, discussions and lecture. Topics include: new reproductive techniques, genetic diseases, prenatal testing and genetic testing, DNA fingerprinting, cloning, and DNA technology. Online only; technology fee applies."
    },
    {
        "course_code": "GMS BT 442",
        "course_title": "Issues in Assisted Reproduction",
        "description": "This course addresses the legal, ethical and scientific aspects of Assisted Reproduction (also called ART-Assisted Reproductive Techniques). The science of treating infertility has expanded amazingly in the last 15 years, from the use of sperm donors to selling eggs on the internet. Assisted Reproductive techniques are constantly changing and have given rise to many legal cases and ethical questions, which this course will. This course closely examines these legal and ethical questions. Online only; technology fee applies."
    },
    {
        "course_code": "GMS BT 482",
        "course_title": "Advanced Biomedical Research Laboratory Techniques",
        "description": "This course will focus on more advanced laboratory skills that students would benefit from as they prepare for a career in the biomedical sciences. The course emphasizes the theoretical as well as the applied aspects of advanced research techniques in the biomedical sciences. The course is reinforced with applied, hands-on laboratory sessions that would provide practical experience in the topics covered in the preceding lectures. The majority of class time will be designed to provide students with ample hands-on time in the lab to practice their skills in the presence of the course instructor. The course will focus on providing students with a set of specialized laboratory skills, such as advanced cell culture practices, protein purification, and biospecimen processing and imaging. Students will also be educated in research methodology, data analysis, and data presentation. Topics covered include: transfections; reporter assays and a variety of optical assays; chromatography, electrophoresis and blotting techniques; dissection, tissue preservation techniques, and photomicroscopy. Students, even those with some previous laboratory hands-on experience, will benefit from this course because of its combined focus on the theoretical and applied aspects of advance laboratory techniques/methods."
    },
    {
        "course_code": "GMS BT 520",
        "course_title": "Biology of Cancer",
        "description": "Prereq: BT 405 (Biochem) and BT 413 (Mol Bio) or consent of program director. This course focuses on the cellular and molecular changes that underlie the development and progression of human cancer. Students examine the pathways and processes that involve oncogenes and tumor suppressor genes to understand how they can contribute to cancer. Complex interactions including angiogenesis, tumor immunology, invasion and metastasis are studied as well. In addition,the course covers targeted approaches to cancer therapy and the latest scientific research including cancer epigenetics, microRNAs and cancer stem cells."
    },
    {
        "course_code": "GMS BT 540",
        "course_title": "Regulatory and Compliance Issues",
        "description": "Clinical research is conducted to meet the needs of the intended patient population with an investigational medical intervention. But a favorable medical outcome is not the only criterion that is used to judge whether a product can be marketed. Clinical research needs to meet the rigorous standards of the regulators, the ethicists, and the auditors. This course reviews the laws that are in place that are designed to guide the complexities of clinical research. We will use case studies to illustrate what can really happen when clinical studies are conducted -- you may be surprised with what you find. Using group activities and exercises, we will explore the options and approaches used to manage these clinical research issues. 4 cr."
    },
    {
        "course_code": "GMS BT 560",
        "course_title": "Good Clinical Practices (GCP) in Clinical Research",
        "description": "This course introduces the international standards for ethical conduct of research and maintaining the highest level of scientific quality when conducting clinical trials. Topics include the regulatory responsibilities of sponsors, monitors, and investigators conducting clinical trials; the phases of clinical trials leading up to FDA approval of a new drug or device; and how to get a trial up and running including the selection of qualified investigators, obtaining approval to conduct the study from an ethics committee, and completing the regulatory documentation that is required for getting a site ready to enroll patients. The course also covers ensuring data integrity, handling ethical dilemmas, and reporting of serious adverse events. Case studies, review of current media, and exercises will be used to practice the application of information provided in class and to demonstrate GCP compliance from an industry perspective. Group discussions, individual and group projects, and guest speakers help students learn the practical skills used in the field."
    },
    {
        "course_code": "GMS BT 594",
        "course_title": "Clinical Research Practicum",
        "description": "for Fall and Summer 1 semesters. Prereq: 16 credits in clinical research. Directed study offering direct experience with the conduct of a clinical trial. Student will work on a supervised project within an approved clinical research site. For matriculated students only; register via the program director."
    },
    {
        "course_code": "GMS BT 595",
        "course_title": "Clinical Research Practicum",
        "description": "for Spring and Summer 2 semesters. Prereq: 16 credits in clinical research. Directed study offering direct experience with the conduct of a clinical trial. Student will work on a supervised project within an approved clinical research site. For matriculated students only; register via the program director."
    },
    {
        "course_code": "GMS BT 596",
        "course_title": "Research Pract",
        "description": null
    },
    {
        "course_code": "GMS BT 597",
        "course_title": "Research Pract",
        "description": null
    },
    {
        "course_code": "GMS BY 762",
        "course_title": "Foundations of Structural Biology I",
        "description": "Graduate Prerequisites: consent of instructor This graduate-level course provides a thorough grounding in the theory and major experimental methods of Structural Biology. The Fall semester (BY762) covers x-ray crystallography and electron microscopy. The Spring semester (BY763) covers NMR, protein thermodynamics, and spectroscopy. Semesters are independent and may be taken in either order. 2 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BY 763",
        "course_title": "Foundations of Structural Biology II",
        "description": "Graduate Prerequisites: consent of instructor This graduate-level course provides a thorough grounding in the theory and major experimental methods of Structural Biology. The Fall semester (BY762) covers x-ray crystallography and electron microscopy. The Spring semester (BY763) covers NMR, protein thermodynamics, and spectroscopy. Semesters are independent and may be taken in either order. 2 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BY 772",
        "course_title": "Nuclear Magnetic Resonance Spectroscopy and Imaging in Biology and Biochemistry",
        "description": "Prereq: consent of instructor. An introduction to the basic theory and the fundamental measurements of NMR spectroscopy using the predominant biological nuclei, 1H, 2H, 13C, and 31P, and applications to structure and metabolism; NMR and MRI studies of pathological processes. Hamilton. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS BY 774",
        "course_title": "Metabolism and Cellular Functions of Complex Lipids",
        "description": "Prereq: consent of instructor. In-depth description of selected areas of lipid metabolism. Emphasis on functional roles of specific lipid species in cellular processes (e.g., cell activation, protein transport and function). Use of timely articles to discuss newly developed techniques and concepts. Zoeller. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS BY 776",
        "course_title": "Macromolecular Assemblies I",
        "description": "Graduate Prerequisites: consent of instructor This graduate course covers the concepts of the assembly of biomacromolecules, their structure and stabilizing forces, and biological function as related to structure. Examples are drawn from assemblies of proteins, lipids, lipoprotein systems, membranes and viruses. The Fall semester (BY776) covers protein assemblies, protein-nucleic acid assemblies, and membrane proteins. The Spring semester (BY777) covers lipid-protein assemblies. Semesters are independent and may be taken in either order. 2 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BY 777",
        "course_title": "Macromolecular Assemblies II",
        "description": "Graduate Prerequisites: consent of instructor This graduate course covers the concepts of the assembly of biomacromolecules, their structure and stabilizing forces, and biological function as related to structure. Examples are drawn from assemblies of proteins, lipids, lipoprotein systems, membranes and viruses. The Fall semester (BY776) covers protein assemblies, protein-nucleic acid assemblies, and membrane proteins. The Spring semester (BY777) covers lipid-protein assemblies. Semesters are independent and may be taken in either order. 2 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS BY 871",
        "course_title": "Biophysics Special Topics/Student Seminar",
        "description": "A weekly program in which students present seminars on assigned or selected current scientific literature, attend seminars, and learn grant-writing skills. Emphasis is placed on class participation by all students. 2 cr, Fall sem."
    },
    {
        "course_code": "GMS BY 872",
        "course_title": "Biophysics Special Topics/Student Seminar",
        "description": "A weekly program in which students present seminars on assigned or selected current scientific literature, attend seminars, and learn grant-writing skills. Emphasis is placed on class participation by all students. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS BY 945",
        "course_title": "Research Biophysics",
        "description": "Var cr"
    },
    {
        "course_code": "GMS BY 946",
        "course_title": "Research Biophysics",
        "description": "Var cr"
    },
    {
        "course_code": "GMS CI 631",
        "course_title": "The Management of Clinical Trials",
        "description": "Graduate Prerequisites: GMS CI 675 and consent of instructor This course is an integrative learning experience, combining a comprehensive review of the good clinical practice core principles with an explanation and analysis of selected portions of the Code of Federal Regulations (CFR), applicable to clinical research during the new drug development process. The case study approach is used in this course since the drug development industry translates these regulations into both written and unwritten standards, practices, and guidelines. Each session will use activities to expand the interpretation of the regulations, into an operational and organizational focus, further integrating real-life issues into the classroom. In order to ensure that classroom learning is linked with the students' work experiences, there will be an outside project required which will incorporate the course work with the simulated on-the-job situations, and a final presentation to share the learning with the entire class. 4 cr, Spring sem.",
        "prerequisites": "GMS CI 675 and consent of instructor"
    },
    {
        "course_code": "GMS CI 640",
        "course_title": "Regulatory and Compliance Issues",
        "description": "Graduate Prerequisites: consent of instructor This course explains the regulatory requirements for health-care products, that is, drugs, biologics, and devices. It is intended for those interested in regulatory affairs or the clinical evaluation, development, manufacture, testing and/or commercialization of these products. Provides an in-depth review of pertinent FDA regulations and guidance and links these to the scientific and logistical activities involved in taking a medical product from research to market. Content and preparation of regulatory submissions, including an Investigational New Drug Application (IND), an Investigational Device Exemption (IDE), a New Drug Application (NDA), a Biologic License Application (BLA), a Pre-Market Approval Application (PMA), and a 510K Pre- Market Notification are described. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS CI 660",
        "course_title": "Good Clinical Practices in Clinical Research",
        "description": "Graduate Prerequisites: consent of instructor This course introduces students to the regulatory responsibilities of sponsors, monitors, and investigators conducting clinical trials. Practical information and exercises are designed to demonstrate GCP compliance from an industry perspective as well as from an academic perspective. Topics Include: Human protection in clinical trials, institutional review boards, selecting and qualifying investigators, consenting subjects, initiating, monitoring and closing out sites successfully and safety monitoring in clinical trials. Group discussions and exercises help students learn practical skills. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS CI 670",
        "course_title": "Biostatistics with Computing",
        "description": "Graduate Prerequisites: consent of instructor This course is designed for students with no prior experience with statistics who want to utilize computer software in performing statistical analysis. Topics include the collection, classification, and presentation of descriptive data; the rationale of hypothesis testing; t-tests and chi-square tests; correlation and regression analysis; sample size calculations, and analysis of contingency tables. Computer Laboratory course. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS CI 671",
        "course_title": "Intermediate Statistical Analysis and Computing for Clinical Research",
        "description": "This course covers analytic and computational methods for modeling and regression analysis in the biomedical sciences. Emphasis is on fitting exploratory and inferential models to data in epidemiology and clinical trials. Topics include tabular and graphical summary; the linear, logistic and Poisson regression models; the Kaplan-Meier method and Cox proportional hazards analysis; power calculation; estimation of effect size. Analyses are presented and completed using R and SAS software packages. Lecture and laboratory exercises are structured around worked examples from the recent biomedical literature. Acquired competency in statistical programming is a major focus of this course. 3 cr, Spring sem."
    },
    {
        "course_code": "GMS CI 675",
        "course_title": "Designing Clinical Research Studies",
        "description": "Graduate Prerequisites: consent of instructor This course covers important scientific and epidemiologic principles necessary for designing clinical research studies. Topics include bias, confounding, developing the research question, defining an appropriate study population, choosing outcome measures, clinical research ethics and regulation, sample size determination, and statistical analysis issues. Students will design and present a clinical research study during the course. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS CI 680",
        "course_title": "Legal/Eth Issue",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS CI 691",
        "course_title": "Directed Studies in Clinical Research",
        "description": "Directed study provides the opportunity for students to explore a special topic of interest identified by the student under the direction of a MSCR faculty member. Students may register after the MSCR faculty member has agreed to work with the student on a specific project. 2-4 cr, Fall sem."
    },
    {
        "course_code": "GMS CI 692",
        "course_title": "Directed Studies in Clinical Research",
        "description": "Directed study provides the opportunity for students to explore a special topic of interest identified by the student under the direction of a MSCR faculty member. Students may register after the MSCR faculty member has agreed to work with the student on a specific project. 2-4 cr, Spring sem."
    },
    {
        "course_code": "GMS CI 789",
        "course_title": "Crit Evalmedlit",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS CI 790",
        "course_title": "Seminar in Clinical Research",
        "description": "Graduate Prerequisites: GMS CI 675 The goal of this course will be to provide students experience in the reading and evaluation of recent basic science literature that may be pertinent to the origination and design of clinical research. The course will be a seminar format. It will consist of the evaluation of assigned readings of recent literature which may be relevant to the treatment of human diseases and which might be expected to lead to further animal experiments and to culminate in human trials. This format will provide an opportunity to learn to critically evaluate basic science literature and to develop oral presentation skills essential to function as a manager of clinical trials. 2 cr, Spring sem.",
        "prerequisites": "GMS CI 675"
    },
    {
        "course_code": "GMS CI 794",
        "course_title": "Clinical Research Practicum",
        "description": "The goal of the practicum experience is to provide the student hands-on exposure to clinical research. The student will work with a research mentor and will be actively involved in the development, execution, and evaluation of a clinical research project or project(s). During the practicum, it is expected that the student will be exposed to: clinical research planning, protocol preparation, interaction with Institutional Review Boards, regulatory requirements, selection of subjects/consent process, data collection, study monitoring, and data analysis. These various activities will most likely require involvement in more than one research project. Variable 2-4 cr, Fall sem"
    },
    {
        "course_code": "GMS CI 795",
        "course_title": "Clinical Research Practicum",
        "description": "The goal of the practicum experience is to provide the student hands-on exposure to clinical research. The student will work with a research mentor and will be actively involved in the development, execution, and evaluation of a clinical research project or project(s). During the practicum, it is expected that the student will be exposed to: clinical research planning, protocol preparation, interaction with Institutional Review Boards, regulatory requirements, selection of subjects/consent process, data collection, study monitoring, and data analysis. These various activities will most likely require involvement in more than one research project. Variable 2-4 cr, Spring sem"
    },
    {
        "course_code": "GMS CI 796",
        "course_title": "Prof & Sci Wrtg",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS CI 804",
        "course_title": "Capstone Research",
        "description": "Students in the MSCR program are required to complete a capstone project that applies the principles and methods learned in the coursework to a real- life clinical study. The goal of the capstone project is to demonstrate the student's understanding of the clinical research process from both a theoretical and a practical point of view. The capstone project is not a literature review. var. 2-4 cr, Fall."
    },
    {
        "course_code": "GMS CI 805",
        "course_title": "Capstone Research",
        "description": "Students in the MSCR program are required to complete a capstone project that applies the principles and methods learned in the coursework to a real- life clinical study. The goal of the capstone project is to demonstrate the student's understanding of the clinical research process from both a theoretical and a practical point of view. The capstone project is not a literature review. var. 2-4 cr, Spring."
    },
    {
        "course_code": "GMS FA 700",
        "course_title": "Professional Skills and Thesis Research Development for Forensic Anthropology",
        "description": "This course is designed to provide students with knowledge and experience in professional skills, including writing skills, professional communication, requesting letter of recommendation, applying to PhD programs, interview skills, and reading and interpreting journal articles. In addition, considerable class time will be spent on developing a research topic and hypothesis, preparing a thesis proposal and in introduction to data collection, statistical analysis and the use of several instruments and tools commonly used by forensic anthropologists. 3 cr, Fall sem."
    },
    {
        "course_code": "GMS FA 703",
        "course_title": "Zooarchaeology and Comparative Vertebrate Osteology",
        "description": "Graduate Prerequisites: consent of instructor This course will provide students with an advanced basis for vertebrate zooarchaeological analysis including terminology, data gathering, data analysis, and practical identification skills for both whole and fragmentary vertebrate remains. These skills will be of direct use in archaeology, paleontology, and forensic anthropology. 4 cr, Fall & Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 704",
        "course_title": "Bioarch",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 705",
        "course_title": "Forensic Anthropology Techniques",
        "description": "Graduate Prerequisites: consent of instructor This course will provide students with a detailed history of forensic anthropology, including pioneers in the field, bone growth and development, and an extensive knowledge of protocols, methods, and procedures used by forensic anthropologists, to include distinguishing osseous from non-osseous material, distinguishing human from non-human remains, and estimating the biological profile. Students will be provided hands on experience in casework and will prepare several forensic anthropology case. 3 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 712",
        "course_title": "Osteology",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS FA 715",
        "course_title": "Forensic Pathology",
        "description": "This lecture- based course will provide the student with an overview of the role of the medical examiner as it relates to death investigations. Specific lectures will cover autopsy procedures in the investigation of gunshot wounds, sharp and blunt trauma, drowning, asphyxia, child deaths, motor vehicle accidents and time since death determination. A general knowledge of anatomy is strongly suggested. 2 cr"
    },
    {
        "course_code": "GMS FA 716",
        "course_title": "Expert Wit Test",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 755",
        "course_title": "Directed Studies in Forensic Anthropology",
        "description": "Graduate Prerequisites: consent of instructor Students will have the opportunity to develop a directed study in a specialized area of forensic anthropology or archaeology that is of particular interest. 4 cr, all sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 760",
        "course_title": "Research in Forensic Anthropology",
        "description": "Graduate Prerequisites: consent of instructor This course is designed to facilitate the students' thesis research. Var cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 761",
        "course_title": "Research in Forensic Anthropology",
        "description": "Graduate Prerequisites: consent of instructor This course is designed to facilitate the students' thesis research. Var cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 790",
        "course_title": "History, Method, and Theory in Biological Anthropology",
        "description": "Graduate Prerequisites: consent of instructor This course will cover the theoretical and methodological principles of the major areas of biological anthropology. Initially focusing on the history of biological anthropology and evolutionary theory, the course will expand to cover skeletal biology, forensic anthropology, and contemporary human variation. The last section will address the philosophy of science and anthropology and practical issues such as presenting and publishing papers and preparing grant proposals. It is intended that this course provide students with a thorough understanding of the correlation between the developments of the discipline of biological anthropology, evolutionary theory, and the practice of forensic anthropology in the United States. 3 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 800",
        "course_title": "Field Methods in Forensic Anthropology",
        "description": "This course will provide students with a sound basis for archaeological methods applied to a variety of forensic settings. Students will learn core concepts from academic archaeology and how forensic archaeology differs from traditional methods. 3 cr"
    },
    {
        "course_code": "GMS FA 802",
        "course_title": "Applied Forensic Anthropology",
        "description": "Students will gain extensive experience in forensic anthropological casework, to include experience in generating analytical notes and report preparation. Students will be exposed to a variety of casework situations that forensic anthropologists encounter in medical examiner offices, international realms, government laboratories and field situations. 3 cr"
    },
    {
        "course_code": "GMS FA 804",
        "course_title": "Experimental Design and Statistics for Forensic Anthropologists",
        "description": "The goal of this course is to provide a working understanding of experimental design and statistical analyses that are appropriate for various types of anthropological based experiments and for the analysis of skeletal remains for unknown individuals. Significant emphasis will be placed on discussions of Bayes Theorem and the use of factor analysis in the development and use of the FORE Disc database used extensively by forensic anthropologists to determine sex, age, stature and ancestry of unidentified skeletal remains. 3 cr"
    },
    {
        "course_code": "GMS FA 805",
        "course_title": "Advanced Crime Scene Investigation",
        "description": "Graduate Prerequisites: GMS FS 701 Crime Scene Investigation This hands-on and lecture-based course will provide students with methods and underlying theories related to specialized aspects of crime scene processing. Topics will include techniques and principles utilized in search and recovery of human remains. Forensic entomology, mechanisms of human decomposition, use of ground penetrating radar, soil composition, excavation, telltale disturbances in flora and the presence of animal activity will be examined. A semester-long practical exercise will include the search and recovery of mock remains and the reconstruction of events. 2 cr",
        "prerequisites": "GMS FS 701 Crime Scene Investigation"
    },
    {
        "course_code": "GMS FA 806",
        "course_title": "Advanced Human Osteology",
        "description": "This course builds on the topics covered in GMS FA 712 Human Osteology by exploring human osteology in greater depth and will include lectures and extensive experience with radiographical material. 4 cr"
    },
    {
        "course_code": "GMS FA 807",
        "course_title": "Taphonomy",
        "description": "Graduate Prerequisites: consent of instructor This course will provide students with an advanced basis for vertebrate taphonomy, both with specific focus upon forensic settings but also with a broader understanding of taphonomic processes covering archaeology, paleoecology, and zooarchaeology. 3 cr, Fall & Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FA 808",
        "course_title": "Forensic Trauma",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS FA 810",
        "course_title": "Mortuary Archaeology",
        "description": "This course will provide students with an advanced theoretical basis for cross-cultural comparison of mortuary behavior and its archaeological interpretation. The topics will cover the history of archaeological though in this topics, processual and post-processual theoretical frameworks, the prehistory of burial, regional archaeological studies, modern Western burial practices and symbolism, gender and class difference, trophy taking, cannibalism, beliefs in undead and how they affect mortuary practices, military memorialization and warfare, ethical issues involved in the analysis of cemeteries and human remains, repatriation, and modern homicide investigation of serial killings and body movement. 3 cr, Fall & Spring sem."
    },
    {
        "course_code": "GMS FC 706",
        "course_title": "Mol Metabolism",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FC 708",
        "course_title": "Professional Development Skills",
        "description": "This course introduces basic professional development skills for PhD students in the following areas: communication skills, research compliance/law/bioethics, and personal professional development."
    },
    {
        "course_code": "GMS FC 709",
        "course_title": "Research Design and Statistical Methods for Biomedical Sciences",
        "description": "The overall objective of this course is to provide students with an understanding of basic concepts of research design and data analysis in the biomedical sciences. The primary didactic areas to be covered include framing hypotheses and objectives, the use of experimental designs and, to a lesser degree, non-experimental designs, problems of differential and non-differential error (including bias and confounding), foundational principles of data description and analysis (independent vs. correlated, parametric and non-parametric, measures of central tendency and dispersion), effect estimation, the use and limitations of statistical testing, and univariable and multivariable modeling. The course employs both didactic sessions and in-class discussion. 3 cr., Spring sem. Co-listed as NU709."
    },
    {
        "course_code": "GMS FC 715",
        "course_title": "Trans G & G",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS FC 717",
        "course_title": "Physiology of Specialized Cells",
        "description": "This course is one of the elective course modules (Module V) of the Foundations in Biomedical Sciences curriculum. Knowledge of cellular and molecular physiology is critical to understanding the higher order of functioning of tissues, organs, and organs systems. The objective of the course is to discuss the specialized adaptations of cells that help them to function in their respective tissues and organs. This course will also provide a framework to bridge the gap between the biochemistry and the molecular and cellular biology that students have acquired in the core modules (I through IV) and organ physiology and pharmacology that will be addressed in the second year. 3 cr, Spring sem."
    },
    {
        "course_code": "GMS FC 721",
        "course_title": "Statistical Reasoning for the Basic Biomedical Sciences",
        "description": "Biomedical research entails the inference of reliable knowledge from incomplete, noisy data. The ability to reason effectively in the midst of such uncertainty is a key component of success in the field. Students in FC721 will learn both judgment and technique. Judgment will be developed through discussion of key concepts in statistics while developing sound intuition through in-lecture short exercises. Technical skill will be acquired in the statistical computing language R using the powerful user interface R Studio. Topics covered will include Exploratory Data Analysis, estimation, probability, hypothesis testing, statistical modeling (linear regression, Logistic regression, non-linear regression), experimental design, and reproducibility. 4 cr, Fall sem"
    },
    {
        "course_code": "GMS FC 762",
        "course_title": "Critical Thinking in Biomedical Research",
        "description": "The primary goal of this course is to use the framework of the scientific literature to develop Critical Thinking Skills to generate novel hypotheses with a focus on establishing novel biological mechanisms and pathways. Critical Thinking skills will be used to examine research findings and theories to uncover inconsistencies, bias, or faulty logic. The student will be expected to build on their careful evaluation and analysis of the papers to create a novel hypothesis each week and design a single experiment to address their question. The weekly course discussion will be student led and this will facilitate the development of teaching skills. Generally the papers to be discussed will be an older, classic paper, which established an important new concept and a newer paper that builds on that theme. Grading is based on weekly participation in class discussions, presentations, and a concise final written assignment. 2cr, spring"
    },
    {
        "course_code": "GMS FC 764",
        "course_title": "Professional Presentation Skills",
        "description": "The course is designed for first year graduate students. The goal of this course is to teach students how to present their research in written and oral form. Students will give multiple short oral presentations and be critiques. They will also give 1 longer presentation. Students will learn to give presentations with and without slides. Students will also begin to acquire written skills in preparation for the Proposal writing course in the second year. The course will meet weekly and will be 2 credits."
    },
    {
        "course_code": "GMS FC 951",
        "course_title": "Res Cell & Mol",
        "description": null
    },
    {
        "course_code": "GMS FC 952",
        "course_title": "Research in Cell & Molecular Biology",
        "description": "Var cr"
    },
    {
        "course_code": "GMS FS 700",
        "course_title": "Criminal Law and Ethics",
        "description": "Graduate Prerequisites: consent of instructor An overview of legal, ethical and practical issues of forensic science, the impact of forensic science on the justice system and a discussion of traditional and emerging admissibility standards involving forensic science evidence is given. The curriculum will include a description of the roles law enforcement, attorneys and forensic scientists, professional standards for the practice of criminalistics and ethical issues in various forensic disciplines. 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FS 701",
        "course_title": "Crime Scene Investigation",
        "description": "Graduate Prerequisites: consent of instructor This combination hands-on and lecture-based course will provide students with an in-depth review of crime scene assessment and management. Methods of identifying, documenting, collecting and packaging physical evidence from various types of crime scenes are discussed. A hands-on component will be employed in areas such as crime scene sketching, photography and pattern evidence collection. 3 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FS 702",
        "course_title": "Forensic Biology",
        "description": "Graduate Prerequisites: consent of instructor This lecture-based course will introduce students to the biological aspects of forensic evidence including biochemical and physical attributes of blood and other body fluids. Common methods of body fluid identification utilized in forensic laboratories will be discussed at length. Other topics include guidelines for thorough evidence examination, screening, documentation and report writing. 3 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FS 703",
        "course_title": "Forensic Chemistry",
        "description": "Graduate Prerequisites: consent of instructor This lecture-based course will provide an introduction to forensic chemistry and will expose students to chemical principles and instrumental techniques associated with the field, with particular emphasis on the analysis of controlled substances, fire debris and explosives, and on forensic toxicology. A review of organic and analytical chemistry as they relate to forensic investigations will be discussed. 3 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FS 704",
        "course_title": "Forensic Biology Laboratory",
        "description": "Graduate Prerequisites: GMS FS 702 Forensic Biology (pre- or co-req) This laboratory-based course will give students an opportunity to apply the principles of forensic biology to actual samples. Techniques utilized will include chemical screening assays, detection with ALS, methods used to confirm the presence of specific biological materials, antibody interactions, and microscopic identification of cellular material. 2 cr",
        "prerequisites": "GMS FS 702 Forensic Biology (pre- or co-req)"
    },
    {
        "course_code": "GMS FS 706",
        "course_title": "Pattern Evidence Analysis",
        "description": "Graduate Prerequisites: consent of instructor This combination lecture and lab-based course will provide students with overview of various types of pattern evidence with an emphasis on the systematic approaches to pattern evidence comparison and analysis. The history of fingerprint identification, fingerprint processing and comparison techniques, footwear and tire impression analysis, toolmark analysis, and the importance of photography in pattern evidence documentation will be discussed. Development of pattern evidence using mechanical, chemical and visual techniques is incorporated. 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FS 707",
        "course_title": "Trace Evidence Analysis",
        "description": "Graduate Prerequisites: consent of instructor This lecture-based course will provide an overview of the principles and concepts on which trace evidence analysis is based. Proper collection, preservation, identification and comparison of items such as glass, paint, hairs and fibers, using standard methods and instruments used in crime scene laboratories will be discussed. 3 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FS 708",
        "course_title": "Forensic Instrumental Analysis Laboratory",
        "description": "Graduate Prerequisites: GMS FS 703 Forensic Chemistry This laboratory course will provide an introduction to a variety of instrumentation and equipment utilized in the forensic laboratory and detail the methods used by forensic scientists for chemical analysis with a focus on forensic toxicology and drug chemistry. 2 cr",
        "prerequisites": "GMS FS 703 Forensic Chemistry"
    },
    {
        "course_code": "GMS FS 713",
        "course_title": "Bloodstain Pattern Analysis",
        "description": "Graduate Prerequisites: GMS FS 701 Crime Scene Investigation This lecture and lab-based course will provide students with fundamental knowledge in the area of bloodstain pattern analysis including the scientific principles and practical applications of bloodstain pattern analysis for forensic casework. The procedures and methods for recognition, documentation and evaluation of bloodstain patterns will be covered. Additionally, the principles of physics, blood dynamics and the geometric significance of bloodstain patterns will be explored. 2 cr",
        "prerequisites": "GMS FS 701 Crime Scene Investigation"
    },
    {
        "course_code": "GMS FS 715",
        "course_title": "Forensic Pathology nad Medicolegal Death Investigation",
        "description": "Graduate Prerequisites: consent of instructor This lecture-based course will provide the student with an overview of the role of the medical examiner and the basic principles of medicolegal death investigations. Specific lectures will cover autopsy procedures in the investigation of gunshot wounds, sharp and blunt trauma, drowning, asphyxia, child deaths, motor vehicle accidents and time since death determination. A general knowledge of anatomy is recommended prior to enrollment. 2 cr.",
        "prerequisites": "consent of instructor This lecture-based course will provide the student with an overview of the role of the medical examiner and  the basic principles of medicolegal death investigations. Specific lectures will cover autopsy procedures in  the investigation of gunshot wounds, sharp and blunt trauma, drowning, asphyxia, child deaths, motor vehicle  accidents and time since death determination. A general knowledge of anatomy is recommended prior to  enrollment. 2 cr."
    },
    {
        "course_code": "GMS FS 720",
        "course_title": "Molecular Biology of Forensic DNA Analysis",
        "description": "Graduate Prerequisites: consent of instructor This lecture-based course will discuss theory and application of human genetics and molecular biology to testing of biological evidence. DNA structure and organization of the human genome and types of genetic variation occurring in humans will be covered. Other topics include the history of DNA analysis and current PCR based methods for testing of autosomal STR loci, Y chromosome STR loci and mitochondrial DNA. Lecture material will also cover commonly encountered artifacts in PCR testing, DNA profile interpretation and statistical analysis of results. 3 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS FS 721",
        "course_title": "Forensic DNA Analysis Laboratory",
        "description": "Graduate Prerequisites: GMS FS 720 Molecular Biology of Forensic DNA Analysis (pre- or co-req) This lab-based course will provide theory and practice in procedures used in forensic DNA analysis. Sessions will include use of several DNA extraction techniques, clean technique for contamination prevention, real time PCR for human DNA quantitation, PCR amplification of STR loci and DNA profile analysis. 2 cr",
        "prerequisites": "GMS FS 720 Molecular Biology of Forensic DNA Analysis (pre- or co-req)"
    },
    {
        "course_code": "GMS FS 730",
        "course_title": "Advanced Topics in Forensic DNA Analysis",
        "description": "Graduate Prerequisites: GMS FS 720 and GMS FS 721 This course will build on topics presented in the Forensic DNA Analysis course and laboratory. Students will gain experience interpreting STR data from compromised and mixed source samples, and will understand the theory behind DNA profile frequency calculations. An in-depth review of techniques and methodology used in a forensic DNA laboratory and the roles that accreditation, validation and quality assurance play will be discussed. 2 cr",
        "prerequisites": "GMS FS 720 and GMS FS 721"
    },
    {
        "course_code": "GMS FS 735",
        "course_title": "Analysis of Ignitable Liquids and Explosives",
        "description": "Graduate Prerequisites: GMS FS 703 Forensic Chemistry Graduate Prerequisites: GMS FS 703 Forensic Chemistry This lecture and lab-based course will expose students to an in-depth treatment of the analysis of ignitable liquids and explosives. Practical and theoretical aspects of qualitative and quantitative measurements using current methodologies such as GC/MS and UV-VIS will be discussed. 2 cr",
        "prerequisites": "GMS FS 703 Forensic Chemistry"
    },
    {
        "course_code": "GMS FS 740",
        "course_title": "Analysis of Controlled Substances",
        "description": "Graduate Prerequisites: GMS FS 703 Forensic Chemistry This lecture-based course will provide information on the important methods of analysis of most commonly abused illicit substances including marijuana, cocaine, opiates, hallucinogens, amphetamines and novel psychoactive substances. Additionally, the production, distribution and history of these commonly abused drugs will be covered. Laboratory accreditation requirements will also be discussed. 2 cr",
        "prerequisites": "GMS FS 703 Forensic Chemistry"
    },
    {
        "course_code": "GMS FS 800",
        "course_title": "Criminal Law II - Mock Court",
        "description": "Graduate Prerequisites: GMS FS 700 Criminal Law and Ethics This interactive course builds upon the material discussed in Criminal Law and Ethics regarding the criminal trial process, the role of the forensic witness and the presentation of scientific testimony and physical evidence in court. Students will actively participate in presenting testimony as well as critiquing the performance of others in a mock court setting. Instructors may utilize reports and projects prepared in other courses to provide the subject matter for the students' testimony. 2 cr",
        "prerequisites": "GMS FS 700 Criminal Law and Ethics"
    },
    {
        "course_code": "GMS FS 803",
        "course_title": "Advanced Topics in Forensic Chemistry",
        "description": "Graduate Prerequisites: GMS FS 703 Forensic Chemistry Graduate Prerequisite: GMS 708 Forensic Instrumental Analysis Laboratory This lecture and laboratory-based course will provide students with an understanding of advanced forensic analytical techniques. Lecture topics will include, but are not limited to: experimental design, measuring analytical uncertainty, chromatographic and spectral interpretations, method development and method validation 2 cr",
        "prerequisites": "GMS FS 703 Forensic Chemistry"
    },
    {
        "course_code": "GMS FS 806",
        "course_title": "Advanced Crime Scene Investigation",
        "description": "Prereq: GMS FS 701 Crime Science Investigation. This combination hands-on and lecture-based course will cover specialized aspects of crime scene processing and reconstruction with a focus on the use of technology. Topics such as 3-D image capture, advanced UV and IR techniques, use of CAD software and mobile apps for crime scene mapping will be covered. 2 cr"
    },
    {
        "course_code": "GMS FS 830",
        "course_title": "Forensic Toxicology",
        "description": "Graduate Prerequisites: GMS FS 703 Forensic Chemistry This lecture-based course will provide an overview of the pharmacology, pharmacokinetics and toxicology of common drugs of interest to the forensic toxicologist. An emphasis will be placed on applying the principles of pharmacokinetics to the interpretation of drug blood and urine levels, and on developing an understanding of how drugs (including ethanol) interact with the biology and physiology of the human body. Students will also acquire knowledge of the chemical structure of common drugs. 3 cr",
        "prerequisites": "GMS FS 703 Forensic Chemistry"
    },
    {
        "course_code": "GMS FS 831",
        "course_title": "Forensic Toxicology Laboratory",
        "description": "Graduate Prerequisites: GMS FS 803 pre or current. This lab course provides hands-on techniques used in forensic toxicology laboratories including the use of chromatographic and mass spectrometry for the identification and quantization of small molecules in biological matrices. Student will learn the essential aspects of biological evidence handling and good laboratory practices to prepare samples for toxicological analysis. Students will examine data from forensic toxicological analysis, draw conclusions and prepare reports based on the results. 2 cr.",
        "prerequisites": "GMS FS 803 pre or current. This lab course provides hands-on techniques used in forensic toxicology laboratories including the use of  chromatographic and mass spectrometry for the identification and quantization of small molecules in  biological matrices. Student will learn the essential aspects of biological evidence handling and good  laboratory practices to prepare samples for toxicological analysis. Students will examine data from forensic  toxicological analysis, draw conclusions and prepare reports based on the results. 2 cr."
    },
    {
        "course_code": "GMS FS 840",
        "course_title": "Case Practicum in Forensic Biology /DNA",
        "description": "Graduate Prerequisites: GMS FS 704 Forensic Biology Laboratory, GMS FS 730 Advanced Topics inForensic DNA Analysis This laboratory course will provide students with the opportunity to independently perform evidence assessment and testing for various types of biological evidence, as well as conduct a technical peer review in a mock forensic case setting. Advanced biological screening and DNA analysis techniques will be employed and students will become practiced in the analysis of complex DNA profiles. 2 cr",
        "prerequisites": "GMS FS 704 Forensic Biology Laboratory, GMS FS 730 Advanced Topics inForensic DNA Analysis"
    },
    {
        "course_code": "GMS FS 870",
        "course_title": "Dir Res & Prof",
        "description": "Graduate Prerequisites: consent of program/thesis advisor This course description is currently under construction.",
        "prerequisites": "consent of program/thesis advisor"
    },
    {
        "course_code": "GMS FS 871",
        "course_title": "Internship in Biomedical Forensic Sciences",
        "description": "Graduate Prerequisites: consent of program advisor An internship in a forensic setting is encouraged and can be approved for credit depending on the nature of the internship and the number of hours of work completed. With prior approval from the student's thesis advisors and the site supervisor, work completed at an internship may be used as a basis for the student's thesis. A completed evaluation from the internship supervisor describing the nature of the work and the quality of the student's performance is required. In addition, the student is required to write a summary of his/her internship experiences and responsibilities. Note: The student may count their internship towards completion of a track given the internship is within the proposed specialty. 2 cr",
        "prerequisites": "consent of program advisor"
    },
    {
        "course_code": "GMS FS 970",
        "course_title": "Research in Biomedical Forensic Sciences",
        "description": "Graduate Prerequisites: consent of program/thesis advisor Students complete an independent program of research that is incorporated into a thesis of publishable quality, states a hypothesis or scientific question and presents the findings to support the stated proposition. Thesis topics are developed in conjunction with a research committee consisting of faculty members and/or other qualified individuals. Students register for this course during the semester in which the student anticipates graduation from the program. Prerequisite: Directed Research and Professionalism in Biomedical Forensic Sciences. 2 cr",
        "prerequisites": "consent of program/thesis advisor"
    },
    {
        "course_code": "GMS FS 971",
        "course_title": "Publication and Communication of Research in Biomedical Forensic Sciences",
        "description": "Graduate Prerequisites: consent of program/thesis advisor Following the completion or near completion of an independent program of research and associated thesis, students are expected to prepare their graduate research into journal format and submit for publication. Further, students are expected to submit their research for presentation at a regional, national or international conference. Registration for this course should be during the semester in which the student anticipates graduation from the program. 2 cr Prerequisite: consent of the program/thesis advisor.",
        "prerequisites": "consent of program/thesis advisor"
    },
    {
        "course_code": "GMS GC 600",
        "course_title": "Genetic Diagnosis and Laboratory Methods",
        "description": "This course will provide students the opportunity to learn laboratory techniques and methodologies relevant to the field of genetic counseling. Multiple lectures/discussions relate to results and interpretation from the genetic counseling perspective. Additionally, lab tours and workshops on variant interpretation are also scheduled. . 3 cr, Spring sem."
    },
    {
        "course_code": "GMS GC 601",
        "course_title": "Professional Issues in Genetic Counseling",
        "description": "This two-semester course addresses topics related to the development of a competent genetic counselor. Instructional content, combined with group discussions and student presentations, will cover the history and development of the profession, care across the lifespan, and ethical/social issues. 3 cr, Fall & Spring sem."
    },
    {
        "course_code": "GMS GC 602",
        "course_title": "Clinical Genetics",
        "description": "This course will provide information regarding etiology, features, testing, and treatment for a variety of genetic conditions. The topics are arranged by organ system to expand on the material covered in GMS GC603. Clinical case studies and presentations will supplement. 3 cr, Spring sem."
    },
    {
        "course_code": "GMS GC 603",
        "course_title": "Embryology, Teratology, and Prenatal Genetics",
        "description": "This course will review human embryology, the teratogenic factors leading to abnormal development, and the common indications for prenatal genetic counseling, including advanced maternal age, abnormal cfDNA screening, ultrasound anomalies, diagnostic procedures, and prenatal complications. 3 cr, Fall sem."
    },
    {
        "course_code": "GMS GC 604",
        "course_title": "Cancer Genetic Counseling",
        "description": "This course introduces students to the specialty of cancer genetics, through topics such as the biology of cancer, current cancer statistics and epidemiology, risk assessment, pathology, testing for cancer susceptibility genes, hereditary cancer syndromes, testing methodologies, treatment options, surveillance, survivorship, and psychosocial issues. 3cr, Spring sem."
    },
    {
        "course_code": "GMS GC 605",
        "course_title": "Clinical Applications in Human Genetics",
        "description": "This course will introduce students to the basic concepts and principles of human genetics and their clinical applications. Topics include the chromosomal, molecular, and biochemical basis of disease, prenatal diagnosis, genetic counseling, bioinformatics, and congenital anomalies. 4 cr, Fall sem."
    },
    {
        "course_code": "GMS GC 606",
        "course_title": "GC Seminar 1",
        "description": "The objectives of this Seminar series include teaching students how to critique the medical and social science literature, orienting students to the complexities involved with case presentations, and enabling students to reflect and think critically about their clinical experiences. Also included are case conference presentations from BU faculty, alums, or other area genetic counselors or professionals on interesting, challenging, or unique genetic counseling related cases or topics, 2 cr each, Fall & Spring sem."
    },
    {
        "course_code": "GMS GC 607",
        "course_title": "GC Seminar 2",
        "description": "The objectives of this Seminar series include teaching students how to critique the medical and social science literature, orienting students to the complexities involved with case presentations, and enabling students to reflect and think critically about their clinical experiences. Also included are case conference presentations from BU faculty, alums, or other area genetic counselors or professionals on interesting, challenging, or unique genetic counseling related cases or topics, 2 cr each, Fall & Spring sem."
    },
    {
        "course_code": "GMS GC 700",
        "course_title": "Genetic Counseling Fieldwork I",
        "description": "The clinical and non-clinical fieldwork will provide student interaction with a wide array of genetic specialists. Direct patient contact in prenatal, pediatric, adult, cancer, and specialty genetics clinics will allow students to acquire cases for ABGC certification. 2 cr each, Summer, Fall & Spring sem."
    },
    {
        "course_code": "GMS GC 702",
        "course_title": "Genetic Counseling Fieldwork II",
        "description": "The clinical and non-clinical fieldwork will provide student interaction with a wide array of genetic specialists. Direct patient contact in prenatal, pediatric, adult, cancer, and specialty genetics clinics will allow students to acquire cases for ABGC certification. 2 cr each, Summer, Fall & Spring sem."
    },
    {
        "course_code": "GMS GC 703",
        "course_title": "Genetic Counseling Fieldwork III",
        "description": "The clinical and non-clinical fieldwork will provide student interaction with a wide array of genetic specialists. Direct patient contact in prenatal, pediatric, adult, cancer, and specialty genetics clinics will allow students to acquire cases for ABGC certification. 2 cr each, Summer, Fall & Spring sem."
    },
    {
        "course_code": "GMS GC 704",
        "course_title": "Genetic Counseling Fieldwork IV",
        "description": "The clinical and non-clinical fieldwork will provide student interaction with a wide array of genetic specialists. Direct patient contact in prenatal, pediatric, adult, cancer, and specialty genetics clinics will allow students to acquire cases for ABGC certification. 2 cr each, Summer, Fall & Spring sem."
    },
    {
        "course_code": "GMS GC 711",
        "course_title": "Advanced Genetic Counseling",
        "description": "This two-semester course will cover advanced topics in genetic counseling, including research project design and implementation, personal growth, and professional development. It will build upon the students' previous course work and clinical training to enhance their growing skill set as genetic counselors. 4 cr, Fall & Spring sem."
    },
    {
        "course_code": "GMS GC 712",
        "course_title": "Metabolic Genetics/Advanced Risk Assessment",
        "description": "Section A covers screening, prevention, diagnosis, recurrence risk, treatment and prognosis for biochemical genetic disorders. Section B emphasizes mathematical techniques necessary for accurate genetic counseling, including empiric risk, probability, linkage, mapping and Bayesian analysis. 3 cr, Fall sem."
    },
    {
        "course_code": "GMS GC 714",
        "course_title": "Advanced Topics in Medical Genetics",
        "description": "This course will build from the basic genetic concepts covered in GMS GC 605. Some of the topics addressed include autism spectrum disorders, direct to consumer testing, , complex genetic mechanisms, chronic conditions, screening programs, pharmacogenetics, and emerging genetics specialties. 3 cr, Spring sem."
    },
    {
        "course_code": "GMS GC 716",
        "course_title": "Social, Cultural, and Ethical Issues in Genetics",
        "description": "This course will address the social, cultural, and ethical issues encountered in genetics and genetic counseling. We will review the basic principles of biomedical ethics and discuss different scenarios that a genetic counselor may encounter, as well as legal cases that have impacted the field of genetic counseling and the ethics of emerging genetic technologies and practices including direct-to-consumer testing and gene therapy. Social and cultural issues in genetic counseling will be explored through case studies, addressing gender, race, religion, social class, disability, and sexual orientation. 3 cr, Spring sem."
    },
    {
        "course_code": "GMS GE 701",
        "course_title": "Principles of Genetics and Genomics",
        "description": "Graduate Prerequisites: consent of instructor This course will serve as a foundation for understanding the heritable basis of numerous biological traits, the relationships among genes, and the regulation of their expression. Focus on the ability to use genetic systems to probe these problems, and therefore will heavily explore the experimental aspects of these investigations. Includes discussion of the impact of the genome sequences' availability on the practice of modern science. Use of case study approach to investigate the rich variety of scientific insights gained through genetic studies of aging, addiction, obesity, and others. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS GE 703",
        "course_title": "Genetics and Genomics Colloquium I",
        "description": "Graduate Prerequisites: consent of instructor The Genetics and Genomics Colloquium will be a highly participatory journal club where the students will be asked to give presentations on cutting edge research with the focus on communication skills rather than scientific content. This approach will allow students to become more comfortable with public speaking while developing the skills necessary for effective communication of scientific ideas. 2 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS GE 704",
        "course_title": "Genetics Col 2",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS GE 901",
        "course_title": "Research in Genetics and Genomics",
        "description": "Var cr, Fall & Spring sem."
    },
    {
        "course_code": "GMS HS 701",
        "course_title": "Health Prof ED1",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS HS 702",
        "course_title": "Health Prof ED2",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS HS 704",
        "course_title": "Lrn & Tch Modal",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS HS 706",
        "course_title": "Introduction to Research Methods in Health Professions Education",
        "description": "Introduction to Research Methods in Health Professions Education (HS 706) is designed to introduce health professions education (HSE) students to the fundamentals of research design for education. The goal of the course is to familiarize HSE students with the process of identifying research problems, forming research questions, reviewing, critiquing, and summarizing research as a tool for better understanding and influencing HSE practice and policy. We will explore the fundamentals of quantitative, qualitative, and mixed methods research, how to interpret and present data, how to adhere to ethical principles that guide educational research, and how to develop a small-scale research proposal of your own. In short, this course is about learning to become a good consumer and producer of educational research. Course instructor approval needed. Sum2 semester."
    },
    {
        "course_code": "GMS HS 707",
        "course_title": "Evaluation & Assessment for Health Professions Educators",
        "description": "This course is designed to provide MS HSE students with an understanding of basic principles of measurement and assessment as it relates to both research and instruction. In this course we discuss how to use, interpret and construct valid and reliable tests. We will examine standardized and classroom assessments as well as explore how accreditation requirements (e.g., ACGME) impact teaching and learning in Health Professions Education. Class will be a mix of lecture, discussions, group work, and in-class activities. Generally, I will prepare lecture materials but the direction of the course depends largely on student interests and questions. Course instructor approval needed. Spring semester."
    },
    {
        "course_code": "GMS HS 800",
        "course_title": "Practicum Seminar",
        "description": null
    },
    {
        "course_code": "GMS HS 801",
        "course_title": "Practicum",
        "description": null
    },
    {
        "course_code": "GMS HS 802",
        "course_title": "Practicum",
        "description": null
    },
    {
        "course_code": "GMS IM 600",
        "course_title": "Bioimaging Foundations",
        "description": "Graduate Prerequisites: consent of instructor The physical, mathematical, and experimental foundations of bioimaging are studied with historical context and are presented in the following sequence: bioimaging, principles, bioimaging mathematics, and bioimaging physics, leading to the study of the different bioimage generation techniques (modalities). 4 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 620",
        "course_title": "Bioimaging Theory & Imaging Processing",
        "description": "Graduate Prerequisites: consent of instructor The main theoretical aspects of bioimaging are studied, including image meaning, image generation, image quality (analysis, improvement, and limits), image information content (generation and extraction), and image assisted modeling of biologic systems. Mathematical foundations and basic techniques for digital image processing are studied theoretically as well as in a hands-on approach in the Image Processing Laboratory. 4 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 630",
        "course_title": "Methods of Functional Imaging of the Brain",
        "description": "Graduate Prerequisites: consent of instructor This course will provide an overview of the various existing methods for detecting and mapping brain function in vivo. A brief introduction will provide the necessary background to brain physiology: electrical activity, synaptic transmission, cell metabolism and haemodynamic response associated with neuronal activity. 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 650",
        "course_title": "Bioimaging Practicum",
        "description": "Graduate Prerequisites: consent of instructor This is the capstone course for the clinical path. Utilizing the base of the knowledge gained throughout the previous year, and applying learned methods in bioimaging, this practicum provides the student an opportunity to perform a guided research activity focused on practical applications in bioimaging. The specific objective of this capstone requirement is to prepare the students to be able to directly contribute to the process of bioimaging and to equip the student with practical experience in evaluating and planning practical activities in the field. 4 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 651",
        "course_title": "Statistical Analysis of Neuroimaging Data",
        "description": "Graduate Prerequisites: consent of instructor This course is designed to give the student a working knowledge of the parametric and non-parametric statistical procedures that are commonly used to analyze data generated from in vivo imaging techniques such as CT, MRI, PET and SPECT. 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 655",
        "course_title": "Directed Studies in Bioimaging",
        "description": "Var cr"
    },
    {
        "course_code": "GMS IM 660",
        "course_title": "Radiation Protection & Ethics",
        "description": "Graduate Prerequisites: consent of instructor Many of the established and state-of-the-art modalities in diagnostic imaging rely upon radiation as the imaging agent. However, radiation in itself is considered a hazard that must be controlled. This course will introduce the fundamentals of understanding radiation, the risks of radiation exposure, and the methods of minimizing its harmful potential while maximizing its beneficial qualities. 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 670",
        "course_title": "Special Topics in Bioimaging",
        "description": "Graduate Prerequisites: consent of instructor Imaging has come to increasingly serve as a substrate and necessary ingredient for progressively more complex diagnoses and therapy. The increasing significance of the imaging components has been classically appreciated in fields such as radiation therapy, where planning of treatment based on images is integral to the therapy itself, and has spread beyond the boundaries of such disciplines to numerous surgical fields such as neurosurgery, orthopedics, and ear, nose, and throat surgery. This course provides focused work in such areas as PET/CT and ultrasound/EEG/MEG. 2 cr,",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 680",
        "course_title": "Professional Development",
        "description": "Graduate Prerequisites: consent of instructor This course provides instruction in application softwares for imaging processing and mathematical analysis. In addition, this is a preparatory course for students making the transition from a formal academic program into the dynamic work place. It will cover those fundamental skills required to facilitate searching, locating and qualifying for the job of one's choice. It will cover topics such as building a portfolio, networking, resume writing, and interviewing skills. Speakers in the various fields of imaging will be invited to discuss how he or she make the transition into the workplace and students will have the opportunity to discuss and discover the various pitfalls on the paths of entry into the field of his or her choice. 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 700",
        "course_title": "Thesis Research I",
        "description": "Graduate Prerequisites: consent of instructor First phase of the directed research project, either thesis or practicum, in the field of bioimaging. Students choose an area of concentration in bioimaging and identify a line of research with clearly defined specific objectives to be conducted. 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 701",
        "course_title": "Sectional Anatomy for Imaging Professionals",
        "description": "Graduate Prerequisites: consent of instructor Imaging techniques such as computerized tomography (CT) and magnetic resonance imaging (MRI) have seen rapid rates of growth in the past years. It is vital that professionals working with these imaging tools have a strong working knowledge of gross anatomy to understand the images they are looking at. This course is designed to give students in the Masters in Bioimaging program the fundamental knowledge they will need of gross anatomy. The course is taught from medical images such as CT and MRI rather than more traditional methods since this is the source of information the MBI students are expected to encounter in their future. 2 cr,",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 705",
        "course_title": "Clinical and MR Pathophysiology",
        "description": "This course familiarizes the student with common pathologies found in magnetic resonance imaging and the appearance of these pathologies in various imaging protocols and the imaging appearance of a variety of pathological aberrations affecting patients. The knowledge of disease processes and their signal characteristics on various imaging sequences is essential to ensure the best practices in patient care and quality imaging. This course will include a high level review of clinical imaging in various disease states. Lectures are geared toward a practical, problem-solving approach to conditions and a systematic approach to interpretation of diagnostic imaging studies will be utilized. 4 cr"
    },
    {
        "course_code": "GMS IM 710",
        "course_title": "Thesis Research II",
        "description": "Graduate Prerequisites: consent of instructor Second phase of a four-semester thesis research project in the field of bioimaging during which students postulate a hypothesis, design an experimental protocol to test the hypothesis, acquire data (pilot and final). 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 730",
        "course_title": "Thesis Research III",
        "description": "Graduate Prerequisites: consent of instructor Third phase of a four-semester thesis project in the field of bioimaging during which students finish data analysis and primarily concentrate on writing a comprehensive technical report describing in detail their work in Phases I and II. 2 cr",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS IM 791",
        "course_title": "Clinical Internship I",
        "description": "This course is the first of two structured clinical internship courses designed to provide students with clinical practice and patient management training. Student progression in competency levels through clinical performance objectives are accomplished through demonstration and observation, after which the student assists in performing specified clinical activities. When a satisfactory degree of proficiency is apparent, the student performs specific activities under supervision to achieve clinical competency specified under Article II of the American Registry Radiological Technologists (ARRT) Rules and Regulations. 4 cr"
    },
    {
        "course_code": "GMS IM 792",
        "course_title": "Clinical Internship II",
        "description": "Graduate Prerequisites: GMS IM 791 This course is the second of two structural clinical internship courses designed to provide students with clinical practice and patient management training. Student progression in competency levels through clinical performance objectives are accomplished through demonstration and observation, after which the student assists in performing specified clinical activities. When a satisfactory degree of proficiency is apparent, the student performs specific activities under supervision to achieve clinical competency specified under Article II of the American Registry Radiological Technologists (ARRT) Rules and Regulations. 4 cr",
        "prerequisites": "GMS IM 791"
    },
    {
        "course_code": "GMS MA 605",
        "course_title": "History of Medicine and Healing in the United States",
        "description": "This course explores the history of medical and therapeutic pluralism in the United States, beginning with the colonial period and continuing to the present. We will examine how this pluralism necessarily includes the story of American religious pluralism, the rise of biomedicine, and the changing faces of complementary and alternative medicine (CAM), while factoring in the roles of class, race, and gender. We will work with primary source materials, as well as sources from history of medicine, and medical anthropology. 4 cr, Spring sem. M 2:30-5:15, Charles River Campus."
    },
    {
        "course_code": "GMS MA 610",
        "course_title": "Reading Ethnography in Medical Anthropology",
        "description": "[Not currently offered] This seminar will read medical anthropological ethnographies analytically. Starting with a review of the debates, going through selected classic ethnographic studies, the seminar will explore ethnographies that address different cultural meanings of human experiences of suffering and affliction, including illness and violence. Students will engage in studying the methodology, theoretical underpinnings, writing, and social positions represented in these ethnographies. 3 cr, Fall sem."
    },
    {
        "course_code": "GMS MA 622",
        "course_title": "Religion, Culture and Public Health",
        "description": "This medical anthropology course will explore relationships between religion, culture, and health in the context of public health projects. We will examine historical developments, examples of faith-based public health organizations, and current research on \"religious health assets,\" both locally and internationally. Students will design and conduct qualitative research projects on the culture of a faith-based health organization. 3 cr, Fall sem Th 3:30-6:15, Charles River Campus."
    },
    {
        "course_code": "GMS MA 624",
        "course_title": "Anthropology of Immigrant Health",
        "description": "This course will examine key areas in the study of immigrant and migrant health, drawing on concepts, methods, and theories developed by medical anthropology. We will explore intersections between health care and immigration policy, access to services, practiced characterized as \"cultural competency,\" the contests and collaborations within medical pluralism, segmented acculturation, and the politics of \"illegal status\" as a form of social regulation. We will also employ ethnographic analyses of those processes that exacerbate the structural vulnerability of immigrants (whether undocumented or not) to ill-health, and discuss case examples of advocacy- and community-based initiatives that have improved immigrants' access to social services and their overall well-being in their social and health landscapes. 3 cr, Fall sem Th 3:30-6:15, Charles River Campus."
    },
    {
        "course_code": "GMS MA 630",
        "course_title": "Medical Anthropology and the Cultures of Biomedicine",
        "description": "This course examines biomedicine as a cultural system with multiple local and national expressions worldwide, all of which have undergone changes over time. Topics will include the exploration of biomedicine as a cultural system, with cultural variations and different conceptual domains; processes of acculturation to biomedicine, the medicalization of social realities; biomedical narratives; the patient-doctor relationship (including when the physician is the patient); understandings of interventions and the meanings assigned to them; and different ways of thinking about efficacy in relation to process and chronicity. The course will draw on ethnographic studies of biomedicine not only in the United States, but in other global settings. 3 cr, Spring sem. M 2:30-5:15, Charles River Campus."
    },
    {
        "course_code": "GMS MA 650",
        "course_title": "Culture and Politics of Health Care Work",
        "description": "This medical anthropology course examines the history, culture, and politics that shape health care work and organizations. Beginning with the notion of \"competencies\" in biomedical training, this course examines the models of professional enculturation and competition in established and emerging health professions. The course will focus on the conceptual and embodied formation of knowledge, skills, attitudes, and collaboration between professional and nonprofessional caregivers; examining in particular the discourse of \"cultural competence.\" Readings include autobiographical and ethnographic accounts of healthcare professionals, staff, and family caregivers. Students conduct qualitative interviews with a variety of health care workers to analyze specific cultural and political contexts of care and health professional education. 3 cr, Spring sem. Th 3:30-6:15, Charles River Campus."
    },
    {
        "course_code": "GMS MA 670",
        "course_title": "Power and Health in Latin America and the Caribbean",
        "description": "The aim of this course is to examine the socio-political, economic, historical and public health dimensions that have promoted or jeopardized people's wellbeing in Latin America and the Caribbean. This course will introduce students to historical and contemporary debates around the right to health in this region. We will explore the origin and theoretical foundations of the social movement known as Latin American Social Medicine (LASM) and the historical role it has played in promoting health and advancing the right to health in Latin America. Students will explore the political economy of health theory, and the theoretical frameworks of critical medical anthropology and of LASM to study health and disease. Ethnographies and accompanying articles from various disciplines will guide a critical exploration of the connections between health disparities, social justice, and health as a human right in the region. 3 cr, Fall sem. Th 12:30-3:15, Charles River Campus"
    },
    {
        "course_code": "GMS MA 678",
        "course_title": "Reproductive Anthropology",
        "description": "As a field within medical anthropology, Reproductive Anthropology can encompass all aspects of human reproduction and sexual/reproductive health, including: adolescent sexuality, fertility, contraception, pregnancy, abortion, birthing, adoption, breastfeeding, the health needs of LGBTQ communities, assisted reproductive technologies, masculinity & male infertility, reproductive health care in and across various care settings and in varying sociocultural and political-economic contexts locally, nationally, and internationally, the roles of race, class, gender, and nationality in all of the above, and many other topics. Any issue, practice, illness, trend, or debate that combines human behavior and reproductive health or ability is fertile ground for anthropological examination from evolutionary, biocultural, and critical-medical perspectives. 3 cr ., Spring sem. Th 12:30-3:15, Charles River Campus. ."
    },
    {
        "course_code": "GMS MA 680",
        "course_title": "Culture, Migration, and Mental Health",
        "description": "This medical anthropology course explores the ways in which mental health and illness are constructed by and for those who migrate across national, cultural, and other borders. We will examine the historical development of the fields of psychology, psychiatry, and social work in the context of Western societies, in parallel with the anthropological study of ritual, violence, ecstatic and possession experiences in non-Western societies. We will then explore debates in cross-cultural mental health care that bring these historical disciplines into dialogue, particularly in the context of programs for the treatment of refugee and immigrant mental health. The intersection of political, economic, religious, and gender issues in the construction of mental health will also be considered. 3 cr, Spring sem. Th 3:30-6:15, Charles River Campus."
    },
    {
        "course_code": "GMS MA 691",
        "course_title": "Directed Study in Medical Anthropology",
        "description": "Undergraduate Prerequisites: Permission of instructor Graduate Prerequisites: consent of instructor To be arranged with the instructor. Var cr, Fall & SSI sem.",
        "prerequisites": "Permission of instructor"
    },
    {
        "course_code": "GMS MA 692",
        "course_title": "Directed Study in Medical Anthropology",
        "description": "Graduate Prerequisites: consent of instructor To be arranged with the instructor. Var cr, Spring & SSII sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MA 700",
        "course_title": "History and Theory of Medical Anthropology (Part I)",
        "description": "This course introduces the history of the field of medical anthropology and of theoretical orientations related to understanding and analyzing health and medicine in society and culture. Readings will exemplify interpretive strategies applied to health-related experiences, discourse, knowledge, and practice. 3 cr, Fall sem. M 1:00-4:00, Medical Campus."
    },
    {
        "course_code": "GMS MA 701",
        "course_title": "History and Theory of Medical Anthropology (Part II)",
        "description": "This course, offered by Medical Anthropology and Cross Cultural Practice, will address theoretical traditions in medical anthropology, focusing on orientations developed and applied within the field over the past two decades to interpretations of health-related phenomena. 3 cr, Spring sem. M 10:00-12:50, Medical Campus."
    },
    {
        "course_code": "GMS MA 708",
        "course_title": "Service Learning Internship (Pt. 1)",
        "description": "For this internship, students will arrange a volunteer project with the group or community with whom they plan to conduct their fieldwork. The purpose of the practicum is to initiate the process of engagement in Community-Based Participatory Research design."
    },
    {
        "course_code": "GMS MA 709",
        "course_title": "Service Learning Internship (Pt. 2)",
        "description": "For this practicum, students will continue working on their a volunteer project with the group or community with whom they plan to conduct their fieldwork. The purpose of the practicum is to initiate the process of engagement in Community-Based Participatory Research design."
    },
    {
        "course_code": "GMS MA 710",
        "course_title": "Medical Anthropology and Qualitative Research Methods and Design",
        "description": "Introduction to methodology for ethnographic field research in medical anthropology, and qualitative research methods. This course, offered by Medical Anthropology and Cross Cultural Practice, examines issues in designing anthropological research, and reviews theoretical approaches to research ethics, designing research, framing questions and questionnaire design, and data collection techniques. 3 cr, Fall sem. W 10:00-1:50, Medical Campus."
    },
    {
        "course_code": "GMS MA 711",
        "course_title": "Medical Anthropology Fieldwork Pt. 1",
        "description": "Fieldwork or a related internship experience is an integral dimension of anthropological methodology, and important to conducting qualitative research. Therefore, it represents an essential feature of the curriculum in the Master's in Medical Anthropology and Cross-Cultural Practice. Fieldwork allows students to complement their classroom learning with field-based learning, link theory with practice, and refine their skills. It also helps students establish contacts, develop relationships, and learn from the experience of interacting with different cultural communities and groups. This two-part seminar will review issues likely to arise in the experience of conducting fieldwork, and will provide a forum within which students can discuss their ongoing fieldwork. Prereq: a previously approved Institutional Review Board protocol, and permission of the instructor. 3 cr, Spring or Summer I sem."
    },
    {
        "course_code": "GMS MA 712",
        "course_title": "Medical Anthropology Fieldwork Pt. 2",
        "description": "Fieldwork or a related internship experience is an integral dimension of anthropological methodology, and important to conducting qualitative research. Therefore, it represents an essential feature of the curriculum in the Masters in Medical Anthropology and Cross-Cultural Practice. Fieldwork allows students to complement their classroom learning with field-based learning, link theory with practice, and refine their skills. It also helps students establish contacts, develop relationships, and learn from the experience of interacting with different cultural communities and groups. This two-part seminar will review issues likely to arise in the experience of conducting fieldwork, and will provide a forum within which students can discuss their ongoing fieldwork. Prereq: a previously approved Institutional Review Board protocol, GMS MA 711, and permission of the instructor. 3 cr, Summer II or Fall sem."
    },
    {
        "course_code": "GMS MA 734",
        "course_title": "Reading Ethnography in Medical Anthropology",
        "description": "This seminar, offered by Medical Anthropology and Cross Cultural Practice, will read medical anthropological ethnographies analytically, with a focus on works that feature Applied Anthropology. Starting with a review of the debates, going through selected classic ethnographic studies, the seminar will explore ethnographies that address different cultural meanings of human experiences of suffering and affliction, including illness and violence. Students will engage in studying the methodology, theoretical underpinnings, writing, and social positions represented in these ethnographies. Prereq: Permission of the instructor. 3 cr, Fall sem. T 10-12:50, Medical Campus."
    },
    {
        "course_code": "GMS MA 735",
        "course_title": "Writing Ethnography in Medical Anthropology",
        "description": "This seminar, offered by Medical Anthropology and Cross Cultural Practice, builds on GMS MA 734 (Reading Ethnography in Medical Anthropology), turning the focus to the actual craft of writing ethnography. It is an integral part of MACCP students' thesis-writing training. Students will learn to identify and employ rhetorical and stylistic strategies and genre conventions. Through a series of exercises that draw on their own field notes and participant observations, students learn to employ three genres of cultural representation- realist tales, confessional tales, and impressionist tales. Students will explore their own authorial voice and style, and their relationship with truth, objectivity, and point-of-view. The class is structured as a seminar, emphasizing class discussion, workshops, and peer- group work. Prereq: Permission of the instructor. 3 cr, Spring sem. W 10-12:50 Medical Campus."
    },
    {
        "course_code": "GMS MA 742",
        "course_title": "Medical Anthropological and Qualitative Data Analysis",
        "description": "Undergraduate Prerequisites: Not open to undergraduates. Graduate Prerequisites: GMS MA 710, GMS MA 770, and Summer Fieldwork Directed Study credits (contact instructor for more information). Examines strategies for analyzing medical anthropology data deriving from interviews and documents. In addition to reviewing different coding strategies and the rationales underlying them, the course, offered by Medical Anthropology and Cross Cultural Practice, will discuss topics such as approaches to managing textual data; the selection and application of epistemological and theoretical frameworks; narrative and discourse analysis; cognitive anthropology theory and methods; the use of grounded theory. Emphasizes the application of these strategies to the analysis and interpretation of data collected by the students as part of the course process. Prereq: Permission of instructor. 3 cr, Fall sem. W 10-12:50, Medical Campus.",
        "prerequisites": "Not open to undergraduates."
    },
    {
        "course_code": "GMS MA 770",
        "course_title": "IRB Proposal Development and Writing",
        "description": "Undergraduate Prerequisites: Not open to undergraduates. Graduate Prerequisites: GMS MA 700-A1 or permission of the instructor. Prereq: Permission of Instructor. In this course, offered by Medical Anthropology and Cross Cultural Practice, students will learn to write a medical anthropology research proposal and related Institutional Review Board Proposal, through the structure provided by the IRB of BUSM. We will address theory and methods related to the design and review process. 3 cr, Spring sem. M 10-1:50, Medical Campus.",
        "prerequisites": "Not open to undergraduates."
    },
    {
        "course_code": "GMS MA 786",
        "course_title": "Final Project Writing Seminar",
        "description": "Undergraduate Prerequisites: Not open to undergraduates. Graduate Prerequisites: GMS MA 710, GMS MA 770, and Summer Fieldwork Directed Study credits (contact instructor for more information), and GMS MA 742, or permission of the instructor. This seminar, offered by Medical Anthropology and Cross Cultural Practice, will train learners in the theory and practice of writing up medical anthropology research findings, and of writing ethnography. The course emphasizes analytical writing. Students will learn to identify and employ rhetorical and stylistic strategies and genre conventions. The class is structured as a seminar, emphasizing class discussion, workshops and peer-group work. Prereq: Permission of instructor. 3 cr, Spring sem. F 2-4:45, Medical Campus.",
        "prerequisites": "Not open to undergraduates."
    },
    {
        "course_code": "GMS MD 800",
        "course_title": "Clin Clerkship",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MH 701",
        "course_title": "Counseling Theory",
        "description": "Graduate Prerequisites: consent of instructor This course provides an overview of major theoretical approaches to case conceptualization for clinical mental health counseling, including psychoanalytic, person-centered, cognitive-behavioral, and solution-focused theories. Students will begin to develop an understanding of the process for selecting appropriate clinical mental health counseling interventions, consistent with current research standards. 3 cr, Yr. 1, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 703",
        "course_title": "Counseling Techniques",
        "description": "Graduate Prerequisites: consent of instructor This course provides an overview of the skills and styles needed for building healthy and therapeutic helping relationships, as well as techniques specific to a variety of psychological disorders and problems with living. Emphasis is placed on experiential exercises and clinical mental health counseling-related skills-building, including interviewing and behaviors influencing the helping process. 3 cr, Yr. 1, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 704",
        "course_title": "Group Work",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 705",
        "course_title": "Psychopathology",
        "description": "Graduate Prerequisites: consent of instructor This course provides students with an introduction to the etiology, presentation, and treatment of major mental health disorders as classified in the Diagnostic and Statistical Manual of Mental Disorders. Students will become familiar with identifying and differentiating diagnoses across a range of clinical presentations. In addition, there will be discussion of clinical mental health strategies that may be applied when working with a variety of clients, beginning with the first contact and including the therapeutic process and treatment planning. 3 cr, Yr. 1, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 706",
        "course_title": "Social & Cultural Foundations",
        "description": "Graduate Prerequisites: consent of instructor This course provides an overview of social justice, the cultural context of relationships, issues, and trends in a multicultural society, in order to enable students to work effectively with people from varied racial, cultural and class backgrounds. The course is organized around the ethical responsibility of counselors to provide clients across a wide range of identities with meaningful and relevant clinical services, and the role of counselors in promoting overall health and wellness across cultures. A contemporary body of professional literature is explored, with an emphasis on self-awareness, knowledge of others, experiential learning activities, and multicultural counseling skills acquisition. 3 cr, Yr. 1, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 707",
        "course_title": "Research and Evaluation",
        "description": "This course provides an understanding of research methods, statistical analysis, needs assessment, and program evaluation. There is an emphasis on the importance of research in advancing the counseling profession, varied approaches to research method, and the use of research to inform evidence- based practice. Landmark studies and current articles are used to illustrate applications. Students develop critical thinking skills for examining research information and its use for asking questions that extend knowledge, and for planning studies to address new questions. 3 cr, Yr. 1, Fall sem."
    },
    {
        "course_code": "GMS MH 708",
        "course_title": "Human Growth & Development",
        "description": "Graduate Prerequisites: consent of instructor This course provides an overview of biological, psychological, and sociocultural aspects of individual and family development from conception through elder adulthood in a multicultural context. The course is taught from perspectives of cognitive science and behavioral systems as well as sociological, cultural, life span developmental, and comparative approaches. The focus of the course is on normative development; developmental disorders are used to elucidate normative developmental and adaptive processes in language, cognition, and behavioral self-regulation that will serve to introduce students to behaviors and concepts relevant to clinical mental health counseling practice with both children and adults. 3 cr, Yr. 2, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 709",
        "course_title": "Neuroscience for Mental Health Professionals",
        "description": "Graduate Prerequisites: consent of instructor The general objective of this course is to provide a foundation in the understanding of central nervous system structure and function and the relationship of brain and behavior tailored to the clinical mental health counseling professional. Special emphasis is on the neurobiology of mental illness and neurologic disease. The course is divided into two parts: Part I covers primarily the organization, structure and function of the nervous system, and Part II covers primarily the neurobiology of mental illness, normal aging, and age-related disease. Instructors have earned degrees in a medical field and are designated prescribers. 3 cr, Yr. 1, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 710",
        "course_title": "Basic Mental Health Assessment",
        "description": "Graduate Prerequisites: consent of instructor This course is designed to provide an overview of principles and applications of mental health assessment in a multicultural society. The primary objectives of this course are to facilitate students' understanding of the basic methods of assessment in clinical mental health counseling, to include evaluating, selecting, and using appropriate techniques and standardized testing methods, and to conduct a thorough, culturally sensitive, and ethically responsible assessment. Methods for dissemination of assessment results will also be reviewed. 3 cr, Yr. 1, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 712",
        "course_title": "Marriage and Family Counseling",
        "description": "Graduate Prerequisites: consent of instructor This elective course will help students gain a basic conceptual understanding of the theory, process and practice of marriage and family systems counseling. In addition, students will begin to develop skills and strategies for the assessment and treatment of family systems approaches within mental health systems and to practice these skills during in-class experiential activities. 3 cr, Yr. 2, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 713",
        "course_title": "Human Sexuality",
        "description": "Graduate Prerequisites: consent of instructor This elective course explores physiological, psychological, and sociocultural aspects of human sexuality, focusing on trends in the field, including teen sexuality, pregnancy, and early sexual experiences, sexual assault, HIV/AIDS and other sexually-transmitted infections, sex addiction, sexuality across the lifespan, and ethics. 3 cr, Yr. 2, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 714",
        "course_title": "Behavioral MED",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 715",
        "course_title": "Professional Orientation and Ethics",
        "description": "Graduate Prerequisites: consent of instructor This course provides an orientation to the clinical mental health counseling profession, including the history and foundations of clinical mental health counseling, developing a professional identity, review of the settings and systems where clinical mental health counselors provide services, emergency preparedness, models of clinical supervision, professional organizations and licensure, clinical mental health counselor advocacy, preparations for practicum and internship training, and self-care strategies. This course will also cover the ethics of professional counseling, including confidentiality and informed consent, competence and use of supervision, and boundary-setting. The American Counseling Association and American Mental Health Counselors Association Codes of Ethics, as well as legal requirements, will be reviewed. 3 cr, Yr. 1, Fall sem",
        "prerequisites": "consent of instructor This course provides an orientation to the clinical mental health counseling profession, including the history  and foundations of clinical mental health counseling, developing a professional identity, review of the settings  and systems where clinical mental health counselors provide services, emergency preparedness, models of  clinical supervision, professional organizations and licensure, clinical mental health counselor advocacy,  preparations for practicum and internship training, and self-care strategies. This course will also cover the  ethics of professional counseling, including confidentiality and informed consent, competence and use of  supervision, and boundary-setting. The American Counseling Association and American Mental Health  Counselors Association Codes of Ethics, as well as legal requirements, will be reviewed. 3 cr, Yr. 1, Fall sem"
    },
    {
        "course_code": "GMS MH 716",
        "course_title": "Career and Vocational Counseling",
        "description": "Graduate Prerequisites: consent of instructor This course provides an overview of the history and theories of career development; students will learn how to conduct a career interview and review and discuss the influence of developmental, ethnic, racial and gender differences for career counseling. Students will also complete and review several career tests and present their personal career development plan in preparation for entering the field. 3 cr, Yr. 2, Spring sem",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 717",
        "course_title": "Child Adol Coun",
        "description": "Graduate Prerequisites: Consent of instructor This course description is currently under construction.",
        "prerequisites": "Consent of instructor"
    },
    {
        "course_code": "GMS MH 718",
        "course_title": "Psychological Trauma Across the Lifespan",
        "description": "Graduate Prerequisites: Consent of instructor This elective course provides students with a foundation in psychological trauma and its impact on mental and physical health. Two frameworks-- biopsychosocial and developmental psychopathology--will be used for students to gain up-to-date knowledge on the consequences of traumatic experiences and other serious adversities along the molar (behavior) to molecular (neurobiology) continuum and across the lifespan. With an emphasis on evidence-based practice, students attain core clinical competencies in the assessment and treatment of trauma-related symptoms and problems through various didactic and experiential activities. Evaluation strategies will encompass the utility of diagnostic nosologies (i.e., Diagnostic and Statistical Manual of Mental Disorders [DSM]) as well as case conceptualization. State-of-the-science interventions are be covered so that students acquire knowledge and skills in helping traumatized individuals to successfully ameliorate their symptoms and improve their functioning. 3 cr. Yr. 2, Fall sem.",
        "prerequisites": "Consent of instructor"
    },
    {
        "course_code": "GMS MH 719",
        "course_title": "Global Mh",
        "description": "Graduate Prerequisites: Consent of instructor This course description is currently under construction.",
        "prerequisites": "Consent of instructor"
    },
    {
        "course_code": "GMS MH 803",
        "course_title": "Adv Ethics",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MH 810",
        "course_title": "Psychopharmacology",
        "description": "Graduate Prerequisites: consent of instructor This course provides an overview of psychopharmacology for the non-medical clinical mental health counseling provider. There is overview of the neurobiology of mental health disorders and the medications commonly used in their treatment. 3 cr, Yr. 1, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 812",
        "course_title": "Addictions",
        "description": "Graduate Prerequisites: consent of instructor The aim of this course is to provide the necessary knowledge base for understanding and treating addiction. This course places emphasis on acquiring clinically useful knowledge and skills for recognizing and treating substance use disorders. Topics covered in this course include: recognizing drug intoxication and withdrawal, assessment of substance use disorders, Community Reinforcement Approach, Family Systems Treatment Models, Motivational, Enhancement Therapy, Cognitive-Behavioral/Skills Building approaches, 12-Step Recovery/Mutual Support Groups, and Addiction Medicine. 3 cr, Yr. 2, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 814",
        "course_title": "Clinical Field Research Seminar",
        "description": "Graduate Prerequisites: consent of instructor This elective course is designed to provide students with knowledge and experience in the conduct of clinical trials. Students enrolled in this practicum will become part of a clinical research team investigating the efficacy of clinical and/or medication management of a discrete mental health and/or medical disorder. Topics of study are dependent on site of interest currently conducting trials and availability of staff to supervise students. Training will include readings, presentations, observation, web- based training, and direct experience working with research participants. Availability and variability in options for this course are necessarily dependent on the existence of trials in stages of funding that will provide appropriate education and skills-training and is available for only a small number of students.Var cr, Yr. 1, Fall & Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 902",
        "course_title": "Practicum Supervision",
        "description": "Graduate Prerequisites: consent of instructor This course is a group supervision experience where the faculty supervisor provides the opportunity for students to present and discuss cases from their Practicum placement and to receive feedback from the faculty supervisor and peers. Course content and activities are designed to foster students' identities as clinical mental health counselors, to sharpen their diagnostic and intervention skills, and increase students' awareness of ethical and legal considerations. In addition, students complete bedside interviewing in inpatient medical units of the campus-based hospital (Boston Medical Center), conducting brief psychosocial assessments of patients. This facilitates the application of skills for medical concerns, exposure to a medical environment, and learning about a variety of medical conditions. 3cr. Yr. 1, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 921",
        "course_title": "Internship Supervision",
        "description": "Graduate Prerequisites: consent of instructor This course is a two-semester group supervision experience for students in their academic year-long Internship training. As part of this experience, faculty supervisors mentor students to develop more advanced assessment and counseling skills, as well as to develop their identities as professional mental health counselors. Students receive peer supervision and complete oral and written case presentations. Application of theoretical approaches as connected to clinical assessment and intervention is emphasized. 3 cr. Yr. 2, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 922",
        "course_title": "Internship Supervision",
        "description": "Graduate Prerequisites: consent of instructor This course is a group supervision experience for students during the second semester of their academic year-long Internship training. As part of this experience, faculty supervisors mentor students to develop more advanced assessment and counseling skills, as well as to develop their identifies as professional mental health counselors. Students also complete a Capstone Project, consisting of an oral and written case presentation, focused on psychosocial assessment and intervention, incorporating the academic and didactic components of the two-year program. Successful completion of the Capstone is required for graduation in the program. 3 cr. Yr. 2, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MH 971",
        "course_title": "Directed Studies in Mental Health Counseling and Behavioral Medicine",
        "description": "Var cr, Fall and Spring sem"
    },
    {
        "course_code": "GMS MH 972",
        "course_title": "Directed Studies in Mental Health Counseling and Behavioral Medicine",
        "description": "Var cr, Fall & Spring sem."
    },
    {
        "course_code": "GMS MI 701",
        "course_title": "Concepts in Virology",
        "description": "The goals of this course are to provide a fundamental understanding of virus molecular biology. The course will build on prior understanding of mammalian cellular and molecular biology and will follow the replication cycle of animal viruses, focusing in detail on the molecular mechanisms underlying viral replication. The course will examine key concepts in molecular virology, including virus structure, how viruses can attach and enter cells, express and replicate their genomes, take advantage of the host cell translation machinery, and package and release virus progeny. There will also be lectures on antivirals and how viruses can be manipulated and used as tools. The course will be aimed towards first year Ph.D. students in the Division of Graduate Medical Sciences and taught by Microbiology Department faculty with expertise in virology. The content will include a combination of powerpoint presentations and discussion of primary research papers. Reading materials will include primary literature and suggested review articles. Students will be evaluated on their discussion of papers, written work, a presentation and a final examination designed to test the students' critical thinking and analytical skills. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS MI 713",
        "course_title": "Comprehensive Immunology",
        "description": "Graduate Prerequisites: consent of instructor Immunology is a key discipline that interweaves itself through almost every aspect of human health and disease. This course provides a basic yet comprehensive understanding of the immune system for students entering immunological disciplines as well as those from computational, bioengineering and biotechnology fields. It is designed to be accessible to graduate students and advanced undergraduates who have solid backgrounds in biology, genetics and biochemistry. Lectures include both interactive and conventional teaching modes as well as discussion of some assigned papers from the current literature. Topics include in depth looks at both innated and adaptive immunity, cell trafficking, mucosal immunity and the integration of this complex system. Prior exposure to an immunology course is not formally required, albeit extra textbook reading may be necessary by students without such exposure. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MI 715",
        "course_title": "Immunological Basis of Disease",
        "description": "Journal article-based survey of mechanisms underlying diseases caused by abnormal immune system function. Emphasis will be on normal vs. pathological immune system processes towards reinforcing how basic immunological concepts have immediate clinical significance. 2 cr, Spring sem. alternate years"
    },
    {
        "course_code": "GMS MI 811",
        "course_title": "Microbiology Seminar",
        "description": "Presentation and discussion of problems of current interest. 2 cr, Fall sem."
    },
    {
        "course_code": "GMS MI 812",
        "course_title": "Microbiology Seminar",
        "description": "Presentation and discussion of problems of current interest. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS MI 823",
        "course_title": "Special Topics in Microbiology",
        "description": "The goals of this course are to provide a fundamental understanding of pathogen- host interactions. The course will build on prior understanding of cellular and molecular biology (e.g. the FiBS modules) and focus on host defense mechanisms that restrict pathogen invasion, pathogen mechanisms of evasion from innate and cell-intrinsic host defenses, description of virulence factors, and understanding mechanisms of bacterial and viral pathogenesis. Prior exposure to a virology or bacteriology course is beneficial. The classes will be interactive sessions consisting of a combination of PowerPoint presentations and discussion of primary research papers. The course will be aimed towards 1st and 2nd year Ph.D. students in the Division of Graduate Medical Sciences and taught by Microbiology Department faculty with expertise in viral and bacterial pathogenesis. Students will be assessed on their fundamental understanding of the course content, and their analytical and critical thinking skills. Students will be evaluated on their performance in class participation and in a written examination. Var cr. Spring sem."
    },
    {
        "course_code": "GMS MI 911",
        "course_title": "Research Microbiology",
        "description": "Var cr"
    },
    {
        "course_code": "GMS MI 912",
        "course_title": "Research Microbiology",
        "description": "Var cr"
    },
    {
        "course_code": "GMS MM 701",
        "course_title": "Genetics & Dis",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MM 703",
        "course_title": "Cancer Bio/Gen",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MM 707",
        "course_title": "Organ Sys Dis",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MM 710",
        "course_title": "Stem Cells and Regenerative Medicine",
        "description": "Graduate Prerequisites: consent of instructor This course is designed to teach basic research and translational research skills to students in the Molecular Medicine Curriculum, using general principles of stem cells and their potential use in regenerative medicine. Students will first be exposed to the basic concepts and definitions of stem cells, the detailed study of different types of adult vs pluripotent stem cells, and discuss ethical and practical considerations. Students will also learn about stem cell manipulation by novel gene editing techniques, recent advances in disease modeling and the potential use of stem cells in tissue and organ regeneration. 2 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MM 725",
        "course_title": "Lung Biology",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MM 730",
        "course_title": "Biological Core Technologies",
        "description": "Graduate Prerequisites: GMS CM753 or BI755 or BI 782 or consent of instructor The major goal of this course is to provide an overview of the principles and applications of modern techniques, which are regularly employed in academia and industry as tools for biomolecular and biomedical investigation. This course will focus on technologies which are available at BUSM. Specific technologies include microscopy, FACS, IHC, qPCR, genomic (next gen sequencing and microarrays), proteomics techniques, HTS, fluorescence molecular tomography, ultrasound and metabolic phenotyping techniques. 3 cr. Fall sem.",
        "prerequisites": "GMS CM753 or BI755 or BI 782 or consent of instructor"
    },
    {
        "course_code": "GMS MM 901",
        "course_title": "Molec MED Res",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MM 902",
        "course_title": "Molec MED Res",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MS 571",
        "course_title": "Directed Studies in Medical Sciences",
        "description": "Var cr, Fall sem."
    },
    {
        "course_code": "GMS MS 572",
        "course_title": "Directed Studies in Medical Sciences",
        "description": "Var cr, Spring sem."
    },
    {
        "course_code": "GMS MS 600",
        "course_title": "Introduction to Leadership for Biomedical Education",
        "description": "The objective of this introductory leadership course is to focus on the basic principles of personal and interpersonal leadership as they relate to the wide range of biomedical and health science careers that BU graduates may enter. We will explore the areas of voice, vision, emotional intelligence, conflict resolution, teamwork, and more. The material presented in this course will give way to the 5 practices of exemplary leaders that can be applied to any expertise area, but particularly for this course the biomedical research and health sciences areas. Completion of this course will benefit one's career by allowing them to apply leadership practices in order to lead a successful team of researchers or healthcare practitioner. Additionally, in understanding and applying leadership practices participants will become better team members thus encouraging team success. PhD students (especially, but not limited to, those on NIH training grants), masters students, and postdoctoral researchers are encouraged to take this course. 2 cr. Fall sem."
    },
    {
        "course_code": "GMS MS 640",
        "course_title": "Introduction to Biomedical Information",
        "description": "This course covers how to find, use, and contribute to biomedical literature while supporting the graduate thesis through lectures and hands-on instruction. Topics include the retrieval, evaluation and management of information, Evidence Based Medicine, and ethical considerations in research. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS MS 650",
        "course_title": "Machne Lrng Bio",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MS 700",
        "course_title": "Elementary Biostatistics for the Biomedical Sciences",
        "description": "Topics include collection, classification, and presentation of descriptive data; the rationale of hypothesis testing; experimental design; t-tests; simple correlation analysis; and analysis of contingency tables. Special attention is directed to the ability to recognize and interpret statistical procedures in articles from current literature. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS MS 710",
        "course_title": "Transdisciplinary Training Program in Addiction Science",
        "description": "This introductory course will cover the broad field of addiction with a focus on drug dependence. In one segment of the course, students will learn about the spectrum of drug dependence disorders and modalities for diagnosis and treatment. Another segment will present a wide variety of approaches for studying addiction using the tools of epidemiology, genetics, pharmacology, neurobehavior, and animal models. Emphasis will be placed on transdisciplinary approaches which are essential for understanding and combating addition disorders. In addition, students will be exposed to the impact of addiction on the family and society, and public policy issues addressing the prevention of addiction. 2 cr, Fall sem."
    },
    {
        "course_code": "GMS MS 750",
        "course_title": "Biostatistics",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MS 793",
        "course_title": "Fundamentals of Medical Biotechnology",
        "description": "Graduate Prerequisites: consent of instructor Grad Prereq: consent of instructor The course will provide students with an historical perspective of the fast emerging medical biotechnology field and the innovative processes that ensure the success of such endeavors. The course will cover a host of topics that will provide students with a springboard to develop their creative thinking and explore a new vision of medical biotechnology. 2 cr, Spring sem",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS MS 970",
        "course_title": "Directed Study",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MS 971",
        "course_title": "Rel MED Sci",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MS 972",
        "course_title": "Rel MED Sci",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS MS 981",
        "course_title": "Certified Full Time-With Courses",
        "description": "0 cr, Fall sem."
    },
    {
        "course_code": "GMS MS 982",
        "course_title": "Certified Full Time-With Courses",
        "description": "0 cr, Spring sem."
    },
    {
        "course_code": "GMS MS 983",
        "course_title": "Continuing Study-Part Time",
        "description": "0 cr, Fall sem."
    },
    {
        "course_code": "GMS MS 984",
        "course_title": "Continuing Study-Part Time",
        "description": "0 cr, Spring sem."
    },
    {
        "course_code": "GMS MS 985",
        "course_title": "Continuing Study-Full Time (no courses)",
        "description": "0 cr, Fall sem."
    },
    {
        "course_code": "GMS MS 986",
        "course_title": "Continuing Study-Full Time (no courses)",
        "description": "0 cr, Spring sem."
    },
    {
        "course_code": "GMS NE 570",
        "course_title": "Introduction to Computational Vision (Meets with ENG BE 570)",
        "description": "Introductory course in biological visual neuroscience and computational vision. Provides a survey of the psychophysical, neuroanatomical and neurophysiological substrates of visual mechanisms underlying perception of visual motion, depth, objects, and space and of decision making mechanisms. Discussion of theoretical, explanatory, paradigms for these visual mechanisms. Topics addressed include psychophysics, methods from single cell recording physiology and low field potentials (LFP), multimodal imaging and computational modeling of various visual tasks and their modulation by attention. We will briefly address learning mechanisms and their relationship to brain plasticity. A term project is required for graduate credit. 4 cr."
    },
    {
        "course_code": "GMS NE 700",
        "course_title": "Prin of Neuro 1",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS NE 710",
        "course_title": "Neural Plasticity and Perceptual Learning (meets with ENG BE 710)",
        "description": "This course explores the capacity of cortical sensory and motor maps in the adult brain to change as a result of alterations in the effectiveness of the input, direct damage, or practice. The lectures will describe and discuss (1) the physiology and anatomy underlying adult dynamics; (2) psychophysical methods and experimental paradigms that have been used to study cortical plasticity in the early stages of the sensory and motor pathways; (3) evidence for perceptual learning; and (4) biologically plausible computational models of learning. We will discuss application of functional neuroimaging to study perceptual learning and restorative plasticity in the human brain. a semester-long project is required. There will be 3 hours lecture/week and 1 hour of discussion of relevant papers and progress on the semester-long project."
    },
    {
        "course_code": "GMS NU 620",
        "course_title": "Clin Nutri Res",
        "description": "Graduate Prerequisites: Human Physiology or equivalent, consent of instructor This course description is currently under construction.",
        "prerequisites": "Human Physiology or equivalent, consent of instructor"
    },
    {
        "course_code": "GMS NU 700",
        "course_title": "Nutrition and Metabolism Seminar",
        "description": "Students learn the principles of presenting an effective scientific talk, including the use of PowerPoint to create appropriate and effective slides. In consultation with course faculty, each student selects a topic and two related key papers and then develops three presentations over the course of the semester within the class. Using feedback provided after each practice talk, students present their final public research seminar talk at the end of the semester. The course also expands knowledge of topics in nutrition and metabolism. Var cr, Spring sem."
    },
    {
        "course_code": "GMS NU 709",
        "course_title": "Res Methods",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS NU 711",
        "course_title": "Activity Metab",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS NU 755",
        "course_title": "Mol Nutrition 1",
        "description": "Graduate Prerequisites: at least one semester each of Biochemistry and Physiology, or equivalent, and consent of instructor This course description is currently under construction.",
        "prerequisites": "at least one semester each of Biochemistry and Physiology, or equivalent, and consent of instructor"
    },
    {
        "course_code": "GMS NU 756",
        "course_title": "Mol Nutrition 2",
        "description": "Graduate Prerequisites: at least one semester each of Biochemistry and Physiology, and consent of instructor This course description is currently under construction.",
        "prerequisites": "at least one semester each of Biochemistry and Physiology, and consent of instructor"
    },
    {
        "course_code": "GMS NU 757",
        "course_title": "Energy Balance",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS NU 804",
        "course_title": "Dir St/MED",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS NU 901",
        "course_title": "Research in Nutrition and Metabolism",
        "description": "These research credits reflect research taking place during the fall semester when students are in the laboratory or other research unit carrying out research for their master's thesis or doctoral dissertation. Var cr, Fall or Summer 1 sem."
    },
    {
        "course_code": "GMS NU 902",
        "course_title": "Research in Nutrition and Metabolism",
        "description": "These research credits reflect research taking place during the spring periods of study when students are in the laboratory or other research unit carrying out research for their master's thesis or doctoral dissertation. Var cr, Spring or Summer 2 sem."
    },
    {
        "course_code": "GMS OB 763",
        "course_title": "Basic Processes in Oral Biology",
        "description": "An introductory survey course that examines biological processes at the cellular and molecular levels. Provides a basis to understand the events that regulate inflammation; wound healing; bone formation and resorption; salivary proteins and physiology; tooth development, eruption, and movement; and fluoride action. 2 cr, Fall sem."
    },
    {
        "course_code": "GMS OB 764",
        "course_title": "Basic Processes in Oral Biology",
        "description": "An introductory survey course that examines biological processes at the cellular and molecular levels. Provides a basis to understand the events that regulate inflammation; wound healing; bone formation and resorption; salivary proteins and physiology; tooth development, eruption, and movement; and fluoride action. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS OB 766",
        "course_title": "Oral Immunology and Microbiology",
        "description": "This course has two modules: oral immunology and oral microbiology. The purpose of this course is to present material relative to the subject of oral immunobiology. The course will deal with the basics of the immune reaction from a subcellular level to an entire host reaction as they pertain to the etiology and pathogenesis of the disease processes in the oral cavity. This course will relate basic science findings to the clinical situations with an emphasis on treatment modalities for delivering clinical care. It is also the purpose of the course to provide an understanding of disease pathogenesis so that an informed basis of therapy can be recommended. The course will examine the complex microbial ecology of the mouth, with focus on the key microbes involved in dental diseases. The lectures will include the basic aspects of oral biofilm formation and microbial pathogenicity, with focus on the microbial diversity involved in caries, periodontal and periapical infections. There will be a short analysis of diagnostic microbial identification, as well as treatment modalities. The overall goal of the second module will be to link microbial clinical problems with basic infectious disease concepts, for a well informed approach to treatment. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS OB 800",
        "course_title": "Advanced Oral Biology",
        "description": "Graduate Prerequisites: GMS OB763 and OB 764; GMS BI755 and BI 756 This advanced course will explore in-depth current topics in oral biology research. The format of the course consists primarily of formal didactic lectures, but students will also be challenged to analyze experimental approaches and methods from current literature in a group-discussion \"journal\" club format in which papers from current literature are assigned and discussed. This course is designed to provide students with basic knowledge and to develop critical thinking abilities. Topics will include host molecular, cellular, and genetic bases of periodontal diseases; microbiology of periodontal diseases; molecular events in inflammation, wound healing, and periodontal tissue regeneration; molecular components and function of the periodontal ligament, cementum, and attachment structures; extracellular matrix accumulation and turnover in mineralized and non- mineralized tissues; the etiology and complications of diabetes, with emphasis on oral tissue pathology and mechanisms, biosynthesis and functions of oral mucins, endocrine-dependent periodontal changes, effects of growth factors on periodontal tissues and cells, biosynthesis and structure of salivary proteins, and mechanisms of non-immune antibacterial processes in the oral cavity. 4 cr, Fall sem.",
        "prerequisites": "GMS OB763 and OB 764; GMS BI755 and BI 756"
    },
    {
        "course_code": "GMS OB 805",
        "course_title": "Oral Biology Seminar",
        "description": "All PhD candidates will attend a weekly seminar series organized by the Department of Translational Dental Medicine. Faculty and invited speakers will give seminars, as will students nearing completion of their thesis research projects. Students will be encouraged to suggest invited speakers. Enrollment in this course will be required for two years (2 credits per semester, for a total of eight credits). All PhD candidates are required to attend all seminars for their entire period of study. 2 cr, Fall sem."
    },
    {
        "course_code": "GMS OB 806",
        "course_title": "Oral Biology Seminar",
        "description": "All PhD candidates will attend a weekly seminar series organized by the Department of Translational Dental Medicine. Faculty and invited speakers will give seminars, as will students nearing completion of their thesis research projects. Students will be encouraged to suggest invited speakers. Enrollment in this course will be required for two years (2 credits per semester, for a total of eight credits). All PhD candidates are required to attend all seminars for their entire period of study. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS OB 900",
        "course_title": "Oral Biology Research",
        "description": "Var cr"
    },
    {
        "course_code": "GMS OB 901",
        "course_title": "Oral Biology Research",
        "description": "Var cr"
    },
    {
        "course_code": "GMS OH 700",
        "course_title": "Pathology",
        "description": "Undergraduate Prerequisites: Consent of Instructor; must be Oral Health Sciences program This course description is currently under construction.",
        "prerequisites": "Consent of Instructor; must be Oral Health Sciences program"
    },
    {
        "course_code": "GMS OH 710",
        "course_title": "Appl Histology",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS OH 730",
        "course_title": "Physiology A/Dental",
        "description": "Graduate Prerequisites: Graduate Prerequisites: consent of instructor; must be enrolled in the Oral Health Sciences program This course presents the physiology of cells, tissues, organs and integrated body functions, including the physiological basis for the understanding of clinical conditions. An integrated approach is taken to endocrinology and reproduction. Hormonal aberrations and their end results in human are presented in clinical correlations. 6 cr, Fall sem.",
        "prerequisites": "Graduate Prerequisites: consent of instructor; must be enrolled in the Oral Health Sciences program"
    },
    {
        "course_code": "GMS OH 731",
        "course_title": "Physiologya/Dnt",
        "description": "Graduate Prerequisites: Graduate Prerequisites: GMS OH 730; consent of instructor; must be enrolled in the Oral Health Sciences program This course description is currently under construction.",
        "prerequisites": "Graduate Prerequisites: GMS OH 730; consent of instructor; must be enrolled in the Oral Health Sciences program"
    },
    {
        "course_code": "GMS OH 740",
        "course_title": "Microbiology and Immunology/Dental",
        "description": "Graduate Prerequisites: Graduate Prerequisites: consent of instructor; must be enrolled in the Oral Health Sciences program The overall goals of this course are to provide students with: (1) a basic background in microbiology, including the nomenclature, structure, physiology, genetics, mechanisms of pathogenesis, and clinical manifestations associated with the major pathogenic microorganisms (bacteria, fungi and viruses); (2) an understanding of how the basic principles of microbiology are integral to effective diagnosis, treatment and prevention of infectious disease, and (3) a basic background in immunology including the functions and disorders of the immune system. 4 cr, Spring sem.",
        "prerequisites": "Graduate Prerequisites: consent of instructor; must be enrolled in the Oral Health Sciences program"
    },
    {
        "course_code": "GMS OH 750",
        "course_title": "Prevention and Health Promotion in Dentistry",
        "description": "Graduate Prerequisites: Graduate Prerequisites: consent of instructor; must be enrolled in the Oral Health Sciences program The course introduces the concepts and techniques of dental public health, disease prevention and health promotion in dentistry and overall health. The course emphasizes current issues such as caries prevention, periodontal disease, and oral cancer prevention in the individual and community. 3 cr, Spring sem.",
        "prerequisites": "Graduate Prerequisites: consent of instructor; must be enrolled in the Oral Health Sciences program"
    },
    {
        "course_code": "GMS OH 751",
        "course_title": "Biochemistry/Dental",
        "description": "Graduate Prerequisites: Graduate Prerequisites: consent of instructor; must be enrolled in the Oral Health Sciences program This course is designed to acquaint the student with the basic principles of modern biochemistry. The topics to be covered include an introduction to biochemistry and its importance to understanding oral health as well as proteins, enzymes, DNA, RNA and protein synthesis, sugar and lipid metabolism, hormones and second messengers and connective tissue biochemistry. In addition to the traditional lecture format, students participate in case-based presentations designed to integrate clinical cases with the material presented in class. 6 cr, Fall sem.",
        "prerequisites": "Graduate Prerequisites: consent of instructor; must be enrolled in the Oral Health Sciences program"
    },
    {
        "course_code": "GMS OH 770",
        "course_title": "Evidence Based Dentistry",
        "description": "Graduate Prerequisites: consent of instructor The goal of the Oral Health Sciences (OHS) Evidence Based Dentistry course is to provide students with a working understanding of basic research study design and analysis in order to promote critical reading of the scientific literature. Content will touch upon a wide range of experimental techniques in the clinical sciences as well as ethical issues in the oral health sciences. The focus will be on evidence-based dentistry and both reasoning and critical thinking skills will be challenged. 2 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS OH 771",
        "course_title": "Head/Neck Anat",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS OH 971",
        "course_title": "Oral Health Res",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS OH 972",
        "course_title": "Oral Health Res",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PA 510",
        "course_title": "Medical Immunology",
        "description": "This course is a graduate level introductory course to the basics of immunology. Topics include the innate immune system, T and B cell functions, mechanisms of autoimmune diseases, transplant rejection, HIV and hypersensitivity reactions. The course emphasizes the clinical aspects of the immune system. This course is appropriate for students interested in an introduction to how the immune system functions, those interested in updates on the rapidly changing aspects of immunology or those interested in how the immune system drives different diseases. Spring Semester"
    },
    {
        "course_code": "GMS PA 600",
        "course_title": "Introduction to Pathology and Pathophysiology of Disease",
        "description": "Graduate Prerequisites: GMS FC701, FC702, FC703 or GMS BI751 & PH730 Lectures and interactive auto-tutorial case studies presenting the basic morphologic and functional changes associated with cell injury and death, inflammation, response to microorganisms, atherosclerosis, cancer, and organ system pathology. Spring sem.",
        "prerequisites": "GMS FC701, FC702, FC703 or GMS BI751 & PH730"
    },
    {
        "course_code": "GMS PA 610",
        "course_title": "Biomed Immunology",
        "description": "This online course uses interactive lectures and discussion sessions to cover key biomedical aspects of immunology: how the components of the immune system are generated and function against microbes, tumors and transplants; immune disorders including allergy, autoimmunity and immunodeficiency; vaccines, immunotherapeutics and immunodiagnostics. Fall and Spring sem."
    },
    {
        "course_code": "GMS PA 700",
        "course_title": "Basic and Experimental Pathology",
        "description": "Graduate Prerequisites: GMS FC701, FC702, FC703 or consent of instructor Basic principles of pathology are presented through lectures (students are required to attend GMS PA 600 lectures and take the PA 600 exams). Related research articles are discussed in small group sessions that complement the lectures. Spring sem.",
        "prerequisites": "GMS FC701, FC702, FC703 or consent of instructor"
    },
    {
        "course_code": "GMS PA 710",
        "course_title": "Principles of Basic and Applied Pathology",
        "description": "Pathology is the study of disease causes and consequences. Want more in- depth information about pathology and other faculty research interests? Invited GMS faculty present their current research projects in class to give you an overview of the breadth and depth of research opportunities on campus. Students also attend weekly Pathology Department seminars and learn how to write summaries. Did you know the most important parts of a grant application are summaries? This course will prepare you for lab rotations and help guide your decisions regarding thesis research directions. Fall sem."
    },
    {
        "course_code": "GMS PA 800",
        "course_title": "Pathology Seminar",
        "description": "Graduate Prerequisites: GMS PA600 or PA700 or consent of instructor Weekly research seminar presented by faculty, students, and guests. Prior to each seminar, research papers authored by the speaker will be sent to graduate students and faculty to provide additional background material. Fall sem.",
        "prerequisites": "GMS PA600 or PA700 or consent of instructor"
    },
    {
        "course_code": "GMS PA 801",
        "course_title": "Special Topics in Pathology",
        "description": "Graduate Prerequisites: GMS PA600 or PA700 or consent of instructor Detailed examination of one specific area of research each term, presented in readings, discussions, and lectures. Presents significant background information, current knowledge, research approaches, and laboratory methodology in each area. Special Topic: Protein Modification and Molecular Basis of Human Diseases. Varying Pathology Faculty, Course Directors. Spring sem.",
        "prerequisites": "GMS PA600 or PA700 or consent of instructor"
    },
    {
        "course_code": "GMS PA 810",
        "course_title": "Seminars in Business of Science",
        "description": "Graduate Prerequisites: GMS FC701, FC702, FC703 or GMS BI751 & PH730 The objective of this course is to introduce students to the business realities of modern biomedical science which is patent-driven and product- oriented. Lectures from invited speakers from the biomedical, legal, regulatory and business worlds provide terminology and perspective for how an idea in the laboratory is translated into a marketable commodity. Topics include entrepreneurship principles, explanation and discussion of intellectual property, medical clinical trials, federal and institutional regulatory mechanisms, logistics of creating and sustaining research collaborations, product development strategies, and similar. Pass/Fail, Fall sem.",
        "prerequisites": "GMS FC701, FC702, FC703 or GMS BI751 & PH730"
    },
    {
        "course_code": "GMS PA 811",
        "course_title": "Seminars in Business of Science",
        "description": "The objective of this course is to introduce students to the business realities of modern biomedical science which is patent-driven and product- oriented. Lectures from invited speakers from the biomedical, legal, regulatory and business worlds provide basic terminology and perspective for how an idea in the laboratory is translated into a marketable commodity. Topics include entrepreneurship principles, explanation and discussion of intellectual property, medical clinical trials, federal and institutional regulatory mechanisms, logistics of creating and sustaining research collaborations, product development strategies, and similar. Graded Fall sem."
    },
    {
        "course_code": "GMS PA 900",
        "course_title": "Laboratory Rotations in Pathology",
        "description": "2 cr, Fall and Spring sem"
    },
    {
        "course_code": "GMS PA 901",
        "course_title": "Research in Pathology",
        "description": "Fall and Spring Sem"
    },
    {
        "course_code": "GMS PA 910",
        "course_title": "Human Biospecimens for Research",
        "description": "The objective of this course is to introduce students to the creation, maintenance and efficient use of an indispensable component of translational research in medicine -- human tissue and its derivatives. Lectures from invited speakers with extensive experience in human bio-specimens generation, maintenance, and utilization, will provide students with knowledge how to successfully obtain and utilize human bio-specimens. Topics will include logistics and legal aspects of creating and sustaining bio- banks, federal and institutional regulatory and funding mechanisms, and concrete examples of human bio-specimens use to generate break-through data in specific field of biomedical research. Special attention will be given to human biospecimens used in neuroscience as neuropathologists/neuroscientists from Harvard and Boston University are enlisted as speakers to give comprehensive overview of biospecimens utilized in studies of neurodegenerative diseases and brain tumors. Spring (every other year)"
    },
    {
        "course_code": "GMS PA 925",
        "course_title": "Pathology Bootcamp",
        "description": "Pathology Boot Camp is a 2 month curriculum held during July and August with thirty-nine, 50 minute lectures that are given 3-5 times per week. Lectures are provided by board-certified pathologists, senior Pathology faculty or staff and focus on basic topics necessary to the practice of surgical pathology, anatomic pathology and laboratory medicine. The overall course objectives are to reinforce and extend pathology knowledge of the residents and graduate students, and to introduce them to the workflow operations of a major urban hospital-based Pathology department. Pre-requisites: Medical degree that would allow entry into a residency program in Massachusetts."
    },
    {
        "course_code": "GMS PA 932",
        "course_title": "Histopathology",
        "description": "The goal of the course is to give students a fundamental knowledge and practical experience of human and animal histology and pathology that students need to prepare for a career in pathology and laboratory medicine. This course familiarizes students with biospecimen processing and management at the organ, tissue, cellular and molecular levels. By studying different organs and organ systems, students develop an understanding of the normal and diseased state at the macro and microscopic levels. The course is reinforced with applied, hands-on laboratory sessions that would provide practical experience in the topics covered in the preceding lectures. The students learn how to dissect, preserve, process, section, and stain tissue. The teaching faculty will include \"board certified pathologists\" as well as experienced members of the pathology department."
    },
    {
        "course_code": "GMS PA 999",
        "course_title": "PA Thesis",
        "description": null
    },
    {
        "course_code": "GMS PH 730",
        "course_title": "Human Physiology A",
        "description": "Graduate Prerequisites: consent of instructor Cellular and organ physiology. Lectures and discussions examine the function of nerves, muscles, blood and the cardiovascular and digestive systems. Emphasis is placed on the regulation of organ function and on integrative aspects of human physiology. 4 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS PH 731",
        "course_title": "Human Physiology B",
        "description": "Graduate Prerequisites: GMS PH730 or consent of instructor Lectures, laboratories and discussions examine function and regulation of the respiratory , renal, and endocrine systems with emphasis on integrative aspects. 4 cr, Spring sem.",
        "prerequisites": "GMS PH730 or consent of instructor"
    },
    {
        "course_code": "GMS PH 741",
        "course_title": "Experimental Methods in Physiology I",
        "description": "Prereq: consent of instructor. Current research methods in cellular and molecular physiology, as applied to the study of macromolecular function, motility, ligand binding phenomena, and membrane function. Develops problem-solving skills and awareness of current approaches to research problems. Staff. 2 cr, Fall sem."
    },
    {
        "course_code": "GMS PH 742",
        "course_title": "Experimental Methods in Physiology II",
        "description": "Prereq: consent of instructor. A practical approach to electrophysiology techniques. Garcia-Diaz, staff. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS PH 745",
        "course_title": "Special Topics in Physiology",
        "description": "Graduate Prerequisites: consent of instructor Current and classical papers in a given area of physiology are assigned for reading and later discussion with students. Topics include mechanics of muscle, cell motility, membrane transport, sensory physiology, and instrumentation in physiological research. Var cr, Fall & Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS PH 841",
        "course_title": "Physiology Seminar",
        "description": "A weekly program in which students present seminars on assigned or selected topics in physiology, attend seminars, and learn grant-writing skills. Emphasis is placed on class participation by all students. 2 cr."
    },
    {
        "course_code": "GMS PH 842",
        "course_title": "Physiology Seminar",
        "description": "A weekly program in which students present seminars on assigned or selected topics in physiology, attend seminars, and learn grant-writing skills. Emphasis is placed on class participation by all students. 2 cr."
    },
    {
        "course_code": "GMS PH 843",
        "course_title": "Cellular Physiology I and II",
        "description": "Prereq: consent of instructor. Lectures and discussion on: (1) membrane transport, thermodynamic and kinetic analysis; (2) electrophysiology of cell membranes, excitable membrane properties, electrical coupling, synaptic transmission; and (3) cell motility, molecular mechanism, and regulation of contraction of muscle and other cells; mechanisms of transduction of photoreceptors. Garcia-Diaz, staff. 4 cr, Fall & Spring sem."
    },
    {
        "course_code": "GMS PH 941",
        "course_title": "Research Physiology",
        "description": "Var cr"
    },
    {
        "course_code": "GMS PH 942",
        "course_title": "Research Physiology",
        "description": "Var cr"
    },
    {
        "course_code": "GMS PM 701",
        "course_title": "Molecular & Translational Pharmacology",
        "description": "Undergraduate Prerequisites: Consent of instructor This course provides an integrated sequence of interactive teaching sessions designed to educate students in the fundamental principles of pharmacology with an emphasis on modern translational approaches for drug discovery. Basic principles of pharmacokinetics, pharmacodynamics and pharmacogenomics, the properties of drug targets, and the chemistry of natural products, small molecules and proteins will be emphasized. Translational topics will include an in-depth considerations of systems-level effects of target-drug interaction, macromolecular modeling for drug design, and nanotechnolog methods for drug delivery. 2 cr, Fall sem.",
        "prerequisites": "Consent of instructor"
    },
    {
        "course_code": "GMS PM 702",
        "course_title": "Molecular Neurobiology & Pharmacology",
        "description": "Undergraduate Prerequisites: Consent of instructor This course introduces the student to the principles of pharmacology in the context of neurobiology. Emphasis is placed on translational pharmacology and the application of pharmacology to therapeutics, particularly to neurological disorders. 2 cr, Spring sem.",
        "prerequisites": "Consent of instructor"
    },
    {
        "course_code": "GMS PM 710",
        "course_title": "Laboratory Techniques in Modern Pharmacology",
        "description": "Graduate Prerequisites: consent of instructor Supervised laboratory rotation emphasizing modern research techniques in molecular, cellular, and behavioral pharmacology. Problems of collection, summary, and interpretation of data are addressed. 2 cr, Fall & Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS PM 730",
        "course_title": "Introduction to Medical Pharmacology",
        "description": "Graduate Prerequisites: premedical courses in the sciences Principles of pharmacology are covered and several major classes of therapeutic agents, with attention to their mechanisms of action. Issues of current and future concern in medical pharmacology are addressed including problems of drug abuse, the pricing of new drugs, and new biotechnological approaches to drug design and development. 4 cr, Spring sem.",
        "prerequisites": "premedical courses in the sciences"
    },
    {
        "course_code": "GMS PM 801",
        "course_title": "Systems Pharmacology and Therapeutics I",
        "description": "Graduate Prerequisites: consent of instructor This course consists of lectures and discussions on the major classes of neuropharmacological agents, with special attention to systems mechanisms of therapeutic and adverse effects, including molecular, cellular, physiologic, psychological, and pathologic phenomenon. Starting from a basic review of current therapeutics in a particular disease area, students will be encouraged to anticipate new developments in the field and to propose solutions for solving problems with current pharmacologic approaches. 2 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS PM 802",
        "course_title": "Systems Pharmacology and Therapeutics II",
        "description": "Graduate Prerequisites: consent of instructor This course consists of lectures and discussions on major classes of pharmacological agents, with special attention to systems mechanisms of therapeutics and adverse effects, including molecular, cellular, physiologic, psychological, and pathologic phenomenon. Starting from a basic review of current therapeutics in a particular disease area, students will be encouraged to anticipate new developments in the field and to propose solutions for solving problems with current pharmacological approaches. The course focuses on cardiovascular, endocrine, and steroid pharmacology and chemotherapy for inflammation, cancer, and bacterial and viral infections. 2 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS PM 810",
        "course_title": "Current Topics in Pharmacological Sciences",
        "description": "Graduate Prerequisites: consent of instructor This course is given in conjunction with the weekly seminar program of the department. Students present and discuss research papers with the visiting scientist working on the cutting edge of pharmacology. 2 cr, Spring sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS PM 820",
        "course_title": "Behav Pharm",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PM 843",
        "course_title": "Pharmacologic Intervention in Inflammatory Responses",
        "description": "Graduate Prerequisites: consent of instructor Graduate Prerequisites: consent of instructor Course Description: Protective immunity is essential for maintaining the homeostasis of body, including the central nervous system and peripheral tissues. It is responsible for fighting against both host and pathogen, through detection of abnormal host condition (such as tumorigenesis, apoptosis, and necrosis) and pathogen invasion (such as microbes and allergic particles). The first responders to these changes are innate immune cells, such as neutrophils, dendritic cells and macrophages in the periphery and microglia and infiltrating myeloid cells in the central nervous system. The common response of innate immune cells is \"acute inflammation.\" Although acute inflammation is a fundamental physiologic response of multicellular organisms to infection and injury, unresolved and chronic inflammation can have significant pathophysiologic consequences, such as gastrointestinal inflammation, neuroinflammation and tumor inflammation. This course examines the cellular components, inflammatory mediators, and their mechanisms of action, and therapeutic modulation of inflammation in the central nervous system and periphery. The format includes lectures on inflammatory components of selected diseases and student-led discussions of review and research papers. 2 cr, Fall sem.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS PM 881",
        "course_title": "Drug Discv/Dev",
        "description": "Graduate Prerequisites: consent of instructor This course description is currently under construction.",
        "prerequisites": "consent of instructor"
    },
    {
        "course_code": "GMS PM 892",
        "course_title": "Molecular and Neural Bases of Learning Behaviors",
        "description": "Prereq: consent of instructor. Lectures and student presentations on literature in learning and memory research with special emphasis on integrated approaches from molecular, genetic, pharmacological levels to circuitry, systems, computational, and behavioral levels. Staff. 2 cr, Spring sem."
    },
    {
        "course_code": "GMS PM 931",
        "course_title": "Research in Pharmacology",
        "description": "Var cr"
    },
    {
        "course_code": "GMS PM 932",
        "course_title": "Research in Pharmacology",
        "description": "Var cr"
    },
    {
        "course_code": "GMS PS 700",
        "course_title": "Anatomy",
        "description": "This foundation course prepares the PA student to recognize the cell morphology of specific organs and soft tissues of the human body, identify anatomical structures as they relate to the physical examination, specific diseases and surgical procedures and to employ 3-D spatial reasoning to interpret radiographic studies. The course utilizes lectures, case-based discussion and the dissection laboratory."
    },
    {
        "course_code": "GMS PS 701",
        "course_title": "Basic Medical Sciences",
        "description": "This course provides a broad foundation for medical sciences study including such topics as biochemistry, cell biology, genetics, and immunology. This course utilizes lectures as its means of instruction."
    },
    {
        "course_code": "GMS PS 702",
        "course_title": "Physiology",
        "description": "This course prepares the PA student to apply physiological principles to the practice of medicine . The course utilizes lectures, case-based discussion and the laboratory. The course has several modules including but not limited to cardio-vascular, pulmonary, endocrinology, renal, neurologic and gastro-intestinal physiology. The course utilizes traditional lectures and laboratory sessions to reinforce the principles of normal physiology."
    },
    {
        "course_code": "GMS PS 703",
        "course_title": "Introduction to Research",
        "description": "The Introduction to Research course prepares the PA student to search and interpret medical literature as it relates to best practices for clinical care, epidemiology, and disease surveillance. In addition, the course prepares the students to develop their thesis project. This course utilizes lectures, journal clubs and online learning as means of instruction."
    },
    {
        "course_code": "GMS PS 704",
        "course_title": "Introduction to Clinical Medicine",
        "description": "The Introduction to Clinical Medicine course prepares the PA student to utilize the patient-centered interview and physical examination to assess pediatric, adult and geriatric patients. This course uses lectures, interview role play sessions and physical examination practica."
    },
    {
        "course_code": "GMS PS 705",
        "course_title": "Score 1",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 706",
        "course_title": "Score 2",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 707",
        "course_title": "Score 3",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 708",
        "course_title": "Score 4",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 719",
        "course_title": "Foundations of Microbiology, Pathology and Pharmacology",
        "description": "The course provides the foundations for the student's medical microbiology, pathology, and pharmacology throughout the curriculum of their Diagnosis and Therapy course. The overall goal of the course is to provide knowledge and understanding of the fundamental principle of these subjects that are the basis of current approaches to prevention, diagnosis and management of disease. The application of these scientific principles and knowledge to the practice of medicine, including the development of life-long learning and problem-solving skills, is emphasized. PA students only. 2 cr. Spring."
    },
    {
        "course_code": "GMS PS 723",
        "course_title": "Disease and Therapy VI",
        "description": "This course prepares the PA student to apply knowledge of the epidemiology, clinical presentation, pathophysiology, diagnostic evaluation, differential diagnosis, treatment and prognosis of human disease to clinical patients. Disease and Therapy consists of six modules in which students learn the microbiological basis of infectious diseases and pharmacologic treatment. Modules address diseases and disorders by organ system: Pulmonary, Cardiovascular, Rheumatology, Renal, Gastrointestinal, Dermatology, Reproduction, Endocrinology/Nutrition, Neurology, Psychiatry, Oncology, and Hematology. The course utilizes traditional lectures, case-based discussions and patient presentations for instruction."
    },
    {
        "course_code": "GMS PS 724",
        "course_title": "Disease and Therapy V",
        "description": "This course prepares the PA student to apply knowledge of the epidemiology, clinical presentation, pathophysiology, diagnostic evaluation, differential diagnosis, treatment and prognosis of human disease to clinical patients. Disease and Therapy consists of six modules in which students learn the microbiological basis of infectious diseases and pharmacologic treatment. Modules address diseases and disorders by organ system: Pulmonary, Cardiovascular, Rheumatology, Renal, Gastrointestinal, Dermatology, Reproduction, Endocrinology/Nutrition, Neurology, Psychiatry, Oncology, and Hematology. The course utilizes traditional lectures, case-based discussions and patient presentations for instruction."
    },
    {
        "course_code": "GMS PS 725",
        "course_title": "Disease and Therapy VI",
        "description": "This course prepares the PA student to apply knowledge of the epidemiology, clinical presentation, pathophysiology, diagnostic evaluation, differential diagnosis, treatment and prognosis of human disease to clinical patients. Disease and Therapy consists of six modules in which students learn the microbiological basis of infectious diseases and pharmacologic treatment. Modules address diseases and disorders by organ system: Pulmonary, Cardiovascular, Rheumatology, Renal, Gastrointestinal, Dermatology, Reproduction, Endocrinology/Nutrition, Neurology, Psychiatry, Oncology, and Hematology. The course utilizes traditional lectures, case-based discussions and patient presentations for instruction."
    },
    {
        "course_code": "GMS PS 730",
        "course_title": "Prinscimed 1",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 731",
        "course_title": "Prinscimed 2",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 732",
        "course_title": "Prinscimed 3",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 733",
        "course_title": "Prinscimed 4",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 734",
        "course_title": "Prinscimed 5",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 735",
        "course_title": "Prinscimed 6",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 736",
        "course_title": "Prinscimed 7",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 742",
        "course_title": "Clinical Practicum",
        "description": "This course prepares the PA student to synthesize their basic science and clinical medicine knowledge to approach a patient. The PA student will also learn to create a portion of the medical record. The course utilizes traditional lectures, clinical reasoning sessions, journal clubs and hospital sessions for instruction."
    },
    {
        "course_code": "GMS PS 743",
        "course_title": "Clinical Practicum II",
        "description": "This course prepares the PA student to synthesize their basic science and clinical medicine knowledge to approach a patient and builds on what they have learned in ICM and CP I. The PA student will also learn to create the entire medical record and develop their oral presentation skills. The course utilizes traditional lectures, clinical reasoning sessions, journal clubs and hospital sessions for instruction."
    },
    {
        "course_code": "GMS PS 744",
        "course_title": "Preventive Medicine",
        "description": "This course prepares the PA student to apply knowledge and counseling skills to prevent disease and encourage healthy behaviors. The course utilizes traditional lectures, case-based discussions and interactive projects for instruction."
    },
    {
        "course_code": "GMS PS 797",
        "course_title": "Adv Clin MED 1",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 798",
        "course_title": "Adv Clin MED 2",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 799",
        "course_title": "Adv Clin MED 3",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 800",
        "course_title": "Internal Medicine 1",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 801",
        "course_title": "Advanced Clinical Medicine",
        "description": "This course prepares the PA student to apply knowledge of the epidemiology, clinical presentation, pathophysiology, diagnostic evaluation, differential diagnosis, treatment and prognosis of human disease to clinical patients at the next level. The course utilizes lectures and case-based discussions while the content focuses on pediatrics, geriatrics and emergency medicine."
    },
    {
        "course_code": "GMS PS 802",
        "course_title": "Internal Medicine 2",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 803",
        "course_title": "Primary Care 1",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 804",
        "course_title": "Primary Care 2",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 805",
        "course_title": "Emergency Medicine",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 806",
        "course_title": "Pediatrics",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 807",
        "course_title": "Psychiatry",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 808",
        "course_title": "Ob/Gyn",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 809",
        "course_title": "Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 870",
        "course_title": "PA Profession Course",
        "description": "This course prepares the PA student for professional clinical practice. Concepts taught include but are not limited to advanced clinical reasoning, billing and coding, health care reform as it relates to the delivery of primary care and how to apply for and successfully garner employment as a PA and hospital credentialing. The course utilizes traditional lectures, case-based discussions and patient presentations for instruction. ."
    },
    {
        "course_code": "GMS PS 901",
        "course_title": "Interventional Radiology",
        "description": "Clinical rotation. PA Students only"
    },
    {
        "course_code": "GMS PS 902",
        "course_title": "Lab Medicine",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 903",
        "course_title": "Radiology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 904",
        "course_title": "Anesthesia",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 905",
        "course_title": "Medical ICU",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 906",
        "course_title": "Surgical ICU",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 910",
        "course_title": "Cardiac Cath",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 911",
        "course_title": "Cardiology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 912",
        "course_title": "Eps-Cardiology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 913",
        "course_title": "Dermatology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 914",
        "course_title": "Emergency MED Elect",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 915",
        "course_title": "Endocrinology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 916",
        "course_title": "GI",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 917",
        "course_title": "Global Health",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 918",
        "course_title": "Hematology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 919",
        "course_title": "Hospitalist",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 920",
        "course_title": "Infectious Dis",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 921",
        "course_title": "IM Sub-I",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 922",
        "course_title": "Nephrology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 923",
        "course_title": "Neurology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 924",
        "course_title": "Oncology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 925",
        "course_title": "PC Sub-I",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 926",
        "course_title": "Pulmonary MED",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 927",
        "course_title": "Rheumatology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 928",
        "course_title": "Women's Health",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 929",
        "course_title": "Arranged Clerk",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 930",
        "course_title": "Psych Sub-I",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 931",
        "course_title": "Geriatrics",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 932",
        "course_title": "Addiction MED",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 933",
        "course_title": "Urgent Care",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 950",
        "course_title": "Neonatal ICU",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 951",
        "course_title": "Peds Endocrine",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 952",
        "course_title": "Peds Heme-Onc",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 953",
        "course_title": "Peds Ortho",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 954",
        "course_title": "Peds Sub-I",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 955",
        "course_title": "Peds Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 960",
        "course_title": "Bariatric Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 961",
        "course_title": "Cardiac Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 962",
        "course_title": "Hand Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 963",
        "course_title": "Neurosurgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 964",
        "course_title": "Ophthalmology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 965",
        "course_title": "Orthopaedics",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 966",
        "course_title": "Otolaryngology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 967",
        "course_title": "Plastic Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 968",
        "course_title": "Onc Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 969",
        "course_title": "Transplant Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 970",
        "course_title": "Trauma Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 971",
        "course_title": "Urology",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 972",
        "course_title": "Vascular Surgery",
        "description": "Clinical rotation. PA Students only."
    },
    {
        "course_code": "GMS PS 973",
        "course_title": "Thoracic Surg",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 995",
        "course_title": "Tcm",
        "description": "This course description is currently under construction."
    },
    {
        "course_code": "GMS PS 996",
        "course_title": "Telemedicine",
        "description": "The purpose of this course is to provide the student with a remote clinical experience designed to teach and reinforce practical clinical skills utilizing Telemedicine as the platform for patient encounters. The course will utilize online history taking techniques, ordering and interpretation of diagnostic studies, and oral presentations to Proctors and Standardized Patients. PA students only. 4 cr. Summer 1"
    },
    {
        "course_code": "GMS PS 997",
        "course_title": "Public Health",
        "description": "Students in the clinical phase of the Physician Assistant program will utilize this non-clinical elective course as a primer for understanding the practice of Public Health on a population and its influence on the practice of medicine. Critical analysis and application of quantitative and qualitative data and how they relate to Epidemiology, Biostatistics, Environmental Health, Health Policy and Program Development, Basic Healthcare Management and Finance, Chronic Non-communicable and Infectious Diseases, Maternal and Child Health, Population Dynamics, and the Social Determinants of Health with selected instruction on Public Health Surveillance Systems, Public Health Aspects of Sex and Gender, the Politics of Consumables and the Public Health of Immigrant/Refugee/Displaced Populations. Students will participate in case-based instruction, live and pre-recorded lectures culminating in a group project which will utilize many of the concepts and techniques learned throughout the course as applied to a Public Health issue. Clinical Phase PA students only. 4 cr. Spring sem."
    },
    {
        "course_code": "GMS PS 998",
        "course_title": "Self-Directed Study Elective",
        "description": "Prerequisites: Successful completion of the PA didactic phase. Students in the clinical phase of the PA program will use this non-clinical elective to develop and hone clinical knowledge and critical thinking as it applies to the practice of medicine. Efficient history taking, effective physical examination skills, and critical thinking to develop differential diagnoses and management plans will be honed using virtual simulations. Students will receive feedback on history taking, physical examination, differential diagnosis, ordering of clinical studies and SOAP notes. Clinical phase PA students only. 4 cr. Fall sem.",
        "prerequisites": "Successful completion of the PA didactic phase.  Students in the clinical phase of the PA   program will use this non-clinical elective to develop and hone clinical knowledge and critical thinking as it   applies to the practice of medicine. Efficient history taking, effective physical examination skills, and critical   thinking to develop differential diagnoses and management plans will be honed using virtual simulations.   Students will receive feedback on history taking, physical examination, differential diagnosis, ordering of   clinical studies and SOAP notes. Clinical phase PA students only. 4 cr. Fall sem."
    },
    {
        "course_code": "GMS PS 999",
        "course_title": "Physician Assistant Program Master's Thesis",
        "description": "PA Students only."
    }
]