[
    {
        "course_code": "QST AC 221",
        "course_title": "Financial Accounting",
        "description": "Undergraduate Prerequisites: QST SM131; QST SM132 previous or concurrent. Basic concepts underlying financial statements and accounting procedures used in preparing statements of financial position, income statements, and statements of cash flow. Stresses the interpretation, analysis, and evaluation of published financial statements.",
        "prerequisites": "QST SM131; QST SM132 previous or concurrent."
    },
    {
        "course_code": "QST AC 222",
        "course_title": "Managerial Accounting",
        "description": "Undergraduate Prerequisites: QST AC221 previous or concurrent Sophomore requirement. Introduces the basic principles, methods, and challenges of modern managerial accounting. Covers traditional topics such as job-order costing, cost-volume-profit analysis, budgeting and variance analysis, profitability analysis, relevant costs for decision making, and cost-plus pricing, as well as emerging topics such as Activity-Based Cost (ABC) accounting. The material is examined from the perspective of students preparing to use management accounting information as managers, to support decision making (such as pricing, product mix, sourcing, and technology decisions) and short- and long-term planning, and to measure, evaluate, and reward performance. Emphasizes the relationships between accounting techniques and other organizational activities (such as strategy and motivation).",
        "prerequisites": "QST AC221 previous or concurrent"
    },
    {
        "course_code": "QST AC 347",
        "course_title": "Intermediate Accounting I",
        "description": "Undergraduate Prerequisites: QST AC221; QST AC222 previous or concurrent. Pre-req for SHA students: SHA HF210; SHA HF310 Required for Accounting concentrators. Provides foundation for solving financial reporting issues through the study of the conceptual framework of accounting, recognition and measurement of current and non-current assets, revenue recognition, and the development of the income statement and balance sheet.",
        "prerequisites": "QST AC221; QST AC222 previous or concurrent. Pre-req for SHA students: SHA HF210; SHA HF310"
    },
    {
        "course_code": "QST AC 348",
        "course_title": "Intermediate Accounting II",
        "description": "Undergraduate Prerequisites: QST AC 347. Continues with providing a foundation for solving financial reporting issues through the study of liabilities (including pensions, bonds, and leases), inter- period tax allocation, stockholder's equity, and the statement of cash flows.",
        "prerequisites": "QST AC 347."
    },
    {
        "course_code": "QST AC 414",
        "course_title": "Financial Statement Analysis",
        "description": "Undergraduate Prerequisites: QST AC 347; QST AC347 Analysis of corporate financial statements. Includes profitability analysis, liquidity and solvency analysis, the incentives of management in corporate reporting, and the use of accounting information in efficient capital markets.",
        "prerequisites": "QST AC 347; QST AC347"
    },
    {
        "course_code": "QST AC 420",
        "course_title": "Introduction to Financial Analytics",
        "description": "Undergraduate Prerequisites: QST FE 323 ; QST MK 323 ; QST OM 323 ; QST QM 323. The world of business is deluged by data. This course will equip students with data analytics tools, skills, concepts, and techniques in accounting, finance, and economics to help them understand fundamental business issues. They will work with financial reporting and capital market datasets, and design and critique statistical analyses for financial decision-making. The course will provide students with a basic ability to code in Python and apply these skills to define, classify, and structure datasets focused on financial reporting and financial market data; and use such data to analyze and predict corporate and market outcomes, as well as identify the limitations of such analyses.",
        "prerequisites": "QST FE 323 ; QST MK 323 ; QST OM 323 ; QST QM 323."
    },
    {
        "course_code": "QST AC 430",
        "course_title": "Accounting Research",
        "description": "Undergraduate Prerequisites: Senior standing; QST AC348 previous or concurrent Develops and practices research skills required of an accounting professional. Use accounting-related resources to research and understand accounting reporting issues and authoritative guidance for application of GAAP.",
        "prerequisites": "Senior standing; QST AC348 previous or concurrent"
    },
    {
        "course_code": "QST AC 445",
        "course_title": "Advanced Managerial Accounting",
        "description": "Undergraduate Prerequisites: Senior standing; QST AC347 Integrates knowledge from the fields of accounting, economics, and finance to investigate current issues related to management control, financial analysis and valuation, corporate governance, and strategic cost analysis.",
        "prerequisites": "Senior standing; QST AC347"
    },
    {
        "course_code": "QST AC 469",
        "course_title": "Principles of Income Taxation I",
        "description": "Undergraduate Prerequisites: QST AC347 previous or concurrent Federal income tax law common to all taxpayers: individuals, partnerships, and corporations. Tax returns for individuals. Topics include tax accounting, income to be included and excluded in returns, tax deductions, ordinary and capital gains and losses, inventories, installment sales, depreciation, bad debts, and other losses.",
        "prerequisites": "QST AC347 previous or concurrent"
    },
    {
        "course_code": "QST AC 565",
        "course_title": "Auditing",
        "description": "Undergraduate Prerequisites: QST AC348 previous or concurrent Introduces the basic concepts underlying auditing and assurance services (including materiality, audit risk, and evidence) and demonstrates how to apply those concepts to audit and assurance services through financial statement audits. 4 cr.",
        "prerequisites": "QST AC348 previous or concurrent"
    },
    {
        "course_code": "QST AC 710",
        "course_title": "Financial Reporting and Analysis",
        "description": "Graduate Prerequisites: QST MG 730. An introduction to financial accounting and how organizations provide financial information to external users (stockholders, creditors, and analysts). The focus is on understanding the impact of business activities and accounting choices on financial statements, and analyzing financial statements to infer the business activities undertaken. Topics covered include income statement and balance sheet format, purposes, and limitations; statement of cash flows; and analysis of the impact of different business models on financial performance.",
        "prerequisites": "QST MG 730."
    },
    {
        "course_code": "QST AC 711",
        "course_title": "Financial Reporting and Control",
        "description": "An introduction to accounting, and an examination of how it helps in decision-making. Financial accounting (information needs of stockholders, creditors, and analysts) and managerial accounting (information needs of managers) are stressed equally. Topics covered include income statement and balance sheet format, purposes, and limitations; statement of cash flows; analysis of financial statements; cost behavior; use of relevant costs in decision making; budgeting; and divisional performance measurement."
    },
    {
        "course_code": "QST AC 814",
        "course_title": "Financial Statement Analysis & Investor Decisions",
        "description": "Graduate Prerequisites: QST MO712 or 713, QST AC710 or 711, QST QM716 or 717, QST MK723 or 724, QST FE711 or 722 This course is designed to develop skills in interpreting and analyzing the financial reports prepared by firms for investors and creditors. The following topics are covered: 1) analyzing profitability and risk , (2) understanding the major accounting choices affecting financial statements and managerial incentives that influence these choices, (3) assessing the quality of earnings, (4) using cash-flow based and earnings-based valuation models. The course also includes a brief review of some important accounting principles, emphasizing areas that were not covered in AC710. [Lectures, exercises, exams, and project.]",
        "prerequisites": "QST MO712 or 713, QST AC710 or 711, QST QM716 or 717, QST MK723 or 724, QST FE711 or 722"
    },
    {
        "course_code": "QST AC 830",
        "course_title": "Managerial Accounting",
        "description": "Graduate Prerequisites: QST MO712 or 713, QST PL727 or 730, QST AC710 or 711, QST QM716 or 717, QST OM725 or 726, QST MK723 or 724, QST FE711 or 722 Managerial Accounting is concerned with the use of accounting data for planning, decision-making, and control. The course is intended as an introduction for individuals who will make business decisions, evaluate business units, and evaluate others (or be evaluated) through the use of accounting systems. Topics include: (1) Understanding how costs behave and how to use costs in decision- making; (2) Understanding the nature, purpose and importance of different types of decision-useful managerial accounting information; (3) Understanding fundamental quantitative tools and techniques used to generate decision-useful managerial accounting information for both cost management and managerial control purposes; and (4) Making informed strategic and operational business decisions based on supporting managerial accounting information.",
        "prerequisites": "QST MO712 or 713, QST PL727 or 730, QST AC710 or 711, QST QM716 or 717, QST OM725 or 726, QST MK723 or 724, QST FE711 or 722"
    },
    {
        "course_code": "QST AC 831",
        "course_title": "Sustainability Reporting",
        "description": "The course addresses sustainability reporting. We will examine the evolving protocols for such disclosure: Integrated Reporting, Sustainability Accounting Standards, Greenhouse Gas Emissions, Carbon Disclosure Project, and the Global Reporting Initiative. Students will learn about the range of sustainability disclosures, develop an ability to think critically about them and gain knowledge about the challenges of implementing them."
    },
    {
        "course_code": "QST AC 847",
        "course_title": "Intermediate Accounting 1",
        "description": "Graduate Prerequisites: QST AC710 or 711 Topics covered: 1) Review of generally accepted accounting principles, especially matching concept and revenue recognition rules. 2) Consideration of balance sheet and income statement classification issues. 3) Accounting and reporting issues related to cash, accounts receivable, inventories, investments, intangibles, and plant assets.",
        "prerequisites": "QST AC710 or 711"
    },
    {
        "course_code": "QST AC 848",
        "course_title": "Intermediate Accounting 2",
        "description": "Graduate Prerequisites: QST AC 847. This course focuses on the recognition and measurement of issues in accounting related to income taxes, lease obligations, and pension liabilities and equity. It focuses further on the preparation of, and uses for, statement of cash flows; calculating, reporting, and interpreting financial measures, including earnings per share; the nature and purpose of segment and interim reporting; and accounting for changing prices. The course also provides a brief overview of the auditor's opinion.",
        "prerequisites": "QST AC 847."
    },
    {
        "course_code": "QST AC 860",
        "course_title": "Accounting Risk Management",
        "description": "The objective of this course is to provide students who have no previous accounting knowledge with the accounting tools necessary for a better understanding of a firm's fundamentals, to enable a meaningful economic assessment of the firm's risk and potential return."
    },
    {
        "course_code": "QST AC 865",
        "course_title": "Auditing Issues & Problems",
        "description": "Graduate Prerequisites: QST AC848 (previous or concurrent) Introduces the basic concepts underlying auditing and assurance services (including materiality, audit risk, and evidence) and demonstrates how to apply those concepts to audit and assurance services through financial statement audits.",
        "prerequisites": "QST AC848 (previous or concurrent)"
    },
    {
        "course_code": "QST AC 869",
        "course_title": "Principles of Income Taxation 1",
        "description": "Graduate Prerequisites: QST AC847 (previous or concurrent) Federal income tax law common to all taxpayers--individuals, partnerships, corporations. Tax returns for individuals. Topics include tax accounting, income to be included and excluded in returns, tax deductions, ordinary and capital gains and losses, inventories, installment sales, depreciation, bad debts, and other losses.",
        "prerequisites": "QST AC847 (previous or concurrent)"
    },
    {
        "course_code": "QST AC 901",
        "course_title": "Introduction to Accounting Research",
        "description": "Introduction to basic tools in financial accounting and managerial accounting research; domain of accounting research and research methods employed; using computerized databases in large sample financial accounting studies; basic managerial accounting modeling tools."
    },
    {
        "course_code": "QST AC 909",
        "course_title": "Contemporary Accounting Topics",
        "description": "This course, required of accounting doctoral students, introduces several fields of contemporary accounting research and research methodologies which are not covered in the financial accounting, managerial accounting, and research methods seminars. This seminar is also intended to provide an opportunity for students to study interdisciplinary research involving accounting."
    },
    {
        "course_code": "QST AC 918",
        "course_title": "Financial Accounting Research",
        "description": "This course, required of accounting doctoral students, covers contemporary research in financial accounting, reviewing major trends and addressing methodological issues in such research. The course emphasis is on development of skills in designing and executing research projects involving financial accounting."
    },
    {
        "course_code": "QST AC 919",
        "course_title": "Managerial and Cost Accounting",
        "description": "This course, required of accounting doctoral students, covers contemporary research in managerial accounting. We review major trends in analytical and empirical research, including agency theory. Students are required to design a research project around a managerial accounting question."
    },
    {
        "course_code": "QST AC 990",
        "course_title": "Current Topics Seminar",
        "description": "For PhD students in the Accounting department. Registered by permission only."
    },
    {
        "course_code": "QST BA 222",
        "course_title": "Modeling Business Decisions and Market Outcomes with Spreadsheets and Statistical  Programming",
        "description": "Undergraduate Prerequisites: CAS EC101, QST QM221, and QST SM131 Examines the use of economic and statistical tools for making business decisions at an advanced level, and prepares students for future study in business analytics. Introduces programming for data analysis (no previous programming knowledge required) and links data analysis to decision making using both spreadsheet modeling and statistical programming. Topics include multiple regression, causal inference, forecasting, predictive analytics, machine learning, demand modeling, and optimization. Case studies apply advanced concepts to practical business problems. Effective Spring 2021, this course fulfills a single unit in the following BU Hub area: Quantitative Reasoning II. BU Hub Learn More Quantitative Reasoning II",
        "prerequisites": "CAS EC101, QST QM221, and QST SM131",
        "BU_Hub": [
            "Quantitative Reasoning II"
        ]
    },
    {
        "course_code": "QST BA 305",
        "course_title": "Business Decision-Making with Data",
        "description": "Undergraduate Prerequisites: QST BA222, or QST QM222 and CAS CS111 Explores advanced business analytics topics, including risk and uncertainty, optimization, decision analysis, multi-attributes objective functions, and time tradeoffs. Links data models to strategy and ethics. Relies on both statistical programming and spreadsheet modeling and introduces novel techniques. Cases studies and projects apply topics to practical business problems.",
        "prerequisites": "QST BA222, or QST QM222 and CAS CS111"
    },
    {
        "course_code": "QST BA 472",
        "course_title": "Business Experiments and Causal Methods",
        "description": "Undergraduate Prerequisites: CAS CS 108 or CAS CS 111 or QST BA 222. Formerly MK472. When is making a change to a price, algorithm, or product worthwhile? Rather than relying on the gut intuition of a manager, businesses are increasingly using experiments and other forms of causal data analysis to answer these questions. In this class, we will learn about causal methods, when they work, how to implement them in R, and how to apply them to digital markets. The business topics covered include pricing, balancing digital marketplaces like Airbnb and Uber, reputation systems, measuring influence in social networks, and algorithmic design.",
        "prerequisites": "CAS CS 108 or CAS CS 111 or QST BA 222."
    },
    {
        "course_code": "QST BA 476",
        "course_title": "Machine Learning for Business Analytics",
        "description": "Undergraduate Prerequisites: CAS CS108 or CAS CS111 or QST BA222; Junior standing Formerly MK476. This course introduces students to the foundational machine learning techniques that are transforming the way we do business. Machine learning relies on interdisciplinary techniques from statistics, linear algebra, and optimization to detect structure in large volumes of data and solve prediction problems. You will gain a theoretical understanding of why the algorithms work, when they fail, and how they create value. You will also gain hands-on experience training machine learning models in Python and deriving insights and making predictions from real-world data. Prior programming experience is strongly recommended.",
        "prerequisites": "CAS CS108 or CAS CS111 or QST BA222; Junior standing"
    },
    {
        "course_code": "QST BA 775",
        "course_title": "Business Analytics Toolbox",
        "description": "This course will primarily focus on data and the key techniques that are necessary when working programmatically. Data is obtained from a data source; students will learn how to work with the most common data sources and how to load it into R. Once the data is loaded and before it can be analyzed one needs to apply a series of steps known as data munging to get a tidy and workable dataset."
    },
    {
        "course_code": "QST BA 780",
        "course_title": "Introduction to Data Analytics",
        "description": "This course focuses on data munging and the standard techniques that are necessary to work with any structured dataset. Students will learn how to work with the most common data sources and how to load them into python. Once the data is loaded and before it can be analyzed one needs to apply a series of steps known as data munging to get a tidy and workable dataset. Data munging will be the core of this course, where students will learn how to clean the data, handle missing values, perform data transformations and manipulations, and prepare it for analysis. Through learning data visualization, exploratory techniques, and summarizing methods students will become competent to perform exploratory data analysis. These techniques are typically applied before any modeling begins and can help to formulate or refine the business problem. They are also stepping stones in informing the development of more complex statistical models. The course will conclude with creating data reports and interactive dashboards, two major communication tools required in any data science project."
    },
    {
        "course_code": "QST BA 810",
        "course_title": "Supervised Machine Learning",
        "description": "The internet has become a ubiquitous channel for reaching consumers and gathering massive amounts of business-intelligence data. This course will teach students how to perform hands-on analytics on such datasets using modern supervised machine learning techniques through series a lectures and in-class exercises. Students will analyze data using the R programming language, derive actionable insights from the data, and present their findings. The goal of the course is to create an understanding of modern supervised machine learning methods, and the types of problems to which they can be applied."
    },
    {
        "course_code": "QST BA 815",
        "course_title": "Competing with Analytics",
        "description": "The objective of this class is to examine how business analytics is applied across different industries and functions, how it delivers value, which skills are core to capturing this value, and which pitfalls await organizations. The course will rely extensively on seasoned industry experts sharing their direct experiences and include readings, case study discussions, and hands-on team assignments. Rather than taking a narrow(er) focus on any one topic, the course will take a broad lens and provide a wide set of pertinent examples of application in industry (e.g. recommender systems, web analytics, personalization campaigns, pricing and revenue management, ML Ops, data storytelling, demand forecasting/sensing, inventory optimization, fraud and claims analytics, ESG modeling, managing data science projects, etc.)."
    },
    {
        "course_code": "QST BA 820",
        "course_title": "Unsupervised and Unstructured Machine Learning",
        "description": "It has been reported that as much as eighty percent of the world's data is unstructured. This course will cover the methods being applied to both unstructured and unlabeled datasets. Through a series of lectures and hands-on exercises, students will examine the techniques to unlock insights from data that appear to lack a known outcome. The goal of this course is to compare and contrast the application of various methods being applied today and provide the foundation to develop impactful insights from these datasets."
    },
    {
        "course_code": "QST BA 830",
        "course_title": "Business Experimentation and Causal Methods",
        "description": "This course teaches students how to measure impact in business situations and how to evaluate others' claims of impact. We will draw on a branch of statistics called causal inference that studies when data can be used to measure cause and effect. The course will begin by discussing randomized controlled trials, the most reliable way of measuring effects, and will move onto other methods that can be used when experiments are not feasible or unavailable. We will learn how to implement these methods in R. Causal inference has become especially important for digital businesses because they are often able to run experiments and to harness 'big data' to make decisions. We will illustrate the methods we learn with examples drawn from digital businesses such as Airbnb, Ebay, and Uber and through topic areas such as price targeting, balancing digital marketplaces, reputation systems, measuring influence in social networks, and algorithmic design. We will also use data from other business and social science applications."
    },
    {
        "course_code": "QST BA 843",
        "course_title": "Big Data Analytics for Business",
        "description": "This programming-based analytics course will cover how to perform statistical analysis of large datasets that do not fit on a single computer. We will design a Hadoop cluster on Google Cloud Platform to analyze these datasets. Utilizing Spark, Hive, and other technologies, students will write scripts to process the data, generate reports and dashboards, and incorporate common business applications. Students will learn how to use these tools through Jupyter Notebooks and experience the power of combining live code, equations, visualizations, and narrative text. Employer interest in these skills is very high. Basic programming in python, and basic analytics are prerequisite. 3 cr."
    },
    {
        "course_code": "QST BA 860",
        "course_title": "Marketing Analytics",
        "description": "This is an introductory course on Digital Marketing emphasizing analytics that seeks to familiarize students with digital marketing tactics. At the heart of marketing lies consumers and their marketing journey through the stages of awareness, intent, conversion and finally retention. In this course, we will learn how digital has revolutionized the interactions between firms and consumers along this journey. Digital offers powerful tactics to reach consumers along the funnel: online display ads raise awareness, search listings reach consumers with intent, on-site e-commerce marketing facilitate conversion, and social medial both energizes and retains customers."
    },
    {
        "course_code": "QST BA 865",
        "course_title": "Advanced Analytics Topics",
        "description": "This course will introduce you to the Python programming language and the ecosystem of software packages needed for Data Science and to build and train Neural Networks in Python, including: NumPy, Pandas, SKlearn, and PyTorch. After reviewing key Python building blocks, the course will focus on Neural Networks and Deep learning Concepts and implementation in PyTorch. This is an intensive course and the majority of it will be presented through interactive python notebooks (Google Colab)."
    },
    {
        "course_code": "QST BA 870",
        "course_title": "Financial Analytics",
        "description": "This is an introductory course on Financial Analytics providing students with knowledge about key \"financial\" concepts (financial accounting, financial statements, managerial accounting, corporate finance, and investments) so that they can intelligently apply their prior analytics knowledge and tools to real- world financial applications."
    },
    {
        "course_code": "QST BA 875",
        "course_title": "Operations and Supply Chain Analytics",
        "description": "This is an introductory course on principles, methods, and techniques used in operations and supply chain analytics. Emphasis is given on the big data age where firms are continuously designing, assessing, and improving the systems that create and deliver their products and services. Students will learn visual representation techniques to enhance their understanding of complex data and models. Such visual techniques will be paired with network analysis to better identify patterns, trends and differences from datasets across categories, space, and time. The course will also draw on real-world applications to demonstrate their use in a variety of contexts."
    },
    {
        "course_code": "QST BA 880",
        "course_title": "People Analytics",
        "description": "This course focuses on developments in People Analytics, an evolving data- driven approach to employee decisions and practices. The course covers theory, practice, and methods that are critical for addressing people- related challenges at companies, such as hiring, retaining, evaluating, rewarding performance, and managing teams and social networks, to name a few. By drawing on the latest company practices, research, and cases studies, this course will help students apply people analytics to achieve organizational objectives and to advance in their own career. We will also focus on how to apply insights to align people strategies with the organization's broader goals."
    },
    {
        "course_code": "QST BA 885",
        "course_title": "Advanced Analytics 2",
        "description": "This course covers analytics topics in applied optimization (or prescriptive analytics). In contrast to the unsupervised and supervised machine learning studied in BA820 and BA810 (and BA865) where the focus was to discover patterns and predict uncertain events, this course focuses on determining the best course of action given an objective and a set of constraints. In other words, making operational and strategic decisions using a rigorous and principled approach. The methods learned in this course have broad application including in logistics, marketing, health care, finance, and more. Example problems include determining which products to advertise to which customer to maximize sales, identifying best location of warehouses to best serve geographically dispersed stores or customers, and allocating medical resources to health care facilities to minimize the fallout during an active pandemic. Topics include linear programming, integer programming, network models, and related methods. Students will learn how to set up such optimization problems and solve them using spreadsheets and Python."
    },
    {
        "course_code": "QST BA 888",
        "course_title": "Capstone Project",
        "description": "The capstone project course will allow students to work on a data project in a team setting. The goal is for the students to solve a real-world problem using the knowledge, tools, and techniques acquired throughout the program and show their skills to potential employers. This course spans across the degree program and requires multi-semester efforts, however, the vast majority of the work will be done during the spring semester. The final product will be presented to a faculty panel at the end of the spring semester, followed by a poster session which will be open to the public."
    },
    {
        "course_code": "QST BA 890",
        "course_title": "Analytics Practicum",
        "description": "The analytics practicum provides an opportunity for students to gain individual, practical experience related to business analytics. Students will complete a report based on one of the following: - Reflection paper related to an internship experience: Students will describe work accomplished and knowledge gained from working on a part-time or full-time internship in an area directly related to Business Analytics (e.g., data engineering, data analysis, data modeling, machine learning, data visualization). The paper should demonstrate the student's knowledge of Business Analytics concepts acquired through the internship experience. - Research Project: Students will select a topic related to Business Analytics which has not been covered in existing coursework or significantly extends concepts taught in the MSBA curriculum. The research topic can be novel or can be an extension of work completed during the capstone project. It should be substantive enough in terms of technical, quantitative, data management, or programming aspects and contain appropriate references. Students should not merely compile work of others, but also display genuine critical thinking."
    },
    {
        "course_code": "QST DS 850",
        "course_title": "Management Internship",
        "description": "This course is designed to accommodate students interning with an organization that requires that they receive credit for the internship experience."
    },
    {
        "course_code": "QST DS 906",
        "course_title": "Fundamentals of Research and the Philosophies of Science (previously MK912)",
        "description": "This course introduces students to research. The class provides a brief introduction to the philosophy of science and debates about the nature of theory before diving thoroughly into different research methods. Students are exposed to research methods from their own and adjacent fields ranging from causal inference and experiments to qualitative research methods. The last part of the class introduces students to issues around diversity, ethics, and equity in research. As part of the class students will complete the introductory ethics modules that are required by the university. Students will be graded on their class participation, a research proposal which is due at the end of the class, and their feedback to other students on their research proposals."
    },
    {
        "course_code": "QST DS 911",
        "course_title": "Seminar in Macro Organizational Theory",
        "description": "This doctoral-level course is an introduction to the major theoretical approaches and ongoing debates in organizational theory, an inter- disciplinary subject area that draws on several traditions, including economics, political science, psychology, and sociology. Organization theory aims to explain the origins, persistence, and disappearance of the organizations that are central to our society and daily life (e.g., firms, markets, governments, occupations, non-profit organizations, and more). We will start with the classics and then trace the history of ideas as the field has evolved to its present state. The purpose of this course is to provide a roadmap to navigate the terrain of organizational theory and guide students as they generate original research ideas. (Cross-listed as GRS SO716)."
    },
    {
        "course_code": "QST DS 913",
        "course_title": "Experimental Design and Methods",
        "description": "This course provides an introduction to research methodology applicable to marketing and other related fields. The course will survey the major research methodologies used in marketing and social psychology, and will focus on both theoretical and practical considerations of research methods. This is not a statistics course (though an introduction to basic principles is part of the course). The purpose of the course is to give students the background to choose the methods that are most appropriate for their area of study, helping them to anticipate the shortcomings and problems they will encounter executing their chosen methodologies, and to defend their methodological choices against criticism in their interactions with investigators from allied and not-so-allied disciplines."
    },
    {
        "course_code": "QST DS 919",
        "course_title": "Machine Learning Method for Social Science Research",
        "description": "This course aims to introduce PhD students in Management to Machine Learning methods with an emphasis on their application in social science research. The first half of the course discusses popular predictive models (regression models, SVM, tree-based methods, etc) and related concepts. The second half discusses graphical models to develop and estimate probabilistic models. The course will have a set of programming/estimation assignments based on recent relevant papers and one final exam. By the end of the course, students will be equipped to spot a machine learning problem in their line of research, specify a model for it, and estimate and evaluate it."
    },
    {
        "course_code": "QST DS 921",
        "course_title": "Behavioral Science Writing Seminar",
        "description": null
    },
    {
        "course_code": "QST DS 925",
        "course_title": "Methods for Causal Inference in Strategy Research",
        "description": "(Formerly SI 915) This course reviews tools and methods for drawing causal inferences from non-experimental data. The class emphasizes conceptual difficulties associated with establishing causality in observational settings, the strengths and weaknesses of statistical methods based on so-called natural experiments, and the practical problems that arise in the application of these tools. This course is designed to complement a traditional two-semester graduate sequence in econometrics."
    },
    {
        "course_code": "QST DS 929",
        "course_title": "Analytical Modeling for Business Research",
        "description": "This course is designed to provide doctoral students in a business school with an introduction to analytical models so that they can access the theoretical literature and potentially develop new models for their own research. The course will introduce basic concepts in game theory (e.g., Nash Equilibrium, Perfect Bayesian Equilibrium) and classic models in industrial organization (e.g., pricing, distribution, competition, product differentiation, advertising) and behavioral economics (e.g., prospect theory, hyperbolic discounting). Students need to be comfortable with calculus and basic probability theory."
    },
    {
        "course_code": "QST DS 999",
        "course_title": "Doctoral Dissertation Study",
        "description": "This 2-credit course is a requirement to maintain doctoral student status during the completion of your Comprehensive Exam, Dissertation Proposal Defense and ultimately, Dissertation Defense. Each department has its own section which are as follows: Accounting (A1); Finance/Economics (B1); Information Systems (C1); Strategy and Innovation (D1); Marketing (E1); Operations and Technology Management (F1); Management & Organizations (G1); and Mathematical Finance (M1)."
    },
    {
        "course_code": "QST ES 090",
        "course_title": "Ascend Seminar",
        "description": "The Ascend Seminar is designed to engage Questrom Ascend students in their own career exploration and development through company/industry exposure as well as timely professional development, leadership, and topics related to student success. Using the core values of a Questrom School of Business education as a foundation, the course will focus on preparing for a meaningful career and life, as well as building a professional network and community of Questrom students, faculty, staff, alumni, and corporate partners. This course is open only to those students who formally participate in the Questrom Ascend Fellowship."
    },
    {
        "course_code": "QST ES 110",
        "course_title": "Explore Your Career",
        "description": "Questrom freshmen only. Required for all Questrom freshmen. This is the first in a series of required Questrom career management and skills development courses designed to equip students with the knowledge, tools, and skills needed to explore career opportunities and build their career management capabilities. This first year class will focus on career exploration within the broader context and scope of business careers. Students will explore personal values, interests, and skills as the foundation for career management. They will learn skills for exploring traditional and emerging industries, organizations, and occupations that align with their business and career aspirations. They will learn and apply basic career search tools and techniques as they begin their careers as Questrom students."
    },
    {
        "course_code": "QST ES 210",
        "course_title": "Build Your Career Toolkit",
        "description": "Undergraduate Prerequisites: QST ES110 Builds upon ES110 to provide students with fundamental tools to assist them with individual career management. It is the second course in the Questrom's four year career management curriculum. Importantly, as sophomores, students will begin to chart their career path, work with The Feld Career Center (FCC), practice interviewing, develop a search strategy, and continue to build their personal \"brand.\" 1 cr.",
        "prerequisites": "QST ES110"
    },
    {
        "course_code": "QST ES 215",
        "course_title": "Explore Your Career and Build Your Toolkit",
        "description": "Undergraduate Prerequisites: Sophomore standing. For Questrom students only, and CGS students intending to continue to Questrom. Combines the content of ES110 and ES210. This is the first required Questrom career management and skills development course for students in their first semester as Questrom students who have not taken ES110. The course is designed to equip students with the knowledge, tools, and skills needed to explore career opportunities and build their career management capabilities. This course focuses on career exploration within the broader context and scope of business careers. Students will explore personal values, interests, and skills as the foundation for career management. They will learn skills for exploring traditional and emerging industries, organizations, and occupations that align with their business and career aspirations. They will learn and apply basic career search tools and techniques, craft a strong resume and cover letter, develop a search strategy, practice interviewing and informational conversations, and begin to network with Questrom students and alumni.",
        "prerequisites": "Sophomore standing. For Questrom students only, and CGS students intending to continue to Questrom."
    },
    {
        "course_code": "QST ES 310",
        "course_title": "Implement Your Career Plan",
        "description": "Undergraduate Prerequisites: QST ES210 or QST ES215 Questrom students only. Prerequisite: ES210 or ES215; Junior (or Senior) standing. Required for all Questrom students who have completed ES210 or ES215, followed by a full semester of additional work and academic experiences. This final course in the Questrom School of Business's progression of career courses is delivered in a series of intensive workshop- style classes and required out-of-class application assignments that are designed to help students hone their skills and execute their targeted search strategy to gain career-building internships and offers of employment. Students will enhance their toolkit, implement their career and internship search process, and learn about onboarding into a new internship or full-time job. The course focuses on building networking skills, enhancing interviewing skills for targeted industries, exploring global and ethical perspectives, accepting and negotiating job offers, onboarding, and building and maintaining a Questrom Career Community. Designated sections of this course will have a specific focus on addressing the unique career planning challenges and needs of international students and/or those seeking global careers.",
        "prerequisites": "QST ES210 or QST ES215"
    },
    {
        "course_code": "QST ES 710",
        "course_title": "Teaming",
        "description": "This course introduces the challenges of leading and participating in teams and project groups. It emphasizes the roles of team members and leaders, how to motivate within a team environment, and how to create an environment in which teams and their embers increase their capabilities. This course also provides support for students as they work on program projects and helps students to gain both knowledge of team dynamics and the skills to shape them."
    },
    {
        "course_code": "QST ES 720",
        "course_title": "Management Communication",
        "description": "Effective communication skills are key to the success of any manager or executive as you persuade, inform, and lead your clients, colleagues, bosses, and subordinates. This course explores persuasive verbal and written communication in a variety of management settings, including formal meeting-style presentations as well as strategic written business documents. You will learn to assess your audience, understand the strategic choices available when communicating, and choose the correct strategy for the audience at a given time. Students will learn to construct a persuasive argument and to deconstruct arguments made by others, recognizing and avoiding reasoning flaws. Students will give planned and impromptu presentations that are organized logically and persuasively, and that reflect best practices in using visual aids. Students will also learn best practices in business writing, for example, in writing memos and substantive emails."
    },
    {
        "course_code": "QST ES 723",
        "course_title": "Career Management",
        "description": "This three-semester professional development course series is designed to assist students in transforming interests into professional goals, and these goals into an MBA level, candidate-driven internship and job search. The Career Management course integrates a set of complementary resources and activities: self- assessment, career management tools, skill building opportunities, and active involvement in a career development team. The course will help students to determine professional goals; develop and implement a plan for achieving them; acquire the specific skills and experiences needed to become market ready; build a personal brand and professional network. A requirement of the course in the second year is the completion of a presentation on the student's summer internship after the first year."
    },
    {
        "course_code": "QST ES 730",
        "course_title": "Leadership Communication",
        "description": "Persuasion is an essential skill for business success. Whether the goal is to influence and motivate your colleagues, superiors, organization, clients, or broader stakeholders, the capacity to persuade diverse audiences is key to effective leadership. In this course, students will learn to create and deliver compelling, high-impact verbal and written communications that inspire action. Students will learn to: generate insights with meaningful conclusions and recommendations; apply the principles of logical reasoning to create a compelling narrative; develop their unique leadership style to connect authentically to the audience; express complex information clearly and concisely in writing and with visual aids; and master presentation delivery, including projecting power through body language. We will cover a range of situations, from communicating within an organization, to winning over the public in a time of crisis, to holding crucial conversations to resolve conflicts."
    },
    {
        "course_code": "QST ES 735",
        "course_title": "Team Coaching",
        "description": "The ability to work with and develop teams is considered one of the most essential skill sets for the 21st century workplace. This course focuses the role of coaching on both an individual and team level in order to develop the skills needed to work effectively in teams. Course activities and learning objectives are integrated and aligned with other academic courses to deepen and enrich the MBA student learning experience by developing their abilities to coach each other in collaborative environments."
    },
    {
        "course_code": "QST ES 740",
        "course_title": "Leadership Communication",
        "description": "Persuasion is an essential skill for business success. Whether the goal is to influence and motivate your colleagues, superiors, organization, clients, or broader stakeholders, the capacity to persuade diverse audiences is key to effective leadership. In this course, students will learn to create and deliver compelling, high-impact verbal and written communications that inspire action. Students will learn to: generate insights with meaningful conclusions and recommendations; apply the principles of logical reasoning to create a compelling narrative; develop their unique leadership style to connect authentically to the audience; express complex information clearly and concisely in writing and with visual aids; and master presentation delivery, including projecting power through body language. We will cover a range of situations, from communicating within an organization, to winning over the public in a time of crisis, to holding crucial conversations to resolve conflicts."
    },
    {
        "course_code": "QST ES 872",
        "course_title": "Entrepreneur's Communication Playbook",
        "description": "Graduate Prerequisites: ES700, ES701,ES730, or ES740 Persuasion pervades every crevice of successful entrepreneurial lives. This course will prepare entrepreneurs to consider their multiple constituents as they communicate a vision and build an enduring company. As a company-builder and innovator, your persuasion begins with a clarity of purpose. You must attract top talent, convince customers, get colleagues on board with your ideas, and persuade investors to fund your company. Thinking critically, challenging conventional wisdom, and communicating effectively are vital to your success.",
        "prerequisites": "ES700, ES701,ES730, or ES740"
    },
    {
        "course_code": "QST FE 200",
        "course_title": "Principles of Finance",
        "description": "Undergraduate Prerequisites: QST SM132; and QST AC221. Open only to non-Questrom students Formerly SM104. Finance elective for Business minors. The course is designed to continue the student experiences from SM132 and AC221. The course will provide students with an overview of a broad range of financial topics including: personal financial decision making, corporate finance, firm valuation, portfolio management, risk and return, as well as a timely discussion of current events. Upon successful completion of the course students will understand how to navigate personal finances including car loans, student debt, mortgages, retirement planning, and stock and bond investments; become familiar with methods of firm valuation, including discounted cash flow and trading multiples; be introduced to portfolio management theories such as diversification, systematic risk and beta and how to understand the risk reward tradeoff.",
        "prerequisites": "QST SM132; and QST AC221. Open only to non-Questrom students"
    },
    {
        "course_code": "QST FE 323",
        "course_title": "Introduction to Corporate Finance",
        "description": "Undergraduate Prerequisites: QST AC221; MO221; QM221; QM222 or BA222; SM131; SM132; SM275 Component of QST SM323, The Cross Functional Core. Introduces students to the themes of financial decision making: valuation and risk management. The focus is on the problems of forecasting, capital budgeting, working capital management, project risk management, and financing in a cross-functional context. A semester-long business-plan project explores the interaction between marketing, operations, management information systems, and finance decisions. The course compares the financial objectives of the manager and the investor. Introduction to the time value of money, securities valuation, portfolio diversification, and the cost of capital. 4 cr.",
        "prerequisites": "QST AC221; MO221; QM221; QM222 or BA222; SM131; SM132; SM275"
    },
    {
        "course_code": "QST FE 342",
        "course_title": "Money, Financial Markets, and Economic Activity",
        "description": "Undergraduate Prerequisites: QST SM132 and sophomore standing The financial system and its functions. The role of money and the importance of interest rates in determining economic activity; determinants of level of interest rates. Operation of central banks; the goals and instruments of monetary policy. The roles, activities, and risk management of financial institutions. Instruments traded in money and capital markets, and their valuation. Role of derivative securities; systemic risk and other contemporary issues in the financial system.",
        "prerequisites": "QST SM132 and sophomore standing"
    },
    {
        "course_code": "QST FE 427",
        "course_title": "International Financial Management",
        "description": "Undergraduate Prerequisites: QST FE 445 or QST FE 449. Managing financial risk in the global environment. Introduction to foreign exchange markets, spot, forward, futures, options and swaps, and to the international bond and money markets. Discussion of market structure and participants, and main financial instruments. Analyzes and discusses tools of currency risk management. 4 cr.",
        "prerequisites": "QST FE 445 or QST FE 449."
    },
    {
        "course_code": "QST FE 429",
        "course_title": "Futures, Options, and Financial Risk Management",
        "description": "Undergraduate Prerequisites: QST FE 445. Covers the theory of futures pricing and option pricing, and applies the theory to develop a framework for analyzing hedging and investment decisions using futures and options. Attention is paid to practical considerations in the use of these instruments, especially in financial risk management. 4 cr.",
        "prerequisites": "QST FE 445."
    },
    {
        "course_code": "QST FE 430",
        "course_title": "Entertainment Finance",
        "description": "Undergraduate Prerequisites: QST FE 323. Examines financial structures and decisions in entertainment and media realms including feature film, television, music, live performance, sports, digital media, and related business endeavors. The course covers the various ways entertainment and media companies raise capital, budget capital, and manage return on investment to shareholders and other stakeholders. Students study business models within each segment to understand the financial, operational, and legal constraints and best practices under which media and entertainment firms operate. Offered in Los Angeles.",
        "prerequisites": "QST FE 323."
    },
    {
        "course_code": "QST FE 433",
        "course_title": "ESG Investing",
        "description": "Undergraduate Prerequisites: QST FE 323. The aim of this course is to analyze and illustrate what investors can do to grasp the environmental and social challenges (i) by redirecting financial flows towards projects supporting and strengthening sustainable development, as well as (ii) controlling and mitigating the ESG-related financial risks. This transformation of financial markets requires an understanding of (i) the assets available for financing sustainable development, (ii) the metrics currently used to estimate the ESG impact of investments, (iii) the practices adopted by the most sophisticated sustainable investors, and (iv) the supporting capacity of public institutions, such as central banks in particular.",
        "prerequisites": "QST FE 323."
    },
    {
        "course_code": "QST FE 445",
        "course_title": "Investment Analysis and Portfolio Management",
        "description": "Undergraduate Prerequisites: QST FE 323. Required for Finance concentrators. Introduction to the investment management process. Defining investment objectives and constraints. Introduction to Modern Portfolio Theory, CAPM, APT, Efficient Markets, stock and bond valuation models. Introduction to forwards and swaps and their applications within investment strategies. Active vs. passive investment strategies, fundamental vs. technical analysis, trading practices, and performance evaluation. Introduction to the role of futures and options in hedging and speculation. Students are expected to become familiar with current events in the financial news.",
        "prerequisites": "QST FE 323."
    },
    {
        "course_code": "QST FE 449",
        "course_title": "Corporate Financial Management",
        "description": "Undergraduate Prerequisites: QST FE 323. Required for Finance concentrators. Covers the financial manager's role in obtaining and allocating funds. Includes topics such as cash budgeting, working capital analysis, dividend policy, capital investment analysis and debt policy as well as their associated risks. Valuation of companies, mergers and acquisitions, and bankruptcy are covered. The course requires using financial models and spreadsheets. Applications are made to current events and everyday business finance problems.",
        "prerequisites": "QST FE 323."
    },
    {
        "course_code": "QST FE 454",
        "course_title": "Investment Banking",
        "description": "Undergraduate Prerequisites: QST FE 449. Provides an overview of the economic functions provided by investment banks including a history of the industry, current events, and the difference between large, full service investment banks and smaller, boutique firms. Heavy emphasis on pro forma analysis and Initial Public Offering and M&A valuation techniques. Topics include: What do investment bankers do? What are the different types of analyses performed by investment bankers? What are the various types of financial securities? What is the underwriting process and how are securities priced? How are companies valued? How are potential synergies valued? The course will focus on the issuing process and pricing for equity, fixed income, and equity-linked securities. The course will also focus on the role of investment banks in mergers, acquisitions, divestitures, and other restructurings. Additional topics include equity research, capital markets industry regulations, as well as typical career paths and opportunities.",
        "prerequisites": "QST FE 449."
    },
    {
        "course_code": "QST FE 455",
        "course_title": "Financing New Ventures",
        "description": "Undergraduate Prerequisites: QST FE 323. Students will be expected to have mastered key finance concepts including financial statement analysis, NPV, IRR and basic option pricing theory prior to entering the course. Introduction to financing sources for start-up firms, including angel funding, venture capital financing, boot-strapping, debt and other sources. Focus on capital structure analysis, capitalization tables, payoff diagrams, term sheets, equity incentives, cash flow projections and negotiating with investors. Students are expected to prepare case studies for class discussion and become familiar with current events in the financial news about start-up company financings.",
        "prerequisites": "QST FE 323."
    },
    {
        "course_code": "QST FE 456",
        "course_title": "Fixed Income Analysis",
        "description": "Undergraduate Prerequisites: QST FE 445. Covers the analytic techniques used in fixed-income markets to value and measure risk on traditional fixed-rate bonds, floating-rate notes, bonds having embedded options (callable and putable bonds), structured notes, and interest rate derivatives used to manage bond portfolios (primarily interest rate swaps, caps, and floors). Extensive use is made of Excel spreadsheet analysis, including the development of a binomial term structure model to value securities. Focus is on the impact of counterparty and issuer credit risk in fixed-income valuation.",
        "prerequisites": "QST FE 445."
    },
    {
        "course_code": "QST FE 458",
        "course_title": "Equities and Securities Analysis",
        "description": "Undergraduate Prerequisites: QST FE 323. Students will be taught the fundamental skills in how to analyze a company and determine its suitability for investment. This course will teach the value-based approach to company analysis, which focuses on assessing a company's competitive advantage and its return profile. Key topics include competitive advantage, return on invested capital, financial modeling and financial statement analysis, and valuation.",
        "prerequisites": "QST FE 323."
    },
    {
        "course_code": "QST FE 459",
        "course_title": "Computational Techniques for Finance",
        "description": "Undergraduate Prerequisites: CAS CS108 or CS111; QST FE445 The course will teach students how to use computational techniques to implement financial algorithms for security pricing and risk analysis including, bonds, stocks, and options. This will be a rigorous, hands-on programming course to prepare students for quantitative jobs in finance. The overall objective of the course is to enhance the students' understanding of the well-known financial models used to price securities including bonds and options and to evaluate the risk and return characteristics of stocks and portfolios. After the course, students will have a deeper understanding of investment portfolios, risk management techniques that use derivatives, and arbitrage strategies. Additionally, students will become comfortable with a modern programming language based on functional and object-oriented programming which will enhance their job opportunities in a variety of fields beyond finance.",
        "prerequisites": "CAS CS108 or CS111; QST FE445"
    },
    {
        "course_code": "QST FE 460",
        "course_title": "Equity Analysis for Strategic Decision Making",
        "description": "Undergraduate Prerequisites: QST FE 323. This course is specifically designed to appeal to students who have a strong interest in both strategy and financial analysis. The focus of the class will be to bring financial analysis to the study of a company's strategy and learn how to analyze a company's financial statements to help evaluate the sustainability of a company's competitive advantage. This course utilizes that case-based approach in its teaching method and encourages active class participation.",
        "prerequisites": "QST FE 323."
    },
    {
        "course_code": "QST FE 469",
        "course_title": "Real Estate Finance",
        "description": "Undergraduate Prerequisites: QST FE 323. Provides an introduction to and an understanding of real estate finance. Draws together and considers major functional areas including: structuring, ownership, finance, taxation, property valuation and analysis. The course provides a framework for decision making in the real estate investment and finance fields. The course is specifically designed to offer students interested in real estate careers a foundation from which to build. 4 cr.",
        "prerequisites": "QST FE 323."
    },
    {
        "course_code": "QST FE 711",
        "course_title": "Finance 1",
        "description": "This course begins by briefly introducing students to some fundamental concepts in financial theory, including the separation of investment, cash flow and consumption decisions for firms; the time-value of money, net present value, and the associated impetus towards value-based decision making; as well as arbitrage and the law of one price, and the idea of efficient markets. Students will then dig deeper into the mechanics of discounting, compounding, and calculating free cash flows, giving them tools to make value-based decisions about whether to undertake or cancel a project within a firm; value a share, or acquire a company, using a given discount rate."
    },
    {
        "course_code": "QST FE 712",
        "course_title": "Finance 2",
        "description": "Graduate Prerequisites: QST FE 711. The course begins with a brief introduction to some basic financial securities (stocks and bonds) and how to calculate their risks, returns, and correlations. We will then study the capital asset pricing model (CAPM) of asset pricing model, a theory setting out the required returns on financial assets, and its implications for how to invest in financial markets. We will use the CAPM to derive a required return on investment, which we will then use as to calculate a weighted average cost of capital (WACC), which will be the discount rate used to assess the net present value of business investments. The WACC can be used to find the present discounted value of a firm, or of a potential acquisition, as well as to determine the net present value (NPV) of a project under consideration for investment by a firm. The course will finish with a case study valuation of one such project or acquisition, using knowledge on the calculation of free cash flows from FE711 and of the calculation of the discount rate from FE712.",
        "prerequisites": "QST FE 711."
    },
    {
        "course_code": "QST FE 713",
        "course_title": "Finance 3",
        "description": "Graduate Prerequisites: QST FE 712. This course extends students' understanding of corporate valuation beyond that acquired by allowing for valuing firms with different capital structures (e.g., what happens to valuation when a firm levers up?). This practical knowledge is built upon an analytical framework about the costs and benefits of different forms of financing (debt, equity, hybrid securities) in different industries, time periods, and circumstances. When should firms use debt financing, and when equity? What is the impact of paying dividends; when should dividends be preferred to share buybacks, and when should cash be retained in the firm rather than paid out? This course will give students an insight into the answers to these and similar questions.",
        "prerequisites": "QST FE 712."
    },
    {
        "course_code": "QST FE 722",
        "course_title": "Financial Management",
        "description": "Graduate Prerequisites: QST MO712 or MO713, QST AC710 or AC711 (previous or concurrent) The objective of this course is to introduce the students to the theory and practice of corporate finance, and to provide the students with a set of analytical tools necessary to answer the most important questions related to firms' valuation and investment decision making first under certainty and then under uncertainty. The course can be divided into the following three building blocks: valuation, investment decisions, and the relation between risk and return.",
        "prerequisites": "QST MO712 or MO713, QST AC710 or AC711 (previous or concurrent)"
    },
    {
        "course_code": "QST FE 820",
        "course_title": "Corporate Financial Management",
        "description": "Graduate Prerequisites: QST FE 712 or QST FE 722. This course provides an in-depth analysis of financial considerations relating to corporate growth. It addresses the setting of financial and corporate goals in terms of maximizing shareholder wealth and relationships among working capital, debt levels, capital costs, dividend policy, growth and the value of the firm. It also considers the requisite financial analysis associated with mergers and acquisitions and bankruptcy.",
        "prerequisites": "QST FE 712 or QST FE 722."
    },
    {
        "course_code": "QST FE 822",
        "course_title": "Fixed Income Markets",
        "description": "Graduate Prerequisites: QST FE 712 or QST FE 722. This is a course primarily on fixed-income debt securities and markets. Emphasis is placed on the factors that determine bond yields, factors such as the coupon and maturity structure, liquidity, credit risk, and tax status of the security, and on measures of return and risk, statistics such as the yield to maturity, horizon yield, duration, and convexity. We will cover government debt (Treasuries and municipals), corporate bonds (investment-grade and high-yield), agency (Fannie Mae and Freddie Mac) and mortgage-backed debt created via securitization (i.e., collateralized mortgage obligations). We will emphasize how interest rate and credit derivatives are used to manage portfolios of fixed-income securities.",
        "prerequisites": "QST FE 712 or QST FE 722."
    },
    {
        "course_code": "QST FE 823",
        "course_title": "Investments",
        "description": "Graduate Prerequisites: QST FE 712 or QST FE 722. Introduction to the investment management process. Defining investment objectives and constraints. Introduction to Modern Portfolio Theory, CAPM, Fama- French factors, APT, efficient markets, stock, bond and option valuation models. Introduction to forwards and swaps and their applications within investment strategies. Active and passive investment strategies, fundamental analysis, trading practices, and performance evaluation. Introduction to the role of futures and options in hedging and speculation. Arbitrage and hedge fund strategies. Understanding the assumptions underlying the different approaches and their limitations. Topics related to current events and the recent financial crisis.",
        "prerequisites": "QST FE 712 or QST FE 722."
    },
    {
        "course_code": "QST FE 833",
        "course_title": "ESG Equity Investing",
        "description": "ESG Equity Investing is an introductory course that provides the appropriate tools to analyze and undertake investments in publicly listed companies taking into account the social impact of these financial decisions. Different dimensions of social impact -- Environment, Social, and Governance -- are discussed along with corresponding ESG metrics available to investors. The core of the course deals with the integration of (quantitative-based) portfolio allocation models with (qualitative-based) ESG scores and objectives. The course also discusses how impact investing may affect the behavior of firms, as well as alternative channels through which investors can provide impact (private investments, activism)."
    },
    {
        "course_code": "QST FE 854",
        "course_title": "Entrepreneurial Finance",
        "description": "Graduate Prerequisites: QST AC710 or AC711, QST FE712 or FE722 The focus of FE854 is on the development of financial and business skills to identify, evaluate, start and manage new ventures. A comprehensive understanding of finance is an essential ingredient in the \"recipe\" for business success. No longer can the assumptions underlying financial projections be treated as \"black boxes.\" In many cases, the answer is less important than the analytical process used to calculate it. Readings for the course will primarily be in the form of case studies, and will be supplemented by guest speakers, presentations, and readings from academia and industry.",
        "prerequisites": "QST AC710 or AC711, QST FE712 or FE722"
    },
    {
        "course_code": "QST FE 870",
        "course_title": "Analysis and Management of Financial Risk",
        "description": "Graduate Prerequisites: QST FE 712 or QST FE 722. This course introduces the analysis and management of risk in the context of financial institutions. The objective of the course is to provide a conceptual framework for thinking about financial risk, covering both theoretical background and practical implementation",
        "prerequisites": "QST FE 712 or QST FE 722."
    },
    {
        "course_code": "QST FE 918",
        "course_title": "Doctoral Seminar in Finance",
        "description": "This doctoral course, is designed to provide students with an introduction to financial economics. This lecture-based course will cover no arbitrage conditions, preferences and risk aversion, portfolio selection, the capital asset pricing model, asset pricing and dynamic asset pricing. In addition to lectures, this class will include readings and assignments. Open to MBA students with faculty member's permission. Must have strong quantitative background and several courses in finance or economics."
    },
    {
        "course_code": "QST FE 920",
        "course_title": "Advanced Capital Markets",
        "description": "This course provides a comprehensive and in-depth treatment of modern asset pricing theories. Extensive use is made of continuous time stochastic processes, stochastic calculus and optimal control. In particular, martingale methods are employed to address the following topics: (i) optimal consumption- portfolio policies and (ii) asset pricing in general equilibrium models. Advances involving non-separable preferences, incomplete information and agent diversity will be discussed."
    },
    {
        "course_code": "QST FE 990",
        "course_title": "Current Topics Seminar",
        "description": "For PhD students in the Finance department. Registered by permission only."
    },
    {
        "course_code": "QST HF 999",
        "course_title": "Humphrey Seminr",
        "description": null
    },
    {
        "course_code": "QST HM 703",
        "course_title": "Health Sector Issues and Opportunities",
        "description": "This course provides a dynamic introduction to the health sector, beginning with the burden and distribution of disease and current patterns of expenditures. While the emphasis will be on the American system, a global context will be developed. The basic elements of insurance and payment, service delivery, and life sciences products will be described, and put in the context of the unique economic structure of the sector. The intense challenges of the sector will be explored, as well as both the ethical issues presented and the opportunities that emerge. Public policy and technological and practice development as drivers of change will be addressed throughout."
    },
    {
        "course_code": "QST HM 817",
        "course_title": "Advances in Digital Health",
        "description": "Digital technologies are fundamentally transforming the health sector. Health information technology now permeate every segment of the health value chain, starting with the search for health information, to improving patient outcomes, to improving health. In this course students explore the evolving digital health landscape through a mix of case studies, practitioner talks, individual papers and team projects. Students will enhance their digital health requirements and systems selection toolbox. They will develop competence in current digital health technology standards, gain a deeper understanding of the strategic drivers of digital health through the eyes of the healthcare CIO and CMIO, the operational challenges from the perspective of the end user and the healthcare providers, and challenges of incorporating digital health technologies into existing workflows."
    },
    {
        "course_code": "QST HM 820",
        "course_title": "Strategy, Economics, and Policy in the Health Sector",
        "description": "Graduate Prerequisites: QST PL 727 or QST PL 730. This course studies the strategic and economic issues facing insurers, providers, and life-sciences companies in the healthcare sector. The course will adapt tools from health economics, strategy, and finance to understand the problems faced by these firms. The course will also examine the problems faced by regulators, who must craft policies that shape the healthcare sector: which hospital mergers to allow; what procedures health insurers must cover; how public programs ought to reimburse life-sciences companies; how quality of care is measured and rewarded; and so on.",
        "prerequisites": "QST PL 727 or QST PL 730."
    },
    {
        "course_code": "QST HM 833",
        "course_title": "Health Sector Marketing",
        "description": "Graduate Prerequisites: QST HM703, and QST MK723 or MK724 This course provides an understanding of health sector marketing for health care services delivery (e.g., health systems, independent hospitals, hospices, pharmacies), for private business (e.g., life sciences, pharma, and biotech), and for insurance (e.g., commercial insurance and government). The course explores marketing insights and marketing strategies in the context of the evolving health sector. Topics addressed include the marketing of health care services by providers, insurance product marketing, marketing to physicians, new product development, particularly for pharmaceuticals and medical devices, and consumer adoption of medical and service innovations. The course will build students' knowledge of the unique challenges of health sector marketing and will build facility with applying the principles of marketing to situations across this vast landscape.",
        "prerequisites": "QST HM703, and QST MK723 or MK724"
    },
    {
        "course_code": "QST HM 840",
        "course_title": "Health Sector Consulting",
        "description": "This is an applied consulting project course that aims to develop reflexive practitioners who can elicit client requirements, translate requirements into a problem statement and develop actionable solutions that meet client needs. The course uses a mix of case studies, individual memos and team project deliverables to systematically apply skills developed over the course of the MBA to solve real-world health sector problems. Students work on the consulting assignment in teams of up to four students based on having a shared interest in a prospective consulting project. These projects are curated in partnership with sponsor organizations to be executable within the framework of an academic semester. Projects in the past have ranged from improving the departmental revenue cycle within an academic medical center, developing an international pricing strategy for the introduction of a new product by a pharmaceutical company, to improving safety culture at a large hospital. These projects all have active involvement of the project sponsors who provide access to their organizations and provide ongoing feedback over the lifecycle of the consulting engagement."
    },
    {
        "course_code": "QST HM 848",
        "course_title": "Driving Health Sector Innovation",
        "description": "This course examines an array of compelling opportunities for innovation, incremental and disruptive, across products and services, created within existing organizations or by starting new businesses. It bridges design and implementation, examining the unique and complex array of elements that make successful innovation in the health sector so difficult, and developing the skills and knowledge needed to effectively address those challenges. The course provides a conceptual framework, and then emphasizes hands-on engagement, concrete exercises, written cases, and in-class speakers who are engaged in real-world innovation initiatives. Students will have the opportunity to focus on areas of particular interest and relevance to current or future work. They will leave better equipped to drive or support the viable, value-creating innovation so desperately needed in the health sector."
    },
    {
        "course_code": "QST IM 345",
        "course_title": "Global Business Environment",
        "description": "Undergraduate Prerequisites: CAS EC101, CAS EC102, and junior standing. Required for International Management concentrators. Deals with international economic theories and explores the intersection between theory and practice. Determinants of international trade and payments: international trade theory and policy and balance-of-payments accounting. Explores the implications of trade-promoting and trade-inhibiting institutions and practices: WTO, NAFTA, European Union, etc. Introduces cultural, political, and demographic issues for international managers. 4 cr.",
        "prerequisites": "CAS EC101, CAS EC102, and junior standing."
    },
    {
        "course_code": "QST IM 430",
        "course_title": "Managing in a Global Environment",
        "description": "Course description TBD"
    },
    {
        "course_code": "QST IM 445",
        "course_title": "Multinational Management",
        "description": "Undergraduate Prerequisites: CAS EC101; CAS EC102; QST IM345 or QST FE427 or CAS EC392 or CAS IR292 or equivalent for non-Questrom students (may be taken concurrently) This is heavily case-based course studying the business strategies of multi- national enterprises, particularly in high-growth and developing economies. Having worldwide operations not only gives companies access to new markets and diverse resources, it also opens up new sources of information and knowledge that stimulate innovation and operational strategies. Along with opportunities, we also look at the challenges to a more complex, diverse, and uncertain business than those faced by companies who focus primarily in their mature markets or even their own country. This course helps students to acquire skills and perspectives that will help them as they pursue careers with multi-national companies or other opportunities in the global business environment.",
        "prerequisites": "CAS EC101; CAS EC102; QST IM345 or QST FE427 or CAS EC392 or CAS IR292 or equivalent for non-Questrom students (may be taken concurrently)"
    },
    {
        "course_code": "QST IM 471",
        "course_title": "Made in Italy",
        "description": "This course offers a comparative analysis of the diverse peculiarities that characterize the products made in Italy from others produced in some European countries (Germany, France, or Great Britain) and non-European countries (Japan or the U.S.). By the end of the course, students will demonstrate an understanding of local and global diversity and the global impact of \"Made in Italy.\" The course also helps students to improve their creative skills by completing an in-depth analysis of how innovation works as a fuel for SMEs to find strategies to compete and create additional value for customers. By preparing for case studies, presentations, participating in company visits and doing reports, students are able to directly engage in the creative process."
    },
    {
        "course_code": "QST IM 475",
        "course_title": "Global Management Experience",
        "description": "The Global Management Experience is a four-credit course that involves analytical work throughout the spring semester, and each year the countries, cities and companies studied are changed. Coursework includes an exploration of the economic, governmental and social factors that affect the conduct of business, and ethics, in a variety of industries and contexts. The course will feature presentations and Q&A with different business executives, government leaders and entrepreneurs, providing an opportunity for first-hand observation around the application of management principles and strategies in the global arena. Please click here to watch a 1 minute video overview of the course."
    },
    {
        "course_code": "QST IM 851",
        "course_title": "The Management of Luxury Business",
        "description": "Graduate Prerequisites: Students must have 16 credits of MBA course work completed at Questrom. This Paris seminar is designed to be a deep-dive experiential learning experience focused on one of France's leading economic sectors: luxury goods and services. In this course, students will examine best business practices and challenges behind the global economic success of the French luxury goods industries. While in Paris, students will get a closer look into leading businesses serving high-end consumers across industries such as cosmetics, wine and spirits, high-end fashion, retail, hotels, real-estate, airplanes, and auctions as well as a historical perspective on how France became the leader in the luxury goods market. We will also learn about how global consumer trends such as sustainability, the resell market and economic downturn affects the luxury segment. Management issues in the luxury goods and services industries will be covered during firm visits, discussions with high-level executives and via an experiential consulting project. Students will meet with top executives and decision makers across business functions such as customer-relationship management, marketing, branding, operations, manufacturing, and financial planning. This class counts as an experiential learning course.",
        "prerequisites": "Students must have 16 credits of MBA course work completed at Questrom."
    },
    {
        "course_code": "QST IM 860",
        "course_title": "Social Impact Field Seminar",
        "description": "This course provides an action-based learning experience for students interested in understanding how for-profit and non-profit organizations develop innovative products and services that help mitigate grand challenges such as climate change, food security, global health, and poverty, and enable them to grow their business and sustain their competitive advantage over time. Students will work on a live 'social impact' consulting project for a client from the host country, and present their recommendation to the client while in the country. Furthermore, students will visit and interact with various players in the social impact sector (e.g., entrepreneurs, high-level executives, non-profit leaders) to learn about the opportunities and challenges they face. This course is ideal for students interested in social impact, sustainable energy, environmental sustainability, social entrepreneurship, socially responsible investing (SRI), and global health and healthcare."
    },
    {
        "course_code": "QST IM 885",
        "course_title": "International Management Field Seminar",
        "description": "This course will allow students the opportunity to utilize and apply their MBA learning to business work experience. Students will secure their internship in a position related to the MBA degree program. The deliverable of the project is a paper in which the students must address how the position will leverage their MBA career growth and industry analysis. The deliverable will be due upon completion of the internship experience."
    },
    {
        "course_code": "QST IS 223",
        "course_title": "Introduction to Information Systems",
        "description": "Undergraduate Prerequisites: QST SM 131. Provides students with an understanding of the important role that information and information technology play in supporting the effective operation and management of business. Elaborates on the themes of \"place to space\" and the implications for business of the digital enterprise. Focuses on learning IS concepts in the context of application to real business problems.",
        "prerequisites": "QST SM 131."
    },
    {
        "course_code": "QST IS 428",
        "course_title": "Managing Information Security",
        "description": "Undergraduate Prerequisites: QST IS 223. Combines technical and business approaches to the management of information. It will address technical issues such as cryptography, intrusion detection, and firewalls along with managerial ideas such as overall security policies, managing uncertainty and risk, and organization factors. We will examine different aspects of computer security such as password, virus protection, and managing computer security in dynamic environments. Topics will also include network security and how to secure wireless application and services. These technical details will be placed in a business context. The class will have a practical focus as we examine current \"best practices\" in area. There will be several guest speakers in the security area. This will be a project-oriented class and students will present their research projects during the last several classes. 4 cr.",
        "prerequisites": "QST IS 223."
    },
    {
        "course_code": "QST IS 465",
        "course_title": "Managing Data Resources",
        "description": "Undergraduate Prerequisites: QST IS223; QST BA222 or CAS CS105 or CAS CS108 or CAS CS111 (co-requisite /pre-requisite) Required for Management Information Systems concentrators. Provides a practical and theoretical introduction to data management focusing on the use of relational database technology and SQL to manage an organization's data and information. Introduces recent topics such as data warehouses and Web databases. Includes a project to design and implement a relational database to manage an organization's data. 4 cr.",
        "prerequisites": "QST IS223; QST BA222 or CAS CS105 or CAS CS108 or CAS CS111 (co-requisite /pre-requisite)"
    },
    {
        "course_code": "QST IS 467",
        "course_title": "Agile Development Methodologies",
        "description": "Undergraduate Prerequisites: QST IS223; QST BA222 or CAS CS105 or CAS CS108 or CAS CS111 (co-requisite /pre-requisite) This course is designed to provide the students with an overview of Agile Development methodologies. The course introduces the various methods currently used in the industry and then focuses on the primary methodologies used today, SCRUM and Kanban. Students will learn the tools of these software development approaches that produce deliverables to end users every two to four weeks. We analyze the value each of these methodologies bring into the development process and the reasoning behind a corporation selecting one method over the other (or a combination of both). In addition, the students will be introduced to CA Project Management software, the leader in the industry for SCRUM. Students will learn to analyze requirements, create backlogs, schedule \"stories\" to be developed, hold Standup meetings, Reviews and Retrospectives.",
        "prerequisites": "QST IS223; QST BA222 or CAS CS105 or CAS CS108 or CAS CS111 (co-requisite /pre-requisite)"
    },
    {
        "course_code": "QST IS 469",
        "course_title": "Designing Information Systems",
        "description": "Undergraduate Prerequisites: QST IS 223. Required for Management Information Systems concentrators. Studies the process of designing and implementing management information systems. Students will learn to analyze organizational information requirements, develop specifications for information systems, manage systems development projects, and understand implementation issues. Key implementation concepts that affect management decisions will be discussed, and reinforced with programming examples. Design support tools will be used to support the design process. Includes a project to design an information system.",
        "prerequisites": "QST IS 223."
    },
    {
        "course_code": "QST IS 474",
        "course_title": "Platform Strategy & Design",
        "description": "Undergraduate Prerequisites: QST IS 223. Today's most valuable and powerful companies do not offer standalone products or services, but rather platforms which enable transactions between multiple customer groups -- think Alibaba, Airbnb, Amazon, eBay, Facebook, Google, Microsoft, Salesforce, Uber, etc. This course explores the unique strategy challenges and economic foundations of such platform businesses. What makes platforms special relative to regular product businesses? Why are platforms so powerful, yet so hard to build? How should platforms be designed and priced? How much responsibility should platforms take for bad things they enable their participants to do (e.g. fake news and ad scams on Facebook, counterfeits on Alibaba)? When and how can regular products or services be transformed into platforms? How should other businesses deal with the rising power of platforms that they depend on? The course will use a mixture of conceptual frameworks, (light) economic models, and case studies to provide students with a thorough and in-depth understanding of what it takes to build or invest in platforms. Such an understanding is indispensable to anyone seeking a career at technology companies or aspiring to become an entrepreneur or venture capitalist.",
        "prerequisites": "QST IS 223."
    },
    {
        "course_code": "QST IS 479",
        "course_title": "Innovating with Information Technology",
        "description": "Undergraduate Prerequisites: QST IS 223. Surveys the organizational implementation, uses, and impacts of advanced information technology including decision support systems, management support systems, and expert systems. Includes a group project to design and develop a decision support system.",
        "prerequisites": "QST IS 223."
    },
    {
        "course_code": "QST IS 711",
        "course_title": "IT Strategies for a Networked Economy",
        "description": "Graduate Prerequisites: QST MO712 or MO713, QST AC710 AC711, QST QM716 or QM717 This case-based course demonstrates the role that information technology plays in shaping business strategy and business models. It provides an overview of the key technologies that are important in today's business environment and introduces organization and management concepts relating to the information technology function. The course also illustrates the relationships between organizational performance and the ability to leverage knowledge assets.",
        "prerequisites": "QST MO712 or MO713, QST AC710 AC711, QST QM716 or QM717"
    },
    {
        "course_code": "QST IS 717",
        "course_title": "Systems Architecture in Management and Applications",
        "description": "Graduate Prerequisites: MSDT students only The objective of this course is to provide an overview of the concept of systems architecture and how it has evolved from a technical notion to an important business issue. The course has several themes: (1) Students develop an appreciation of how a business may leverage architectural design choices for operational and competitive advantage, both at a technical and business level. (2) Students obtain insight into how interface driven systems (those using APIs) enable flexibility and increased innovation. (3) Students are confronted with the difficult aspects of modern systems, such as parallelism and concurrency, and how these technical challenges are managed. An introduction to programming in Python provides a context to help students develop a hands-on understanding of these concepts. Care is taken to not just apply the technical material to management contexts, but also inform business strategy and organization and operations through these architectural principles.",
        "prerequisites": "MSDT students only"
    },
    {
        "course_code": "QST IS 737",
        "course_title": "Decision Making with Data",
        "description": "Graduate Prerequisites: QST IS717, IS833, IS834, QM877, or knowledge of Python This is an advanced python-based analytics course on data-driven decision-making in business environments. Business analytics professionals need to be able to i) uncover patterns in the data (descriptive analytics); ii) use the data to make predictions about future outcomes (predictive analytics); and iii) leverage this data to make optimal business decisions (prescriptive analytics). This course takes a holistic approach to analytics, touching on aspects of all three descriptive, predictive, and prescriptive pillars. We explore advanced business analytics topics, including data reduction, classification, decision analysis, and optimization. We link data models to strategy relying on statistical programming in Python and introduce novel techniques used in practice. Case studies and projects apply topics to practical business problems. 3 cr.",
        "prerequisites": "QST IS717, IS833, IS834, QM877, or knowledge of Python"
    },
    {
        "course_code": "QST IS 754",
        "course_title": "Human Centered Design",
        "description": "Graduate Prerequisites: MSDT students only When constructing digital artifacts, either for internal or external consumption, creating a coherent and well-motivated design is essential. This class will explore the language and key principles of design and how these impact the user experience. We will also cover the essentials of project management, including scoping as a design constraint. Students will be asked to critique existing designs and offer alternatives. Additionally, we will cover the programming topic of object orientation, and study both it and the structures it enables from a design perspective.",
        "prerequisites": "MSDT students only"
    },
    {
        "course_code": "QST IS 756",
        "course_title": "Digital Project Build",
        "description": "Graduate Prerequisites: MSDT students only The modern economy is driven by dynamic websites: those whose content is created on the fly by programs, not humans. In this class we will learn the technology behind both static and dynamic websites. Students will be exposed to the concepts through lectures and labs, and ultimately by the construction of a complete dynamic website in Python using our custom infrastructure built on Google App Engine.",
        "prerequisites": "MSDT students only"
    },
    {
        "course_code": "QST IS 811",
        "course_title": "Responsible AI for Business Analytics",
        "description": "AI and data are powerful tools that require thoughtful and responsible applications. The stakes are high as algorithms can scale to influence millions and even billions of people within a moment of launch and morph businesses and society with the impact that might last generations. Our mission is to understand and anticipate potential pitfalls and misuse of personal data and AI to guard against harm. We will also discuss existing solutions and the lack of solutions. The course is designed to be accessible to everyone and targeted to practitioners whose businesses will use some form of data and algorithms. Examples from Technology, Retail, Marketing, Health Care, Finance, and Society will be discussed."
    },
    {
        "course_code": "QST IS 823",
        "course_title": "Analytics for Managers",
        "description": "This non-programming-based analytics course examines how the abundance of data has transformed decision making in organizations and the strategic implications of this transformation. We explore how data are being used, ranging from the core principles of properly identifying data sources to the actual analytical methods being used to solve a wide range of business problems. Students will have some hands-on work with advanced Excel, Tableau, and two database applications, Microsoft Access and Neo4j (Neo4j is used to compare and contrast SQL and NoSQL databases in an analytics context). At the end of this course, students will have gained a big-picture perspective on business analytics as well as hands-on experience with commonly-used business analytics software."
    },
    {
        "course_code": "QST IS 827",
        "course_title": "Platform Strategy and Design",
        "description": "Graduate Prerequisites: QST PL727 or PL730, QST SI750 or SI751, or permission of instructor To thrive in the modern economy, managers, entrepreneurs and investors need a thorough understanding of platform businesses. Indeed, today's most powerful and valuable firms, from Airbnb, to Amazon, Facebook and Salesforce, operate as platforms connecting buyers and sellers, or users and advertisers, or users and third-party developers. These platforms derive their value from network effects and the ability to harness innovation from their users. Drawing on cases from social media, entrepreneurship, enterprise software, mobile services, and consumer products, we will analyze and learn to launch platform startups, convert existing businesses into platforms, and compete in a platform-centric world. Students will learn to apply concepts from industrial economics, market design, and game theory to real problems.",
        "prerequisites": "QST PL727 or PL730, QST SI750 or SI751, or permission of instructor"
    },
    {
        "course_code": "QST IS 828",
        "course_title": "Managing Information Security",
        "description": "Graduate Prerequisites: IS710/711/716 This MBA elective (also open to undergraduates) will combine a technical and business approach to the management of information. It will address technical issues such as cryptography, intrusion detection and firewalls along with managerial ideas such as overall security policies, managing uncertainty and risk and organization factors. We will examine different aspects of computer security such as passwords, virus protection and managing computer security in dynamic environments. Topics will also include network security and how to secure wireless application and services. These technical details will be placed in a business context. The class will have a practical focus as we examine current best practices. There well be several guest speakers in the security area. This will be a project oriented class and students will present their research projects during the last several classes.",
        "prerequisites": "IS710/711/716"
    },
    {
        "course_code": "QST IS 833",
        "course_title": "Introduction to Data Analytics in Python",
        "description": "Graduate Prerequisites: MSDT Students Only; IS717 or equivalent Python experience This course will introduce students to programming-based tools and techniques for becoming analytically-minded managers. The course covers both a hands-on introduction to the concepts, methods and processes of business analytics as well as an introduction to the use of analytics as the basis for creating a competitive advantage. We will review variables, data types, conditionals, loops, and functions, and use these to introduce data structures, including DataFrames. We will also cover reading and writing raw files and the core APIs in analysis and visualization. With the basics under our belt, we will complement it with some of the most popular libraries for data analysis in Python, such as Pandas and Numpy for data manipulation, Matplotlib and Seaborn for visualization, and Jupyter Notebook for reporting. These packages will facilitate workflow and enhance the basic Python functionalities. Using them, one can effortlessly clean up a dataset, create elaborate plots, analyze and summarize the data, and produce presentable reports. Throughout the final project, we will learn to extract value from data by asking the right questions and using the appropriate analytical methods and tools. These methods comprise data preprocessing, explanatory analysis, and machine learning techniques. Prior programming experience in Python is required.",
        "prerequisites": "MSDT Students Only; IS717 or equivalent Python experience"
    },
    {
        "course_code": "QST IS 834",
        "course_title": "Introduction to Python for Data Analytics",
        "description": "Graduate Prerequisites: Not open to MSDT students (except as a substitute for IS833 with permission) This course will introduce students to programming-based tools and techniques for becoming analytically-minded managers. The course covers both a hands-on introduction to the concepts, methods and processes of business analytics as well as an introduction to the use of analytics as the basis for creating a competitive advantage. We will cover variables, data types and data structures, DataFrames, conditionals, loops, and functions. We will also cover reading and writing raw files and the core APIs in analysis and visualization. With the basics under our belt, we will complement it with some of the most popular libraries for data analysis in Python, such as Pandas and Numpy for data manipulation, Matplotlib and Seaborn for visualization, and Jupyter Notebook for reporting. These packages will facilitate workflow and enhance the basic Python functionalities. Using them, one can effortlessly clean up a dataset, create elaborate plots, analyze and summarize the data, and produce presentable reports. Throughout the final project, we will learn to extract value from data by asking the right questions and using the appropriate analytical methods and tools. These methods comprise data preprocessing, explanatory analysis, and machine learning techniques. No prior programming experience is required. Learning basic programming in Python is part of successfully completing the class.",
        "prerequisites": "Not open to MSDT students (except as a substitute for IS833 with permission)"
    },
    {
        "course_code": "QST IS 843",
        "course_title": "Big Data Analytics for Business",
        "description": "Graduate Prerequisites: Python basics (e.g. IS717, IS834, QM877 (Python Bootcamp) or equivalent); Some prior experience with analytics (e.g. IS823, IS833, IS834, IS841, MK842, MK872, MK876); or permission of the instructor. This programming-based analytics course will cover how to perform statistical analysis of large datasets that do not fit on a single computer. We will design a Hadoop cluster on Google Cloud Platform to analyze these datasets. Utilizing Spark, Hive, and other technologies, students will write scripts to process the data, generate reports and dashboards, and incorporate common business applications. Students will learn how to use these tools through Jupyter Notebooks and experience the power of combining live code, equations, visualizations, and narrative text. Employer interest in these skills is very high. Basic programming in python, and basic analytics are prerequisite.",
        "prerequisites": "Python basics (e.g. IS717, IS834, QM877 (Python Bootcamp) or equivalent); Some prior experience with analytics (e.g. IS823, IS833, IS834, IS841, MK842, MK872, MK876); or permission of the instructor."
    },
    {
        "course_code": "QST IS 853",
        "course_title": "Business Insights through Text",
        "description": "Graduate Prerequisites: QST MK 842 or QST IS 833 or QST IS 834 or QST QM 877; QST MK842 or IS833 or IS834 or QM877 Eighty to ninety percent of current exponential data growth is attributed to unstructured data such as text. Increasingly, the data has become more like crude oil that has to be refined and structured to extract value for business insights and strategies. Managers need to understand the opportunities and challenges associated with unstructured data for competitive advantage. In this class, students will learn what businesses can do with text data through a variety of case-based examples based on research and industry applications from Marketing, Information Systems, Finance, Strategy, and Social Impact perspectives. This is a course dedicated to understanding the potentials of text data in different settings curated based on Natural Language Processing (NLP) techniques involved. The focus of the course is on the substantive value of text and methods will be introduced as backdrops. Throughout the course, we will use Python, a powerful language and the main tool used by deep learning data scientists. However, skeleton codes will be provided to reduce technical burdens. 1.5 cr.",
        "prerequisites": "QST MK 842 or QST IS 833 or QST IS 834 or QST QM 877; QST MK842 or IS833 or IS834 or QM877"
    },
    {
        "course_code": "QST IS 854",
        "course_title": "Digital Strategy for Emerging Business Leaders",
        "description": "Graduate Prerequisites: SI851 preferred A digital strategy is an organization's plan to leverage digital technologies to create new business models, products, and services, as well as to improve internal processes and interactions with customers, suppliers, and partners. For business leaders, a digital strategy is crucial to staying competitive and grow their businesses. In this course, students will learn how to design, execute and communicate digital strategies in a complex organization. We will also learn key management concepts such as project delivery, change management, as well as financial modelling of digital investments. In addition to case studies and class exercises, we will bring in industry experts to share their real-world experience. In lieu of a final exam, students will form into project teams to design, develop, present and gain buy-in for a specific digital strategy.",
        "prerequisites": "SI851 preferred"
    },
    {
        "course_code": "QST IS 858",
        "course_title": "Agile Project Management",
        "description": "This course is designed to provide students with an overview of agile development methodologies. The course introduces the various methods currently used in the industry and then focuses on the primary methodologies used today, SCRUM and Kanban. Students will learn the tools of these agile development approaches and will be introduced to RALLY Project Management software, the leader in the industry for SCRUM. Students will learn to analyze requirements, create backlogs, schedule \"stories\" to be developed and delivered, hold standup meetings, and Retrospectives."
    },
    {
        "course_code": "QST IS 878",
        "course_title": "Business Modeling with Spreadsheets",
        "description": "This course aims to sharpen students' ability to frame a business problem and organize the relevant information in a way that is conducive to developing a spreadsheet model, and to perform logical analyses in an organized and rigorous fashion. Students will learn how to create a workable prototype of a spreadsheet based upon formula-charts, or a directed-graph diagram, applying principles of spreadsheet engineering to design the spreadsheet in a way that prevents errors. The course will teach students how to design, build, test, and use a spreadsheet, as well as how to process and visualize data in preparation for building a well-structured model. Students will be exposed to settings in which models can be used effectively. They will apply modeling concepts in practical situations and learn to extract insight from models and to use those insights to communicate, persuade and motivate organizational decision making. They will also learn how to formulate a constrained optimization problem with multiple variables for a variety of applications including, Strategy, Operations, Technology Management, Marketing, and Finance. The course will show how to understand how to use sensitivity analysis to evaluate the impact of a parameter on the optimal solution to a problem and cover the key principles for Real-Time Data Capture for Analytic. Finally, students will learn the latest technologies for effectively linking spreadsheets to relational data bases, and to reliably manage large scale spreadsheets. 1.5 cr."
    },
    {
        "course_code": "QST IS 879",
        "course_title": "Business Modeling with Spreadsheets",
        "description": "This course aims to sharpen students' ability to conduct quantitative analyses of business problems. The primary focus is on problem formulation and analysis -- identifying the key components of a decision problem, structuring it, translating it into a graphical chart, and then building the appropriate mathematical and spreadsheet models. These models are used to generate valuable qualitative and quantitative managerial insights. Students will be introduced to data management and decision tools such as Formula Diagrams, Linear Optimization, and Error Detection methodologies, as well as to Parametric Sensitivity Analyses. While each business problem is distinctive, a disciplined approach to problem solving can be incredibly useful across many career contexts. The concepts and exercises in this course will sharpen the student's professional ability to structure a messy problem and do some disciplined analysis on it. Developing these modeling skills requires the opportunity to brainstorm, reflect, and practice it on a wide variety of problems. Hence, the course includes intensive team-centered workshop sessions where all students get hands-on practice working with a group of peers to frame various problems in appropriate analytical terms, develop a solution approach, and critically reflect on the results. Examples will be drawn from Strategy, Operations, Technology Management, Marketing, and Finance to expose students to the broad applications of the concepts and tools learned in this class. Many of the up- to-the-minute Excel techniques covered in the course are now considered standard in industry, and developing a good understanding of them will deepen the student's ability to identify opportunities in which spreadsheet analytics can be used to improve performance, drive value, and support important decisions. Finally, students will learn the latest technologies for effectively linking spreadsheets to relational databases, and to manage reliably large scale spreadsheet development projects."
    },
    {
        "course_code": "QST IS 883",
        "course_title": "Synthesizing Digital Efforts to Deliver Better Outcomes",
        "description": "Graduate Prerequisites: MSDT Students Only Most organizations today -- of all sizes and stages of maturity -- are undertaking internally and externally focused digital initiatives. The success of these programs varies widely and depends on numerous strategic, tactical and technical factors. Foremost among them are how individuals with skills across strategy, design, product/project management, technology, and data science think individually and how they work together collectively. In this class, students will learn and apply leading thinking, practices, and tools used by top digital professionals to design and build digital products. The first half of the course will focus on cloud technology and its effect on organizational structures and product development lifecycles. In the second half of the semester, students will organize into teams to begin work on a digital experience they will design and iteratively realize the following semester in IS890, applying skills they have learned throughout the MSDT as well as new methods including exploratory ethnography, service design, agile/scrum, and data-driven experimentation.",
        "prerequisites": "MSDT Students Only"
    },
    {
        "course_code": "QST IS 889",
        "course_title": "Data Management",
        "description": "Graduate Prerequisites: Non-MSDT students only in Fall; MSDT students only in Summer The ability to collect, organize, access, analyze and harness data is a source of competitive advantage for some and a competitive necessity for others. Getting an organization to the point where it has a data asset it can leverage is a non-trivial task. Many firms have been shocked at the amount of work and complexity that is required to pull together an infrastructure that integrates its diverse data sources and empowers its managers. This course will provide an introduction to the concepts and technologies that are involved in managing and supporting the data assets of your organization. We will cover data modeling, relational databases, including SQL, data warehousing and business intelligence.",
        "prerequisites": "Non-MSDT students only in Fall; MSDT students only in Summer"
    },
    {
        "course_code": "QST IS 912",
        "course_title": "Platform Strategy & Design",
        "description": "This class will cover seminal works in the economics of information including the Nobel Prize winning ideas of Akerlof, Arrow, Spence, Stiglitz, and von Hayek. It will proceed through (i) concepts of information, its value and measurement (ii) search and choice under uncertainty (iii) signaling, screening, and how rational actors use information for private advantage (iii) how to price and package information goods (iv) how properties of information cause market failure (v) macroeconomic effects of information (vi) social and legal issues of owning information. Although primarily a theory class, it should be of interest to any student applying information economics in academic, commercial, or government policy contexts. Prerequisites are a graduate course in microeconomics and mathematics at the level of introductory calculus and statistics. Students will produce a major paper suitable for publication or inclusion in a thesis."
    },
    {
        "course_code": "QST IS 919",
        "course_title": "Research Seminar 2",
        "description": "This course covers those important Information Systems (IS) theories and topics that are at the organizational level of analysis and below. That is, it focuses on the behaviors of single individuals and small numbers of individuals, such as dyads and teams. This is consistent with an approach to organizational phenomena that distinguishes between micro and macro levels of research, this course being the micro. The focus is on ways that individuals and teams use information technologies to acquire, process, and transfer information, and the effects these technologies have on individual cognition and dyadic and group interactions. It also investigates the design and implementation of information technologies and the impact of these on organizational outcomes. The course is designed to engender students with a broad knowledge of research at the intersection of information technologies and organizations, with an emphasis on theoretical underpinnings and methodological choices."
    },
    {
        "course_code": "QST IS 990",
        "course_title": "Current Topics Seminar",
        "description": "For PhD students in the Information Systems department. Registered by permission only."
    },
    {
        "course_code": "QST LA 245",
        "course_title": "Introduction to Law",
        "description": "Undergraduate Prerequisites: QST SM131 and sophomore standing Provides a broad overview of the American judicial system and fundamental legal issues. Examines dispute resolution, torts, contracts, criminal law, business organizations, employment law, intellectual property, and international law. The goal is to understand not only the basic rules of law but also the underlying social policies and ethical dilemmas.",
        "prerequisites": "QST SM131 and sophomore standing"
    },
    {
        "course_code": "QST LA 346",
        "course_title": "Business, Justice, and Responsibility",
        "description": "Undergraduate Prerequisites: QST LA 245. This course explores the legal and ethical challenges a leader will face in a highly regulated, complex, global business. We will explore societal issues such as lying, bias, fraud, corruption, stereotyping, religious freedom, discrimination, and whistleblowing, and consider the responsibility of a business and its leaders to address these challenges, and to create a more just society. Students will also consider the competing roles of business, the legislature, and the courts in addressing societal issues. By reading Supreme Court opinions and business cases, participating in oral arguments, engaging in efforts to make social change, and studying current events, students will deepen skills in analyzing ethical dilemmas and thinking critically. This course will teach students to view decisions through multiple frames, develop empathy, and train them to engage in a meaningful, substantive dialogue -- written and spoken -- about sensitive topics in a professional setting.",
        "prerequisites": "QST LA 245."
    },
    {
        "course_code": "QST LA 355",
        "course_title": "Employment Law and Public Policy",
        "description": "Undergraduate Prerequisites: QST LA 245. An in-depth look at the legal issues involved in the employer/employee relationship. Such topics include: discrimination, affirmative action, harassment, the hiring process, employee testing, and terminating employees (for cause, layoffs). Discussions will focus on the duties and rights of both parties through the stages of employment, from hiring and managing your workforce, to benefits, conditions of employment, and downsizing.",
        "prerequisites": "QST LA 245."
    },
    {
        "course_code": "QST LA 360",
        "course_title": "Real Estate Law",
        "description": "Undergraduate Prerequisites: QST LA245. Pre-req for SHA students: SHA HF250 Real estate can generate spectacular wealth and contribute to unprecedented financial losses. Real estate is an essential component of every business that requires a physical location to operate. Real estate is where we sleep, where we attend school, where we work, where we play, where we go when we are sick -it quite literally is beneath everything we do. Every real estate transaction begins and ends with legal principles. Mastering the basics of property law puts one in a superior position. Knowledge of real estate law is imperative for those who plan to invest in or manage property on a larger scale. This course provides an overview of real estate law for tenants, present and future property owners, developers, investors, and public policy advocates. We examine the nature of real property and property ownership, residential and commercial real estate transactions, and selected issues of real estate development.",
        "prerequisites": "QST LA245. Pre-req for SHA students: SHA HF250"
    },
    {
        "course_code": "QST LA 365",
        "course_title": "Securities Regulation",
        "description": "Undergraduate Prerequisites: QST LA 245 and QST FE 323. The securities industry is highly regulated by a complex set of federal laws designed to \"protect investors, maintain fair, orderly, and efficient markets, and facilitate capital formation.\" (www.sec.gov/about/whatwedo.shtml) Federal law governs the issuance of securities (\"going public\"), regulates companies whose shares are being traded (known as \"issuers\"), and makes rules for everyone working in the securities industry, including bankers, brokers, dealers, and investment advisors. Those issuers and financial institutions (and their employees or directors) who violate the myriad of federal laws regulating securities face civil litigation from shareholders, enforcement actions by the Securities and Exchange Commission, and criminal charges from the Department of Justice. This course will focus upon the key federal statutes that regulate securities and participants in the securities markets: the Securities Act of 1933, the Securities Exchange Act of 1934, Sarbanes-Oxley, the Dodd-Frank Act of 2010, the Foreign Corrupt Practices Act, and several criminal statutes that are utilized for violations of securities regulation. We will read statutes and case law, and use examples and guest speakers to understand the application of the law in real life. The class is intended for students interested in careers in finance or leadership in a public company. The goal is not to create securities lawyers, but to give students an awareness of the regulation and the legal risks involved in the securities market.",
        "prerequisites": "QST LA 245 and QST FE 323."
    },
    {
        "course_code": "QST LA 430",
        "course_title": "Entertainment Law",
        "description": "Undergraduate Prerequisites: QST LA 245. (Offered in Los Angeles) Covers the basics of entertainment law, including constitutional, contracts, labor, and employment law and intellectual property rights. Students develop a clear understanding of the applicable laws and how these laws have been applied in the past, how they are applied today, and how they might be amended and applied in the future. Students learn applicable legal concepts, practical insights, and an appreciation of how to deal with lawyers and the law in their entertainment business futures. It is intended to provide a good conceptual understanding of the law and demonstrate its relevance through case study, reading, guest speakers, field trips, and intense discussion. The application of the law to the digital now, the digital future and the Internet now crucial, indeed central, to any discussion of entertainment will be included throughout and be the subject of an entire class toward the end of the course. The law to be explored will be constitutional, copyright, trademark, contracts, labor, employment, and remedies and their application to and use within the entertainment business.",
        "prerequisites": "QST LA 245."
    },
    {
        "course_code": "QST LA 450",
        "course_title": "Law and Risk Management",
        "description": "Undergraduate Prerequisites: QST LA 245. Due to the financial crisis of 2008, the industry has re-aligned its business models to a risk-based approach for products and services. In response to this paradigm shift, Advanced Business Law, now known as Law and Risk Management, will focus on the identification, assessment, and management of operational and regulatory risk in the context of the law. Topics covered will continue to include contract risk, commercial financing, the Uniform Commercial Code, agency liability, bankruptcy, products liability, and real estate. The class will emphasize legal issues as a component of effective strategic business planning with a particular emphasis on duties and liabilities for corporate accounting. Group work includes contract drafting, interpretation, and negotiation. This course in part supplements many of the legal issues central to the accounting concentration and addresses many of the topics on the Regulation section of the CPA Exam.",
        "prerequisites": "QST LA 245."
    },
    {
        "course_code": "QST LA 498",
        "course_title": "Law Directed Study",
        "description": "Directed study in Law. 2 or 4 cr. Application available on Undergraduate Program website."
    },
    {
        "course_code": "QST MF 600",
        "course_title": "Mathematics and Statistics Review",
        "description": "Mathematical Finance as a discipline borrows concepts from probability theory, statistics, linear algebra, calculus and optimization, ordinary and partial differential equations, computer science and financial economics. This course reviews the essential prerequisites in mathematics, probability and statistics to prepare students for the MS in Mathematical Finance program. The course begins with a review of probability and the fundamentals of stochastic processes. Following this, statistical inference and linear algebra are reviewed. A review of comparative statics, optimization theory and dynamics, beginning with a review of integration, and continuing with first- and higher- order differential equations concludes the course."
    },
    {
        "course_code": "QST MF 601",
        "course_title": "Launch",
        "description": "Mathematical Finance Launch is an orientation program for students entering the MS in Mathematical Finance program."
    },
    {
        "course_code": "QST MF 602",
        "course_title": "Prog Refresher",
        "description": null
    },
    {
        "course_code": "QST MF 610",
        "course_title": "Mathematical Finance Career Management",
        "description": "This course prepares students in the MS Mathematical Finance program for the global employment market in quantitative finance. The course has the following objectives: to familiarize students with the foundational mathematics and statistics required for the MSMF program, to develop sound networking and job search strategies, to prepare students for 'quant' interviews, to develop good career management habits, and to familiarize students with important developments in financial markets and issues of the day that affect the global financial services industry."
    },
    {
        "course_code": "QST MF 650",
        "course_title": "Industry Internship",
        "description": "MF 650 is offered to MS and PhD candidates in Mathematical Finance. The course affords graduate students the opportunity to complete an internship in the financial services (or a related) industry and serves to enhance the students' academic and/or research experience. MF 650 is required for all students pursuing the MSMF degree. It is an elective for PHD in Mathematical Finance students and has to be approved by the student's faculty advisor, department PhD Liaison and the PhD Program Director."
    },
    {
        "course_code": "QST MF 702",
        "course_title": "Fundamentals of Finance",
        "description": "This course covers such topics as: financial markets (bonds, stocks, derivative securities, forward and futures contracts, exchanges, market indices, and margins); interest rates, present value, yields, term structure of interest rates, duration and immunization of bonds, risk preferences, asset valuation, Arrow-Debreu securities, complete and incomplete markets, pricing by arbitrage, the first and the second fundamental theorems of Finance, option pricing on event trees, risk and return (Sharpe ratios, risk premia), and the Capital Asset Pricing Model. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 703",
        "course_title": "Programming for Mathematical Finance",
        "description": "In-depth discussion of object-oriented programming with Python and C++ for finance and data applications. Topics include built-in-types, control structure, classes, constructors, destructors, function overloading, operator functions, friend functions, inheritance, and polymorphism with dynamic binding. Case study looks at the finite differences solutions for the basic models of financial derivatives; as well as the design and development of modular, scalable, and maintainable software for modeling financial derivatives. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 728",
        "course_title": "Fixed Income Securities",
        "description": "The course focuses on the valuation, hedging and management of fixed income securities. Theoretical and empirical term structure concepts are introduced. Short rate models and the Heath-Jarrow-Morton methodology are presented. Market models and their application for the valuation of forwards, swaps, caps, floors and swaptions, and other interest rate derivatives are discussed in detail. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 730",
        "course_title": "Dynamic Portfolio Theory",
        "description": "A concise introduction to recent results on optimal dynamic consumption- investment problems is provided. Lectures will cover standard mean-variance theory, dynamic asset allocation, asset-liability management, and lifecycle finance. The main focus of this course is to present a financial engineering approach to dynamic asset allocation problems of institutional investors such as pension funds, mutual funds, hedge funds, and sovereign wealth funds. Numerical methods for implementation of asset allocation models will also be presented. The course also covers empirical features and practical implementation of dynamic portfolio problems. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 731",
        "course_title": "Corporate Risk Management",
        "description": "This course is an introduction to modern methods of risk management. The first half of the course focuses on market risk. Here, lectures cover risk measures (such as Value at Risk and Expected Shortfall), with a focus on computation of such measures in a dynamic, multi-asset environment using real-world data. In particular, students will learn to compute, back-test, and account for risk measures when both monitoring and constructing portfolios. Additionally, lectures cover scenario analysis, stress testing, and the measurement of severe tail risk via extreme value theory. In the second half of the course, lectures cover alternate types of risk. These include operational, liquidity, model, and counter-party credit risk. In particular, students will derive formulas for the valuation adjustments due to counter-party default. The approach to the topic is quantitative. The course is ideal for students with strong quantitative backgrounds who are seeking to understand issues pertaining to risk management and to master modern methods and techniques of risk control. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 740",
        "course_title": "Economics of FinTech",
        "description": "The course covers the following topics: introduction to Blockchains and cryptocurrencies; contract theory for initial coin offerings; robo-advising; crowd wisdom; and privacy issues. Although the course introduces some Blockchain programming languages, e.g. Solidity, the emphasis of the course is on the economics of FinTech rather than on programming. Students are expected to be familiar with basic financial economics, econometrics, and stochastic processes."
    },
    {
        "course_code": "QST MF 770",
        "course_title": "Advanced Derivatives",
        "description": "Graduate Prerequisites: QST MF 795. This course provides a comprehensive and in-depth treatment of valuation methods for derivative securities. Extensive use is made of continuous time stochastic processes, stochastic calculus and martingale methods. The main topics to be addressed include (i) European option valuation, (ii) Exotic options, (iii) Multiasset options, (iv) Stochastic interest rate, (v) Stochastic volatility, (vi) American options and (vii) Numerical methods. Additional topics may be covered depending on time constraints. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)",
        "prerequisites": "QST MF 795."
    },
    {
        "course_code": "QST MF 772",
        "course_title": "Credit Risk",
        "description": "The derivatives market has experienced tremendous growth during the past decade as credit risk has become a major factor fostering rapid financial innovation. This course will provide an in-depth approach to credit risk modelling for the specific purpose of pricing fixed income securities and credit-risk derivatives. The course will explore the nature of factors underlying credit risk and develop models incorporating default risk. Types and structures of credit-derivatives will be presented and discussed. Valuation formulas for popular credit-derivatives will be derived. Numerical methods, for applications involving credit derivative structures and default risks, will be presented. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 790",
        "course_title": "Stoch Calculus",
        "description": null
    },
    {
        "course_code": "QST MF 793",
        "course_title": "Statistics for Mathematical Finance",
        "description": "This course covers the fundamental principles of statistics and econometrics. It is mandatory for all tracks of the MSc. program. The course first reviews the needed concepts in probabilities, properties of random variables, the classic distributions encountered in Finance. Then, we cover the principles of random sampling, properties of estimators, e.g., the standard moment estimators (sample mean, variance, etc..). The next major topic is the regression analysis. We study the OLS and GLS principles, review their properties, in the standard case and when ideal assumptions are not correct. The course ends with a study of time series ARMA models and volatility models such as GARCH and Risk-Metrics. The course makes intensive use of the R package. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 795",
        "course_title": "Stochastic Methods in Asset Pricing I",
        "description": "This course develops the basic tools from measure-theoretic probability theory and stochastic calculus that are needed for an in-depth study of continuous time finance. Some related tools from asset pricing (e.g., risk-preferences and state-price densities) are introduced as well, and the basic ingredients of continuous time financial modeling are developed. The following topics are covered: probability and measure, the coin-toss space and the random walk, random variables and convergence, Gaussian distribution, martingales, Brownian motion, stochastic integration for semi-martingales and Ito formula, Girsanov's theorem, stochastic differential equations, continuous time market models and pricing by arbitrage, resume of Malliavin calculus, replication and pricing of contingent claims, market completeness and the fundamental theorems of asset pricing. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 796",
        "course_title": "Computational Methods of Mathematical Finance",
        "description": "This course introduces common algorithmic and numerical schemes that are used in practice for pricing and hedging financial derivative products. Among others, the course covers Monte-Carlo simulation methods (generation of random variables, exact simulation, discretization schemes), finite difference schemes to solve partial differential equations, numerical integration, and Fourier transforms. Special attention is given to the computational requirements of these different methods, and the trade-off between computational effort and accuracy. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 810",
        "course_title": "FinTech Programming",
        "description": "The course introduces students to a number of efficient algorithms and data structures for computational problems across a variety of areas within FinTech. In the first half of the course, a special programming language for blockchains, such as Solidity, is taught, and TensorFlow, a special Python library for deep learning models, is used to solve stochastic control problems in finance. In the second half of the course, advanced techniques for improving computational performance, including the use of parallel computation and GPU acceleration are surveyed; frameworks for big data analysis such as Apache Hadoop and Apache Spark are studied. Students will have the opportunity to employ these techniques and gain hands-on experience developing advanced applications. (This course is reserved for students enrolled in the Graduate Certificate in Financial Technology.)"
    },
    {
        "course_code": "QST MF 815",
        "course_title": "Advanced Machine Learning Applications for Finance",
        "description": "This course surveys applications of machine learning techniques to various types of financial datasets. This course starts with financial data structure and features, then introduces deep learning and advanced supervised learning techniques. We will examine several machine learning applications in pricing, hedging, and portfolio management. Advanced methods for clustering and classification such as support vector machine and unsupervised learning will be introduced. Reinforcement learning and its connection with optimal control will be discussed. Text data will be introduced and analyzed using text mining techniques. Machine learning techniques will be applied to asset allocation. Strategy back-testing and strategy risk will also be discussed. (This course is reserved for students enrolled in the Graduate Certificate in Financial Technology.)"
    },
    {
        "course_code": "QST MF 821",
        "course_title": "Algorithmic and High-Frequency Trading",
        "description": "This course will introduce concepts of electronic markets, and statistical and optimal control techniques to model and trade in these markets. We will begin with a description of the basic elements of electronic markets, some of the features of the data, its empirical implications and simple microeconomic models. Next, we will study statistical tools to estimate and predict price and volatility of the high-frequency price. Then we will investigate algorithmic trading problems from the stochastic optimal control perspective, including the optimal execution problem and show how to modify the classical approaches to include order-flow information and the effect that dark pools have on trading. Trading pairs of assets that mean-revert is another important algorithmic strategy, and we will see how stochastic control methods can be utilized to inform agents how to optimally trade. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 825",
        "course_title": "Advanced Topics in Investments",
        "description": "This course is designed for students seeking to work as quants in a quantitative finance investments group. It covers utility theory, portfolio optimization, asset pricing, and some aspects of factor models, incorporating the impact of parameter uncertainty. The course does not cover risk management or fixed income instruments, nor does it describe how the financial services industry works. Rather, it teaches how a quant should optimize a portfolio. The course makes extensive use of R (Excel or VBA are not substitutes), optimization theory, statistics, regression theory (OLS, GLS, testing theory), and matrix algebra. Students should be very comfortable with these concepts before taking the course; further, students should already have taken a finance course covering expected returns models (CAPM), options and futures. The course emphasizes the ability to prove theoretical results and their validity, an essential trait for investments quants. Students who completed QST FE825 may not take this course for credit. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 840",
        "course_title": "Data Analysis and Financial Econometrics",
        "description": "Graduate Prerequisites: QST MF 793. This is the second course of the econometrics sequence in the Mathematical Finance program. The course quickly reviews OLS, GLS, the Maximum Likelihood principle (MLE). Then, the core of the course concentrates on Bayesian Inference, now an unavoidable mainstay of Financial Econometrics. After learning the principles of Bayesian Inference, we study their implementation for key models in finance, especially related to portfolio design and volatility forecasting. We also briefly discuss the Lasso and Ridge methods, and contrast them with the Bayesian approach Over the last twenty years, radical developments in simulation methods, such as Markov Chain Monte Carlo (MCMC) have extended the capabilities of Bayesian methods. Therefore, after studying direct Monte Carlo simulation methods, the course covers non-trivial methods of simulation such as Markov Chain Monte Carlo (MCMC), applying them to implement models such as stochastic volatility. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)",
        "prerequisites": "QST MF 793."
    },
    {
        "course_code": "QST MF 850",
        "course_title": "Deep Learning, Statistical Learning",
        "description": "Graduate Prerequisites: QST MF 796. This course explores algorithmic and numerical schemes used in practice for the pricing and hedging of financial derivative products. The focus of this course lies on data analysis. It covers such topics as: stochastic models with jumps, advanced simulation methods, optimization routines, and tree-based approaches. It also introduces machine learning concepts and methodologies, including cross validation, dimensionality reduction, random forests, neural networks, clustering, and support vector machines. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)",
        "prerequisites": "QST MF 796."
    },
    {
        "course_code": "QST MF 921",
        "course_title": "Topics in Dynamic Asset Pricing",
        "description": "This course provides a comprehensive and in-depth treatment of modern asset pricing theories. Extensive use is made of continuous time stochastic processes, stochastic calculus and optimal control. Particular emphasis will be placed on (i) stochastic calculus with jumps; (ii) asset pricing models with jumps; (iii) the Hamilton-Jacobi-Bellman equation and stochastic control; (iv) numerical methods for stochastic control problems in finance. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 930",
        "course_title": "Advanced Corporate Finance",
        "description": "This doctoral level class on corporate finance covers both theoretical and empirical work. Rather than explaining the underpinnings of basic corporate research (e.g., model/applications dealing with asymmetric information, agency problems, and capital market frictions), we go deeper in understanding \"how to operationalize\" research on concrete topics that are central to contemporary corporate finance, such as bankruptcy, capital structure, mergers and acquisitions, the firm boundaries, investment, and much more. The class also looks at the interface between corporate finance and other research areas, such as asset pricing and banking. The course is a blend of new approaches to modeling in corporate research (e.g., dynamic, structural models of financial policy that generate typically quantitative predictions) and new approaches to testing design (e.g., regression discontinuities and natural experiments). The goal is to expose the students to the \"state-of-the-art\" of research in corporate finance and prepare them to do research in corporate finance using new methods and tools. (Mathematical Finance courses are reserved for students enrolled in the Mathematical Finance program.)"
    },
    {
        "course_code": "QST MF 990",
        "course_title": "Current Topics Seminar",
        "description": "For PhD students in the Mathematical Finance program. Registered by permission only."
    },
    {
        "course_code": "QST MG 730",
        "course_title": "Ethical Leadership in the Global Economy",
        "description": "The purpose of this course is to explore ethical issues throughout our global economy in a pragmatic, responsible, and decisive manner in order to prepare you to resolve these issues when faced with them in your personal and professional lives. This course will bridge the gap between an individual's personal moral values and the challenges presented by corporate activity in a marketplace -- be it local or global. Our work in this course will raise your awareness of the interrelated legal, moral, and ethical challenges inherent in business. We will critically examine the ethical implications of business decisions and equip you with frameworks and strategies for managing your own and others' behavior. We will formulate a process to evaluate complex leadership decisions and enhance your own ability to effectively navigate multi-faceted decision-making scenarios."
    },
    {
        "course_code": "QST MG 735",
        "course_title": "Integrated Risk Management",
        "description": "Managing risk at the enterprise level requires knowledge of the multifaceted nature of assessing and managing risk. To this end, this course brings together diverse perspectives and expertise from the realms of marketing, operations, the law, and finance. Students will learn how they identify, assess, and manage risk in their organizations both functionally as well as enterprise-wide."
    },
    {
        "course_code": "QST MK 200",
        "course_title": "Principles of Marketing",
        "description": "Open only to non-Questrom students. Marketing elective for Business minors. How is it that some products succeed and some fail? In many instances, the difference is in their marketing. The course examines key areas of marketing including product development, advertising, promotions, pricing, and channels. It uses a combination of in-class exercises, real world examples, cases, lecture, and discussion"
    },
    {
        "course_code": "QST MK 323",
        "course_title": "Marketing Management",
        "description": "Undergraduate Prerequisites: QST AC221; MO221; QM221; QM222 or BA222; SM131; SM132; SM275 Component of QST SM323, The Cross Functional Core. Introduces students to the field of marketing management: analysis, planning and implementation of marketing strategies as the means for achieving an organization's objectives. Students analyze cases and participate in workshops that focus on key marketing management tasks: marketing research, consumer behavior, segmentation and targeting, sales forecasting, brand management, distribution channels, pricing, promotion and advertising strategies, and marketing ethics. A semester-long business plan project where students collect primary and secondary research explores the interactions and the cross functional integrations between marketing, operations, and finance, while leveraging business analytics. cr. 4",
        "prerequisites": "QST AC221; MO221; QM221; QM222 or BA222; SM131; SM132; SM275"
    },
    {
        "course_code": "QST MK 345",
        "course_title": "Consumer Insights",
        "description": "Undergraduate Prerequisites: QST SM131 and sophomore standing Formerly MK445. Provides insight into the motivations, influences, and processes underlying consumption behavior. Considers relevant behavioral science theories/frameworks and their usefulness in formulating and evaluating marketing strategies (i.e., segmentation, positioning, product development, pricing, communications).",
        "prerequisites": "QST SM131 and sophomore standing"
    },
    {
        "course_code": "QST MK 435",
        "course_title": "Introduction to the Music Business and Music Marketing",
        "description": "Undergraduate Prerequisites: QST MK 323. Survey of the music industry with a focus on understanding of its structure and the intersection of business and music. Discusses key areas of music marketing, including opportunities for musicians, including publicity, advertising, promotion (online and traditional), digital distribution, touring, licensing/synch, and radio.",
        "prerequisites": "QST MK 323."
    },
    {
        "course_code": "QST MK 442",
        "course_title": "Digital Marketing Analytics",
        "description": "Undergraduate Prerequisites: QST MK323. Pre-req for SHA students: SHA HF260; CAS MA115 (or MA113);CAS MA116 This is an introductory course on Digital Marketing emphasizing analytics that seeks to familiarize students with digital marketing tactics. At the heart of marketing lies consumers and their marketing journey through the stages of awareness, intent, conversion and finally retention. In this course, we will learn how digital has revolutionized the interactions between firms and consumers along this journey. Digital offers powerful tactics to reach consumers along the funnel: online display ads raise awareness, search listings reach consumers with intent, on-site e-commerce marketing facilitate conversion, and social medial both energizes and retains customers. The course develops essential data analytics skills--critical thinking, data mining, experimental analysis and design--applied to ad campaign, ad attribution, and social media data.",
        "prerequisites": "QST MK323. Pre-req for SHA students: SHA HF260; CAS MA115 (or MA113);CAS MA116"
    },
    {
        "course_code": "QST MK 447",
        "course_title": "Marketing Research",
        "description": "Undergraduate Prerequisites: QST MK 323. Required for Marketing concentrators. Introduces tools and techniques of marketing research as an aid to marketing decision making. Definition of research problems, selection of research methodologies, design of research projects, interpretation of research results, and translation of research results into action.",
        "prerequisites": "QST MK 323."
    },
    {
        "course_code": "QST MK 465",
        "course_title": "Omni-channel Retailing",
        "description": "Undergraduate Prerequisites: QST MK323. Pre-req for SHA students: SHA HF260 The days of brick and mortar vs. online are gone and retailing has transitioned into omni-channel retailing. In this course, you will learn how retailers are successfully navigating this transformation. The course will explore topics such as how to attract omni-channel customers, the customer purchase journey, buying and merchandising management for such settings, and what retailers need to support an omni-channel strategy. Through a combination of class discussions, cases, articles, books, and projects, the course will prepare students to enter any facet of retailing and to benefit generally from a better understanding of this dynamic industry.",
        "prerequisites": "QST MK323. Pre-req for SHA students: SHA HF260"
    },
    {
        "course_code": "QST MK 467",
        "course_title": "Global Marketing Management",
        "description": "Undergraduate Prerequisites: QST MK323. Pre-req for SHA students: SHA HF260 Develops a critical appreciation of both the opportunities and challenges associated with the increasing globalization of markets. Students will learn about the key environmental forces shaping the needs and preferences of the global consumer and the impact of foreign, political, and economic factors on the marketing mix. 4 cr.",
        "prerequisites": "QST MK323. Pre-req for SHA students: SHA HF260"
    },
    {
        "course_code": "QST MK 469",
        "course_title": "Advertising in the Digital Age",
        "description": "Undergraduate Prerequisites: QST MK 323. Advertising has changed in the age of digital media with companies realizing the importance of traditional media as well as owned media, paid media, and earned media. This course focuses on developing an advertising strategy that integrates traditional and digital advertising media for efficient and effective communication. Topics include trends and practices associated with media planning and buying across the various media platforms as well as advertising creative best practices. The course also examines how to measure the effectiveness of a firm's advertising to gain insights into brand performance. A combination of cases, readings, textbook and projects will guide the student to a thorough understanding of advertising.",
        "prerequisites": "QST MK 323."
    },
    {
        "course_code": "QST MK 470",
        "course_title": "Pricing Strategy and Tactics",
        "description": "Undergraduate Prerequisites: QST MK323. Pre-req for SHA students: SHA HF260 Focuses on the practical needs of the marketing manager when making pricing decisions. Students learn the techniques of strategic analysis necessary to price more profitably by evaluating the price sensitivity of buyers, determining relevant costs, anticipating and influencing competitors' pricing, and formulating an appropriate pricing strategy.",
        "prerequisites": "QST MK323. Pre-req for SHA students: SHA HF260"
    },
    {
        "course_code": "QST MK 475",
        "course_title": "Luxury Brands",
        "description": "Undergraduate Prerequisites: QST MK 323. Creating and leveraging luxury brand equity is a significant challenge. This course will explore luxury entrepreneurship, innovation, and disruptive business models, the role of technology, craftsmanship, and design in the creation and evolution of luxury brands. We will address brand extensions, dilutions, and stretching as well as the ability to expand the brand globally. Tied to these are issues of the critical role of distribution channels, particularly retail channels, and luxury services in delivering the luxury promise. Threats to sustaining the value of one's brand (e.g., threats to the supply chain) will be examined. The course will rely on cases, guest speakers, and a significant project.",
        "prerequisites": "QST MK 323."
    },
    {
        "course_code": "QST MK 487",
        "course_title": "Branding",
        "description": "Undergraduate Prerequisites: QST MK323. Pre-req for SHA students: SHA HF260 Explores the art and science of branding, and the strategies through which companies can create, capture, and sustain shareholder value through brands. Through a mixture of theory and real-world cases, the course examines brands from the perspectives of the cultures and consumers who help create them, and the companies who manage them over time. Basic branding disciplines including positioning and repositioning, brand equity measurement, brand leverage, integrated brand communications, brand stewardship, and brand architecture are considered, as are more contemporary topics such as brand parodies, brand community, and branded entertainment. Particular attention is paid to branding challenges associated with today's interconnected, consumer-empowered, and transparent web-enabled world. 4 cr.",
        "prerequisites": "QST MK323. Pre-req for SHA students: SHA HF260"
    },
    {
        "course_code": "QST MK 723",
        "course_title": "Marketing Management",
        "description": "This course provides a practical understanding of how business strategies and tactics are driven by marketing's dual focus on customers and competition. Students will learn how to leverage marketing tools and emerging technologies in the creation (e.g., customer insight, product and service design, branding), delivery (e.g., communication and distribution), and capture (e.g., pricing, customer life time value) of marketplace value. Across business contexts including B2C, B2B, products versus services, global versus domestic markets, small/medium/large organizations, for-profit versus social enterprises, the course builds the fundamental skills involved in analyzing market challenges and opportunities and making decisions for the formulation and implementation of successful and sustainable marketing programs."
    },
    {
        "course_code": "QST MK 724",
        "course_title": "Marketing Management",
        "description": "Graduate Prerequisites: QST AC710 or AC711 (previous or concurrent) This course provides a practical understanding of how business strategies and tactics are driven by marketing's dual focus on customers and competition. Students will learn how to leverage marketing tools and emerging technologies in the creation (e.g., customer insight, product and service design, branding), delivery (e.g., communication and distribution), and capture (e.g., pricing, customer life time value) of marketplace value. Across business contexts including B2C, B2B, products versus services, global versus domestic markets, small/medium/large organizations, for-profit versus social enterprises, the course builds the fundamental skills involved in analyzing market challenges and opportunities and making decisions for the formulation and implementation of successful and sustainable marketing programs.",
        "prerequisites": "QST AC710 or AC711 (previous or concurrent)"
    },
    {
        "course_code": "QST MK 820",
        "course_title": "Consultative Selling",
        "description": "This course equips students to sell complex products and services via consultative selling integrated with digital customer engagement. Students learn through examples and role play to execute a five-step approach: 1. Connecting with Prospects through networking, social, and door-opening conversations, 2. Understanding Needs by qualifying leads, undertaking research and discovery conversations, 3. Addressing Needs by writing differentiating proposals and winning in the room 4. Closing the Sale by gaining buyer commitment, pricing-to- value and seamless contracting, 5. Building Trusted Relationships through personal engagement and customer blueprinting. Sessions are highly interactive featuring: Discussions with guest experts; Case studies; an RFP simulation; Role playing including \"The Price is Right Game\"; Video shorts; Student stories; Real- world best practices; and pitfalls."
    },
    {
        "course_code": "QST MK 835",
        "course_title": "ECommerce Strategy",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. This course examines eCommerce as a business model, a field of operations, and a set of disciplines. We will explore the fundamentals of eCommerce and the strategic importance of an eCommerce program within a company's overall strategy. Relevant topics will be explored using case studies, team projects, as well as a final exam. 1.5 cr",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 838",
        "course_title": "Behavior Change Practicum",
        "description": "Every organization -- be it government, private company or welfare agency -- is in the business of changing behavior. In this course, students will learn to apply insights from behavioral economics to effectively produce it. In teams, students will: (1) translate a real-time business or policy challenge into a specific behavior change project; (2) use the frameworks presented in class along with research from economics, psychology, marketing, and other related disciplines to develop possible interventions and/or frameworks for addressing the challenge; and (3) audit the decision-making process of various stakeholders to identify pain points and opportunities for behavior change. Previous organizations include Warby Parker, the World Bank, and FCLT Global."
    },
    {
        "course_code": "QST MK 841",
        "course_title": "Customer Driven Growth Strategies",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. Marketers' number one job is to grow the customer base (and sales) by developing and executing strategies to leverage existing and create new market opportunities. This class will be a combination of case discussions, workshops, speakers, and finally application to real companies. Students will identify, quantify, and leverage opportunities that facilitate growth utilizing real world scenarios. We will use the product and customer growth matrix to determine new product opportunities and frameworks to prioritize markets for entry. We will conduct qualitative and quantitative analyzes of company situations and then apply principles of marketing to provide solid recommendations from which companies can take action. This combination of academic and applied learning will provide a deep understanding of growth strategies needed to leverage market opportunities.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 842",
        "course_title": "Machine Learning for Business Analytics",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. This course introduces students to the foundational machine learning techniques that are transforming the way we do business. Machine learning relies on interdisciplinary techniques from statistics, linear algebra, and optimization to detect structure in large volumes of data and solve prediction problems. Students will gain a theoretical understanding of why the algorithms work, when they fail, and how they create value. They will also gain hands-on experience training machine learning models in Python and deriving insights and making predictions from real-world data. Prior programming experience (or IS833/IS834) is strongly recommended. Note: The course was previously offered under the title \"Digital Marketing Analytics,\" but does not overlap with MK876; students may take both courses for credit.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 845",
        "course_title": "Engaging Consumers in a Digital World",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. Digital technologies have transformed the marketing communications paradigm and the consumer decision making process. In particular, within this new paradigm, consumers are more likely to learn about new products and services from other consumers via online word-of-mouth and have more power to co-create products, experiences, and brand meaning with manufacturers and service providers. This course examines the implications of these changes for marketers. Specifically, the course examines how digital technology can be used to (a) engage consumers prior to purchase; (b) to enhance and augment the consumption experience; and (c) to build ongoing and long-lasting relationships with consumers post-purchase. These topics will be explored using case studies and a client-based project, as well as a final exam.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 852",
        "course_title": "Data Driven Marketing Decisions",
        "description": "Graduate Prerequisites: QST MK723 or MK724, QST QM716 or QM717 This course will focus on developing marketing strategies driven by marketing analytics. Topics covered include market segmentation, targeting, and positioning, and new product development. The course will draw on and extend students' understanding of issues related to quantitative analysis and principles of marketing. The course will use a combination of cases, lectures, and a hands-on project to develop these skills.",
        "prerequisites": "QST MK723 or MK724, QST QM716 or QM717"
    },
    {
        "course_code": "QST MK 854",
        "course_title": "Branding",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. This is a course about branding, and the ways that brands acquire and sustain value in the marketplace. Cases, readings, in-class discussions, and team/individual assignments are designed to provide: An appreciation of the strategic discipline of branding and its role in creating shareholder value; an understanding of brands as co-creations of consumers, marketers, and cultures, and brand management as a collaborative process of meaning management; a sound foundation in consumer-brand behavior to inform brand decisions; and a capacity to think creatively and precisely about the strategies and tactics involved in building, leveraging, defending, and sustaining strong brands. Select topics may include brand equity, brand (re)positioning, brand relationships, brand loyalty, brand community, open source branding, branded entertainment and other cultural branding strategies, internal branding, brand architecture design and portfolio strategy, brand leverage and extensions, brand metrics, crisis management, and brand stewardship. Guest speakers from branding services, consulting, and practice provide insights throughout the course. While this course has obvious relevance for those contemplating brand management careers in product or service markets, it is appropriate for a range of future professionals within for-profit and not-for-profit C2C and B2B worlds, and others who share a simple passion for branding.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 856",
        "course_title": "Consumer Insights",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. Marketing, in particular, begins and ends with the consumer -- from determining consumer needs to ensuring customer satisfaction. In this course, we will explore the most recent scientific research in marketing, psychology, and behavioral economics related to consumer behavior. We will develop your ability to understand and influence what people want, how people decide what and when to buy, and whether people will be satisfied or dissatisfied with their decisions. These psychological insights are particularly useful for marketing strategy, brand positioning, and marketing communication decisions, but also yield insight into common biases in judgment and decision making, beyond marketing, to which you would otherwise fall prey. Why people are willing to drive across town to save $5 on a tank of gasoline, for example, when they would not drive a minute to save $5 on a refrigerator. We will discuss some of these applications in class. In addition, we will examine the methodology of market research (specific to consumer behavior) to build the tools you will need to interpret and base decisions on it. Readings will include primary empirical research articles (e.g., Journal of Consumer Research articles), business journal articles, and research reviews (e.g., Harvard Business Review articles). The course includes lecture, discussion, an exam, and a team term project.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 859",
        "course_title": "Strategic Business Marketing",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. This course focuses on marketing to businesses and organizations rather than to consumers. Marketing to organizations is fundamentally different from marketing to consumers for a myriad of reasons related to customers (e.g., larger customers seeking customized offerings and prices; need for relationship building between suppliers and customers, etc.) and related to the role of marketing within the firm (e.g., greater level of customization of the offerings; need for closer interaction and alignment among marketing and manufacturing/R&D/product development, customer service, etc.). This course will provide students with the frameworks and tools to help develop an appreciation of these and other distinct differences, to understand the approaches used by successful firms in such contexts, and to create and analyze marketing strategy and tactics for marketing to organizations. Using a combination of cases, discussions of specific topics, a simulation, guest speakers, and a project, the course will cover several themes including platform businesses marketing, understanding the organization buying center, creating and capturing value for business customers, communicating the offering benefit stack, and developing and maintaining relationships with other organizations. This course is relevant for students interested in marketing to businesses as well as for those interested in consulting, investment banking, or venture capital settings, which primarily deal with marketing to other organizations.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 862",
        "course_title": "Marketing High-Tech Products",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. This course provides you with a good understanding of how marketing works in a high-tech context. When it comes to marketing, there are five important characteristics that make high-tech offerings (products and services) special: technological uncertainty, customer uncertainty, competitor volatility, high- tech offerings are often used not singly but in larger overall systems, and high-tech offerings often exhibit network externalities. These five characteristics have a big impact on the type of challenges, analysis, and marketing decisions made in high-tech industries. The overall purpose of this course is to impart concepts, tools, and frameworks that you can apply as you pursue careers as marketers of high-tech offerings, consultants, investment bankers, and service professionals. The key objectives of the course are to: Understand the special challenges involved in marketing high-tech products Learn how to analyze high-tech marketing problems which involve significant customer, market, and technological uncertainties; Examine approaches to improve the market orientation of, and the marketing-R&D interface in, high-tech companies; Understand the impact of diffusion of technology and adoption of innovation on targeting and segmentation decisions; Explore the effect of complementary products, databases, and systems on product and pricing decisions; Identify the challenges and drivers of success at different stages in a technology's life- cycle; and, Understand the concept of value networks and the role of complementors, partners, and competitors in high-tech industries.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 864",
        "course_title": "Pricing Strategy and Tactics",
        "description": "Graduate Prerequisites: QST MK723 or MK724, QST PL727 or PL730, QST QM716 or QM717 This course focuses on the practical needs of the marketing manager making pricing decisions. Students learn the techniques of strategic analysis necessary to price more profitably by evaluating the price sensitivity of buyers, determining relevant costs, anticipating and influencing competitors' pricing and formulating an appropriate pricing strategy.",
        "prerequisites": "QST MK723 or MK724, QST PL727 or PL730, QST QM716 or QM717"
    },
    {
        "course_code": "QST MK 867",
        "course_title": "Purpose-Led Marketing",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. Globalization, increasing transparency in business operations and the prevalence of social media have forever changed the way stakeholders view and interact with organizations. Societal and business imperatives are not only often considered compatible; they can be increasingly viewed as one and the same. People today often communicate, organize and engage based on mutual interests, and, generally, place greater trust in organizations and individuals that work for a better world. Marketing has often been referred to as the \"science of sales.\" Whether you are selling a product, an intervention or an idea, it can be a powerful tool for advancing social change in today's dynamic environment. The strategic integration of a relevant social purpose into a product, business or nonprofit organization through brand-building citizenship activities can drive consumer and donor recall, consideration, acquisition, retention and propensity to recommend. However, these efforts do not usually constitute a \"silver bullet\" and may not be the best solution to a business problem or societal need at all. In the worst cases, ill-conceived citizenship marketing strategies can result in damaging consequences. Practitioners must be pragmatic when engaging in marketing social change. Understanding how to apply best practice, identify opportunities, address challenges, engage stakeholders and innovate strategically are essential skills in this rapidly evolving sector. The purpose of this course is to provide students with an in-depth understanding of how marketing principles can be applied to create both short-term and lasting social change. Students will explore dimensions of the modern landscapes of brand, corporate and nonprofit \"citizenship\" and how they relate to marketing. Areas of study include: cause-related marketing and cause branding; nonprofit branding and social movements, as well as corporate social responsibility and shared value creation.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 870",
        "course_title": "Luxury Marketing",
        "description": "Graduate Prerequisites: QST MK 723 or QST MK 724. Introduction to the marketing of luxury goods and services. It explores the origin, the history, and the evolution of luxury and gives an overview of the global luxury industry. It highlights the specificities of marketing in the luxury sector. Luxury brands must manage a number of inherent paradoxes and tensions. Differences in a mass versus luxury marketing approach are discussed. Finally, the course focuses on examining the main challenges with which luxury brands are currently confronted. As markets are becoming increasingly polarized, the course is relevant to a wide range of marketing and business professionals who may have to \"premiumize\" their offerings or revitalize their brands through an upscale positioning. Through a combination of interactive discussions, cases, practical examples, and individual assignments, the course enables participants to take both a theoretical and practical approach to the luxury industry and its marketing practices.",
        "prerequisites": "QST MK 723 or QST MK 724."
    },
    {
        "course_code": "QST MK 878",
        "course_title": "Customer Analytics",
        "description": "Graduate Prerequisites: QST MK723 or MK724, QST QM716 or QM717, QST MK852 or IS833 The course will focus on managing marketing spend from the perspective of a marketing manager. The first module of the course is on customer analytics and will cover the fundamental frameworks needed for customer-centric marketing with topics such as customer lifetime value, customer acquisition and retention, and customer equity. The second module of the course focuses on assessing marketing performance and will cover decision support tools that can help brand and product managers make decisions with regard to marketing spending including advertising, pricing, and promotions. The course will require quantitative skills and will use a combination of cases, lectures, and a hands-on project.",
        "prerequisites": "QST MK723 or MK724, QST QM716 or QM717, QST MK852 or IS833"
    },
    {
        "course_code": "QST MK 914",
        "course_title": "Seminar in Consumer Behavior",
        "description": "This course is designed to familiarize students with the current major theoretical streams of research in consumer behavior. It is meant to instill in the student not only a knowledge of the current \"state of the art\" in consumer behavior research, but also an ability to apply behavioral science theory to consumer behavior research issues. It is expected that students will develop and refine the ability both to critically evaluate the theoretical contribution of articles in consumer behavior and to formulate theory-based hypotheses capable of advancing the discipline's understanding of consumer behavior."
    },
    {
        "course_code": "QST MK 915",
        "course_title": "Consumer Behavior II",
        "description": "Because firms that excel in developing deep insight into consumer behavior create and capture more value in the marketplace, it is critical for researchers to establish a strong foundation in consumer research. The present course serves as a companion to the MK914: Seminar in Consumer Behavior I, and considers what some have called \"The Cultural Interpretivist Turn\" in Marketing. This perspective calls for a broader conceptualization of the discipline, with greater attention to - phenomena and dynamics at the socio-cultural level, under-leveraged theoretical perspectives beyond psychology and economics, and grounded methodologies capable of situating consumer behavior in the context of people's lives. Topics include but are not limited to: Myth and Cultural Narratives; Semiotics; Materialism; Consumer-Brand Relationships; Consumer Socialization; Sub-Cultures of Gender, Lifestyle, Ethnicity, and Social Class; Communities and Tribes; Illicit Pleasures, Addictions, and High Risk Consumption; Politics of Consumption; and Consumer Well-Being."
    },
    {
        "course_code": "QST MK 927",
        "course_title": "Marketing Management and the Customer-Focused Firm",
        "description": "This course will familiarize doctoral students with various areas of investigation for problem-oriented academic marketing research pertinent to the research mission of the department: advancing the customer-focused firm. Discussion topics include but are not limited to the following strategies for gaining strategic advantage through the cultivation of marketing relationships: branding and brand equity, pricing, sales, customer relationship management and CRM, consumer-company identification, corporate social responsibility, consumer-to-consumer relationships and brand communities, retailing and customer service, product innovation, and product launch strategy. Through exposure to a strategic marketing perspective for the identification of research problem areas, this course will further socialize students into the process of developing research ideas and undertaking research, while stimulating the development of ideas for summer projects, qualifying papers, and dissertations."
    },
    {
        "course_code": "QST MK 928",
        "course_title": "Mathematical Modeling in Marketing",
        "description": "There are many decision problems in marketing that require mathematical modeling, using operations research/ management science approaches. This type of modeling is distinct from \"statistical modeling;\" this latter type of modeling is very worthy of study, and is heavily covered in various other courses you will take or have taken (e.g., QM915: Multivariate Analysis). The course consists mainly of discussing a variety of assigned journal articles in the various area of management, with the plurality illustrating marketing applications. The articles focus on optimization models. There are also lectures on the major optimization techniques (e.g., calculus, linear programming, decision analysis) emphasized in the course. The grading is based half on class participation and half on a required paper. Open to MBA students with instructor's permission. Must meet with faculty member to discuss course content and goals."
    },
    {
        "course_code": "QST MK 929",
        "course_title": "Marketing Management and the Customer-Focused Firm II",
        "description": "This course builds on material presented in MK927 to familiarize doctoral students with various areas of investigation for problem-oriented academic marketing research pertinent to the research mission of the department: advancing the customer-focused firm. Discussion topics concern strategies for gaining competitive advantage and include: establishing a market orientation, product strategy, product innovation and new product development, brand design and product aesthetics, co-creation and mass customization, pricing strategy, sales promotions, corporate social responsibility, cause marketing, stakeholder marketing, and the measurement of firm and marketing performance. Through exposure to a strategic marketing perspective for the identification of research problem areas, this course will further socialize students into the process of developing research ideas and undertaking research, while stimulating the development of ideas for summer projects, qualifying papers, and dissertations."
    },
    {
        "course_code": "QST MK 990",
        "course_title": "Current Topics Seminar",
        "description": "For PhD students in the Marketing department. Registered by permission only."
    },
    {
        "course_code": "QST MO 221",
        "course_title": "The Dynamics of Leading Organizations",
        "description": "Undergraduate Prerequisites: QST SM 131. This course is about understanding, analyzing, and navigating the complexities of contemporary organizational life. After taking this course, you will be able to: (1) Understand yourself, including your personal tendencies, and sharpen your ability to interact and communicate with others in ways that make you more effective at work; (2) Formulate strategies for collaborating, building effective teams, and carving out your role within them; (3) Analyze, predict, and influence others' behaviors, organizational hierarchies, power structures, and cultures; and (4) Apply the principles of organizational behavior to craft feedback, manage conflict, and lead in your work environments. This is done through in-class simulations, individual self-reflection, active participation in class, team exercises, exams, readings, and group projects and presentations. Effective Fall 2020, this course fulfills a single unit in the following BU Hub area: Teamwork/Collaboration. BU Hub Learn More Teamwork/Collaboration",
        "prerequisites": "QST SM 131.",
        "BU_Hub": [
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "QST MO 356",
        "course_title": "Leadership and Management of Social Enterprises",
        "description": "Undergraduate Prerequisites: QST SM131 or QST SI250 or QST SI480 or COM FT591 or SHA HF231; Sophomore standing A well-managed social enterprise can translate idealism into action. It can help create a world that is more sustainable, more compassionate, and more just. This course will explore the distinctive aspects of launching, leading, and growing an enterprise -- nonprofit or for-profit -- whose primary goal is social impact. We will study mission, strategy, marketing, ethics, entrepreneurship, and scaling. We will learn that success for social enterprise is driven less by a compelling story or a charismatic advocate than by diligent management and insightful, ethical leadership. Effective Fall 2021, this course fulfills a single unit in the following BU Hub area: Ethical Reasoning. BU Hub Learn More Ethical Reasoning",
        "prerequisites": "QST SM131 or QST SI250 or QST SI480 or COM FT591 or SHA HF231; Sophomore standing",
        "BU_Hub": [
            "Ethical Reasoning"
        ]
    },
    {
        "course_code": "QST MO 420",
        "course_title": "People Analytics",
        "description": "Undergraduate Prerequisites: QST BA222, or QST QM222 and CAS CS111 This course focuses on developments in people analytics, an evolving data- driven approach to employee decisions and practices. The course covers theory, practice, and methods that are critical for addressing people-related challenges at companies such as hiring, retaining, evaluating, rewarding performance, and managing teams and social networks, to name a few. By drawing on the latest company practices, research, and cases studies, this course will help you apply people analytics to achieve organizational objectives and to advance in your own career.",
        "prerequisites": "QST BA222, or QST QM222 and CAS CS111"
    },
    {
        "course_code": "QST MO 441",
        "course_title": "Human Resource Management",
        "description": "Undergraduate Prerequisites: QST MO 221. Introduces students to the field of human resource management (HRM). Emphasizes the strategic importance of effective human resource management to the success of any organization. Using readings, case studies and outside speakers, specific topics covered include: recruiting and selection, talent, diversity & inclusion, training and development, performance management and rewards and employee and labor relations. Particular attention is paid to the ways in which organizations' strategies and practices around these issues contribute to the strategic objectives of the organization. Individual and group projects enable students to develop skills in making decisions from both the human resource manager's and the general manager's perspective.",
        "prerequisites": "QST MO 221."
    },
    {
        "course_code": "QST MO 448",
        "course_title": "Negotiations",
        "description": "Undergraduate Prerequisites: Junior or senior standing. Pre-req for SHA students: SHA HF231 Negotiations are part of daily life inside of organizations and out; yet, effective strategies for negotiation are elusive. Across a variety of negotiation contexts, you will learn different frameworks for thinking about negotiations and best practices. Intellectually, there is an emphasis on the tensions and strategies around claiming and creating value. Practically, there is an emphasis on skill-building through hands-on exercises entailing both individual and team-based negotiations. Students are expected to gain confidence as negotiators through experiential learning.",
        "prerequisites": "Junior or senior standing. Pre-req for SHA students: SHA HF231"
    },
    {
        "course_code": "QST MO 460",
        "course_title": "The Leadership Challenge",
        "description": "Undergraduate Prerequisites: Junior or senior standing Required for Organizational Behavior concentrators. Do you want to develop your leadership skills? Are you interested in learning more about what makes an effective leader? Would you like to lead an initiative that has direct, real-world impact in the community? Then take on the Leadership Challenge! This course dives into the theory and practice of leadership, emphasizing the perspective that leaders are needed at all levels in organizations and society. In addition to studying the practices of effective leaders, the course focuses on developing your leadership competencies through active experimentation and reflection, designing and leading a team community service project, and building leadership, communication, and collaboration skills. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, The Individual in Community. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, The Individual in Community, Teamwork/Collaboration. BU Hub Learn More The Individual in CommunityOral and/or Signed CommunicationTeamwork/Collaboration",
        "prerequisites": "Junior or senior standing",
        "BU_Hub": [
            "The Individual in Community",
            "Oral and/or Signed Communication",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "QST MO 712",
        "course_title": "Leading Organizations and People",
        "description": "This course provides you with an opportunity to deepen your personal practice of management, enabling you to increase your effectiveness as both a manager and team member within your organization. Course content is based on behavioral science research findings as well as concepts and frameworks related to human behavior in an organizational context. Specifically, this course considers: 1) how to develop yourselves as managers, 2) how to work well within teams, 3) how to assess and manage interpersonal dynamics, 4) how to structure more effective organizations, and 5) how to manage organizational change. Tying all of these elements together, we devote particular attention to the traits, skills and behaviors that are indicative of good leadership and how organizations and managers can be transformed for better alignment with the business demands of the future."
    },
    {
        "course_code": "QST MO 713",
        "course_title": "Leading Organizations and People",
        "description": "This course introduces concepts, models and frameworks to help you become better managers of the organizations you work for, the teams you work in, the people you work with and your own professional development. Emphasis will be on behavioral science concepts and research findings related to the major challenge managers face -- how to organize individuals in order to fulfill the objectives and strategies of the firm. Topics that will be examined include: the nature and dynamics of the organization (organizational structure and culture, performance systems and metrics, reward systems, selection and socialization); the elements of individual leadership and personal development (power, decision-making, emotional intelligence, career development, developmental needs, feedback, and mentoring and coaching); managing change within organizational contexts (the dynamics and stages of organizational change and the skills and tactics employed by change agents); and the relationships between the firm and the external environment in which it operates. The course objective is to provide analytical skills and strategies, substantive knowledge, and a professional sensibility that will increase your ability to take effective action."
    },
    {
        "course_code": "QST MO 825",
        "course_title": "Future of Work",
        "description": "Graduate Prerequisites: QST MO 712 or QST MO 713; QST MO712 or QST MO713 This course is an exploration of the future (or, more accurately, futures) of work that allows students to interrogate changing realities of labor in different industries. Industry guests will supplement course materials designed first to lay out a history of work, and then explore the ways it is currently in flux around the world and across sectors. Students will do a deep dive into a self-selected line of work through which they will engage with questions covering workers' experience, technology, inclusion, and meaning.",
        "prerequisites": "QST MO 712 or QST MO 713; QST MO712 or QST MO713"
    },
    {
        "course_code": "QST MO 830",
        "course_title": "Leading Mission Driven Organizations",
        "description": "Mission-driven organizations are created in order to accomplish goals that extend beyond profits for stakeholders and owners. Missions vary, ranging from, among many others, improving health care, providing meaningful work opportunities, educating or protecting youth, safeguarding the planet, eradicating poverty, building sustainable organizations, and enabling spirituality. Such missions occur in the context of various organizations, including non-profit and for-profit, philanthropic and religious, public and private, governmental and non-governmental. This course focuses on leadership theories, frameworks, and practices that take seriously the nature of workers, including both professional staff and volunteers, and their reasons for choosing to work in such organizations. This course is designed to build the capacities of students to use specific tools related to leadership, conflict, and change that are particularly useful in leading mission- driven organizations, and enable them to develop particular insights about specific mission-driven organizations of interest, related to their effectiveness and capacities for change."
    },
    {
        "course_code": "QST MO 838",
        "course_title": "People Strategies to Drive Performance",
        "description": "Graduate Prerequisites: QST MO 712 or QST MO 713. Using readings, case studies and outside speakers, this course focuses on the perspective of the general manager and looks at the utilization of human capital to drive business and organizational performance. The ability to diagnose and improve the alignment between people strategy and business strategy is highly valued in today's economy. Leaders need to not only be able to think strategically and systematically about different aspects of managing an organization's human assets but also the development and implementation of policies and programs to achieve competitive advantage through people.",
        "prerequisites": "QST MO 712 or QST MO 713."
    },
    {
        "course_code": "QST MO 844",
        "course_title": "Managing Organizational Change",
        "description": "Graduate Prerequisites: QST MO 712 or QST MO 713. The premise of this course is that because change is the only constant in today's global business environment, the ability to create meaningful and sustained change through organizations is essential for your effectiveness as a leader. During the first half of the course, we examine frameworks, dynamics and concepts useful for understanding and navigating change processes, and apply them to gain insight into personal and organizational situations of change. In the second half, we explore the non-linear and ambiguous nature of change processes, and consider how to leverage this dynamism for creating fundamentally new ways of working required in the workplace of the future. This course is particularly relevant for those wishing to develop their leadership and consultation capabilities.",
        "prerequisites": "QST MO 712 or QST MO 713."
    },
    {
        "course_code": "QST MO 847",
        "course_title": "Managing High Performance Teams and Project Groups",
        "description": "This course introduces the challenges of leading and participating in teams and project groups. It emphasizes the role of leadership in composing teams, motivating members, and creating an environment in which teams and their members grow in capacity over time. This course will use cases, experiential exercises, and group projects to help students gain both knowledge of team dynamics and the skills to shape them."
    },
    {
        "course_code": "QST MO 848",
        "course_title": "Leadership Challenge",
        "description": "Graduate Prerequisites: QST MO 712 or QST MO 713. This course examines the essence of leadership; its relationship to managing; and the behaviors, attitudes and perspectives that distinguish leaders. Leadership is considered in a variety of ways: leadership in crises, at the top, in the middle, and in groups. Case studies, students' past experiences, instruments, and other learning activities provide opportunities for students to assess and develop their leadership talents.",
        "prerequisites": "QST MO 712 or QST MO 713."
    },
    {
        "course_code": "QST MO 853",
        "course_title": "Negotiations",
        "description": "Graduate Prerequisites: QST MO 712 or QST MO 713. Negotiations are part of daily life inside of organizations and out; yet, effective strategies for negotiation are elusive. Across a variety of negotiation contexts, you will learn different frameworks for thinking about negotiations and best practices. Intellectually, there is an emphasis on the tensions and strategies around claiming and creating value. Practically, there is an emphasis on skill-building through hands-on exercises entailing both individual and team-based negotiations. Students are expected to gain confidence as negotiators through experiential learning.",
        "prerequisites": "QST MO 712 or QST MO 713."
    },
    {
        "course_code": "QST MO 856",
        "course_title": "Mediation and Conflict Resolution",
        "description": "Graduate Prerequisites: QST MO 853. Conflict is an integral part of human interaction, and the way organizations approach and manage conflict between people impacts employee morale and attrition, and influences productivity and business outcomes. In order to manage conflict effectively, managers need to understand what causes conflict, how people behave in conflict, and how their responses influence outcomes. In this course students will learn how to identify conflict, assess its impact and respond accordingly. Students will compare different systems of dispute resolution and how to best apply them in the workplace. The course seeks to simulate this process by combining conceptual and experiential approaches, involving exercises, case studies, lectures, videos, feedback, and group work. This course qualifies as basic mediation training, consistent with the requirements of the Massachusetts court systems and Mediator's Confidentiality Statute.",
        "prerequisites": "QST MO 853."
    },
    {
        "course_code": "QST MO 858",
        "course_title": "Necessary Conversations",
        "description": "Graduate Prerequisites: QST MO 712 or QST MO 713. This course focuses on building your capacity to engage effectively in conversations that are necessary for you to thrive, professionally and personally, across a variety of roles and contexts. Each of us needs to be effective in providing and receiving feedback and help in our relationships with peers, subordinates, leaders, family members, friends. Amidst different power dynamics, we need to address interpersonal conflicts, dysfunctional team dynamics, destructive situations, and perceived injustices in ways that strengthen both outcomes and our relationships with others. As managers, we need to use conversation as a primary tool for clarifying and maintaining roles, task boundaries, and scope of authority when delegating to subordinates and working with peers. As leaders, we need to use conversation to navigate the inevitable fallout from significant leadership transitions, painful organizational events, strategic shifts, and larger societal issues that impact organizational life. As partners, we need to move into and through conversations that enable our relationships to grow rather than stagnate. The course integrates theory and practice to enable MBA students to develop knowledge, insight, and skill in conducting such necessary conversations.",
        "prerequisites": "QST MO 712 or QST MO 713."
    },
    {
        "course_code": "QST MO 860",
        "course_title": "People Analytics",
        "description": "Graduate Prerequisites: QST MO712 or MO713, QST QM716 or QM717 This course focuses on developments in People Analytics, an evolving data- driven approach to employee decisions and practices. The course covers theory, practice, and methods that are critical for addressing people- related challenges at companies, such as hiring, retaining, evaluating, rewarding performance, and managing teams and social networks, to name a few. By drawing on the latest company practices, research, and cases studies, this course will help students apply people analytics to achieve organizational objectives and to advance in their own career. While a good background in basic statistics and/or analytics is helpful, it is not required for success in the course. Students will gain experience using analytics in a safe learning environment. We will also focus on how to apply insights to align people strategies with the organization's broader goals.",
        "prerequisites": "QST MO712 or MO713, QST QM716 or QM717"
    },
    {
        "course_code": "QST MO 917",
        "course_title": "The Craft of Theorizing Research",
        "description": "Research projects are like gems that need polishing and the craft of polishing them to uncover a theoretical contribution can partly be learned. This intensive course is designed to help participants polish their gems-in- the- making and sharpen their emerging contributions. The seminar is primarily designed for doctoral students who have already collected and/or analyzed data. The common denominator for participants is that they be engaged in research projects reliant on qualitative or quantitative data (e.g., archives, interviews, field observations, and surveys) and be willing to share with the class a draft analytical memo, paper, or chapter from their research."
    },
    {
        "course_code": "QST MO 918",
        "course_title": "Seminar in Micro Organizational Behavior",
        "description": "Micro organizational behavior is the study of individual behavior and social processes in organizations. The goal of this doctoral course is to familiarize students with major conceptual frameworks, debates, and developments in the field of micro organizational behavior. This course will review the key literature in the study of individual behaviors, interpersonal relations, group dynamics, and the interplay between micro and macro dynamics in organizations. The readings and discussions will focus on core topics in the field, such as personality and individual differences, work attitudes, motivation, leadership, groups, ethics, culture, occupations, and change. This course is required of all first year doctoral students in Organizational Behavior and is open to other doctoral students with permission."
    },
    {
        "course_code": "QST MO 923",
        "course_title": "Field Studies Seminar",
        "description": "This doctoral seminar is designed to introduce students to the process of qualitative research and provide them an opportunity to enrich their understanding and cultivate skills required for collecting, analyzing, theorizing and writing up qualitative data. By the end of the course, they should be more sensitive and skilled researchers, better readers, and/or more informed gate keepers of qualitative research. They should also be better, e.g. less fearful and more knowledgeable, writers of research. To enable this, we will focus on core practices of observation and listening, discovery and validation, theorizing, and writing and re-writing as applied in the context of qualitative research projects. We will combine practical, hands-on experiences (e.g., conducting an interview, analyzing a piece of text, writing our way to clarity) with readings about research methodology and examination of articles using qualitative research. The course assignments primarily involve the practical application of a qualitative method or approach as informed by the practice, readings, class discussion and students' deliberation and integration of the various materials."
    },
    {
        "course_code": "QST MO 990",
        "course_title": "Current Topics Seminar",
        "description": "For PhD students in the Organizational Behavior department. Registered by permission only."
    },
    {
        "course_code": "QST MS 600",
        "course_title": "MSMS Launch",
        "description": "This experience introduces incoming students to the program structure, faculty, staff, and expectations. Via team-based activities, students gain an understanding of the curriculum, classmates, Boston University and Boston. Students are exposed to the value of and need for international intelligence, ethics, diversity and resources available to support these."
    },
    {
        "course_code": "QST MS 715",
        "course_title": "Customers and Markets",
        "description": "Although these activities could be considered components of marketing, this course takes the point of view that marketing is fundamentally about driving growth. No matter how we measure this growth (in terms of volume sold, revenues, or profits), it always starts with an understanding of how to create value for the customer. The most successful organizations understand that identifying, producing, delivering and capturing value is a strategic practice on which an enterprise thrives or dies. With so much on the line, growth cannot be relegated merely to the marketing department; it is a mindset to be embraced across the organization. This course provides students with an opportunity to deepen your understanding of the ever-changing world of marketing. It presents advanced concepts marketers in all companies are dealing with to grow their business."
    },
    {
        "course_code": "QST MS 716",
        "course_title": "Financial Decision Making",
        "description": "Finance is concerned with the efficient allocation of capital, maximizing operational cash flows and the management of financial risk. Capital is said to be efficiently allocated when the risk/return profile of the investment is in line with investor preferences with respect to risk, time and expected return. This course includes the basics of investment analysis: time-value of money, portfolio theory, risk-return tradeoffs and capital budgeting. Time-value of money refers to the valuation of differing values of expected cash flows across time and accounts for differing levels of expected risk. Portfolio theory refers to the optimization of the weights of investments such that the portfolio outperforms the average of the investments. This is accomplished through the minimization of unnecessary risk. Capital budgeting refers to the process of capital allocation within the business (by managers) such that the financial performance of the firm is maximized."
    },
    {
        "course_code": "QST MS 717",
        "course_title": "Business Context and Strategy",
        "description": "This course introduces students to issues associated with formulating and implementing business strategy. It draws on findings from various academic disciplines (e.g., economics, organization theory, sociology, accounting, and management policy) to build a fundamental understanding of how and why some firms achieve and sustain superior performance. Readings and cases lead towards understanding of the underlying economics affecting a firm's external and internal environments and the implications of these fundamental factors for affecting the practice of strategy design. The course is designed to challenge students both inside and outside of the classroom."
    },
    {
        "course_code": "QST MS 718",
        "course_title": "Competitive Business Simulation",
        "description": null
    },
    {
        "course_code": "QST MS 742",
        "course_title": "Financial Reporting and Analysis",
        "description": "\"If you can measure it, you can manage it\" is an axiom of management. Accounting is the language of business measurement, the means by which business describes what they do, why they do it, and the value that it generates. In this course, you will be introduced to this language via financial statements: corporate reports, balance sheets, earnings and cash flow analyses, along with CVP-based analysis and decision making."
    },
    {
        "course_code": "QST MS 743",
        "course_title": "Quantitative Methods for Management Decisions",
        "description": "This course introduces students to statistics and probability, the means by which we analyze customers, markets, firms, industries...any and all aspects of the business experience. The goal is to teach students tools and techniques for analyzing data with an appreciation for the theory underpinning such analyses. How do we collect and analyze data in an unbiased manner?"
    },
    {
        "course_code": "QST MS 744",
        "course_title": "People, Teams, and Organizations",
        "description": "This course examines how teams function, how individuals within those teams operate, and how team members can deal with the sometimes tricky dynamics of working with others. The course is largely experiential, and involves individual introspection, one-on-one interactions with others, group exercises, and class discussion."
    },
    {
        "course_code": "QST MS 747",
        "course_title": "Project Management and Control",
        "description": "In this course, students will learn how to use the concepts, tools and techniques of project management in order to successfully manage projects. System development project failures are generally failures of management, not failures of technology. Good management, along with an understanding of the appropriate use of technology, is therefore essential. Students will learn how to apply the concepts, tools and techniques of project management in today's dynamic, digital business environment, where projects must be brought to completion under increasingly compressed timeframes and where decisions must be made under conditions of uncertainty"
    },
    {
        "course_code": "QST MS 749",
        "course_title": "Executive Communications A",
        "description": "Persuasive written, oral, and interpersonal communications are essential skills that are required for success in every business discipline. In this class, students will learn how to communicate clearly and persuasively, and to connect authentically with their audience, in a way that inspires action. Students will learn to take a point of view on current business issues, support it with logic and evidence, and express it effectively in multiple media, ranging from written to verbal, and from formal to extemporaneous. Best practices for both in-person and virtual remote interactions will be explored and practiced. Coaching will be offered for client project meetings and presentations."
    },
    {
        "course_code": "QST MS 751",
        "course_title": "Digital Transformation and Growth",
        "description": "This course introduces students to the challenges and best practices in driving growth through enterprise-wide digital transformation. It builds a fundamental understanding of the data and technology drivers of transformation and the main approaches to harness data and technology to grow their businesses by transforming their sales model, customer experiences or their business/operating model. The course will explore the reasons transformations fail. Students will learn how an employee centric approach to organization development can overcome many of the key reasons for failure."
    },
    {
        "course_code": "QST MS 753",
        "course_title": "Negotiation and Conflict Management",
        "description": "This course explores the skills strategies and tactics of both collaborative and competitive negotiations. In addition, we look at team negotiations, multi-party negotiations, agency, stakeholder analysis, preparation, and conflict resolution. The course is largely experiential, and involves individual introspection, one-on-one interactions with others, group exercises, and class discussion"
    },
    {
        "course_code": "QST MS 756",
        "course_title": "Leadership and Change Management",
        "description": "The focus of this course is on leadership from a variety of perspectives: organizational leadership in the external environment, as well as leadership at the top, middle, and lower levels inside organizations. We look leadership from a behavioral, emotional intelligence, and situational point of view, developing students' awareness, mindset, and skills in the process. In addition, we explore the challenges, theories, and skills of change management."
    },
    {
        "course_code": "QST MS 757",
        "course_title": "Innovation and Entrepreneurship",
        "description": "This course introduces students to the innovation processes, such as design thinking, and various types and models of innovation. Students will learn current approaches to developing value for innovators, companies, societies, and economies through entrepreneurship. The course will explore various contexts for innovation and entrepreneurship, including new ventures, mature companies, and foreign market entry."
    },
    {
        "course_code": "QST MS 759",
        "course_title": "Executive Communications B",
        "description": "Persuasive written, oral, and interpersonal communications are essential skills that are required for success in every business discipline. In this class, students will learn how to communicate clearly and persuasively, and to connect authentically with their audience, in a way that inspires action. Students will learn to take a point of view on current business issues, support it with logic and evidence, and express it effectively in multiple media, ranging from written to verbal, and from formal to extemporaneous. Best practices for both in-person and virtual remote interactions will be explored and practiced. Coaching will be offered for client project meetings and presentations."
    },
    {
        "course_code": "QST MS 764",
        "course_title": "Insights and Analytics Client",
        "description": null
    },
    {
        "course_code": "QST MS 765",
        "course_title": "Digital Marketing Client Project",
        "description": null
    },
    {
        "course_code": "QST MS 766",
        "course_title": "Customer Experience Client Project",
        "description": null
    },
    {
        "course_code": "QST MS 770",
        "course_title": "Data Visualization",
        "description": "The ability to translate data into visuals can often make the difference between success and failure. The goal of this course is to enable students to use the most common data visualization applications such as Tableau or Microsoft Power BI to communicate data. The course will begin with querying relationship databases, integrating multiple data sources and data validation, followed by choosing the most proper visualization option, creating automated dashboards, and building an overall visual system."
    },
    {
        "course_code": "QST MS 771",
        "course_title": "Product Management",
        "description": "This course introduces students to issues and best practices in successfully optimizing the value of goods and services over their lifetime. The goal of the course is to help students understand the value a product delivers to customers in a competitive environment. Students will build foundational skills in product portfolio management, lifecycle management, pricing and feature bundling and channel strategy."
    },
    {
        "course_code": "QST MS 772",
        "course_title": "Product Development",
        "description": "This course builds on design thinking concepts by helping students use a foundational set of innovation and development tools to convert customer insights into tangible offers. The goal of the course is to enable students to contribute to a development teams' ability to deliver innovation to the market through ideation, concepting, prototyping, piloting, and launch. Students will learn to deploy tools at each step and learn ways to include customer feedback in an iterative way."
    },
    {
        "course_code": "QST MS 773",
        "course_title": "Customer Data Analysis",
        "description": "This course seeks to familiarize students with customer data analysis related to digital marketing and sales, customer experience, and product management. The goal of this course is to help students uncover insights along the customer's journey as they move in stages of awareness, intent, conversion, and retention. Students will build foundational skills in analyzing customer data."
    },
    {
        "course_code": "QST MS 774",
        "course_title": "Digital Marketing Analytics",
        "description": "This is an introductory course on Digital Marketing emphasizing analytics that seeks to familiarize students with digital marketing tactics. At the heart of marketing lies consumers and their marketing journey through the stages of awareness, intent, conversion, and finally retention. In this course, we will learn how digital has revolutionized the interactions between firms and consumers along this journey. Digital offers powerful tactics to reach consumers along the funnel: online display ads raise awareness, search listings reach consumers with intent, on-site e-commerce marketing facilitates conversion, and social media both energizes and retains customers. The course develops essential data analytics skills--critical thinking, data mining, experimental analysis, and design--applied to ad campaigns, ad attribution, and social media data"
    },
    {
        "course_code": "QST MS 775",
        "course_title": "Business Impact Modeling",
        "description": "The ability to take on unstructured problems and generate useful insights/solutions is something that cannot easily be taught. But, it can certainly be learnt through practice and guidance. For most quantitative problems in graduate courses, the decision options, goals, and analytical approaches are pre-defined. In practice, however, business problems are usually ill-defined, \"messy\", where the decisions are initially ambiguous, goals are unclear, and the relationship between decisions and outcomes are indeterminate. While each business problem is distinctive, a disciplined approach to problem solving can be incredibly useful across many career contexts. The concepts and exercises in this course will sharpen our professional ability to structure a messy problem and do some disciplined analysis on it. Examples will be drawn from Strategy, Operations, Technology Management, Marketing, and Finance to expose us to the broad applications of the concepts and tools learned in this class."
    },
    {
        "course_code": "QST MX 700",
        "course_title": "Online MBA Launch",
        "description": "During this module, students are introduced to the various learning platforms of the program, meet their peers, and learn about important university and Questrom policies and resources. In addition, students receive tips and best practices for learning success in an online learning environment."
    },
    {
        "course_code": "QST MX 710",
        "course_title": "Creating Value for Business and Society",
        "description": "Graduate Prerequisites: QST MX 700. This module discusses the role of the manager in business and society. Topics include the economic foundations of business, the impact of digital transformation and information, the power of the consumer in co-creation as well as other global business forces on how managers both capture and create value for society.",
        "prerequisites": "QST MX 700."
    },
    {
        "course_code": "QST MX 720",
        "course_title": "Managing Performance with Data",
        "description": "Graduate Prerequisites: QST MX 710. Students learn the role data plays in managing the performance of the organization. Topics include: analyzing financial statements and accounting metrics, financial analysis for business planning, using statistics to drive business decisions, and metrics for financial, marketing, and operational performance.",
        "prerequisites": "QST MX 710."
    },
    {
        "course_code": "QST MX 730",
        "course_title": "Leading with Integrity",
        "description": "Graduate Prerequisites: QST MX 710. This module discusses the role of human capital in the organization, as well as key principles of leadership and ethical decision-making. Topics include: developing a global and diverse work-force, leading through change, managing conflict, power, and politics, and leveraging high-performance teams.",
        "prerequisites": "QST MX 710."
    },
    {
        "course_code": "QST MX 740",
        "course_title": "Managing Risk",
        "description": "Graduate Prerequisites: QST MX 710 ; QST MX 720 ; QST MX 730. Identifying and managing risk is critical to effectively leading in today's business environment. Topics include: assessing environmental, social, regulatory, financial, operational and brand risk; and then developing processes for measuring, monitoring and when possible managing those risks.",
        "prerequisites": "QST MX 710 ; QST MX 720 ; QST MX 730."
    },
    {
        "course_code": "QST MX 750",
        "course_title": "Leveraging Global Opportunities",
        "description": "Undergraduate Prerequisites: QST MX 710 or QST MX 720 or QST MX 730. Graduate Prerequisites: QST MX 710 ; QST MX 720 ; QST MX 730. The world of business is changing at a rate faster than ever in history requiring leaders to identify and implement strategies for differentiation. Topics include: developing competitive strategies, managing the marketing mix for target segments, optimizing the global value chain, and analyzing global markets and trade systems.",
        "prerequisites": "QST MX 710 or QST MX 720 or QST MX 730."
    },
    {
        "course_code": "QST MX 760",
        "course_title": "Fostering an Innovative Mindset",
        "description": "Undergraduate Prerequisites: QST MX 710 or QST MX 720 or QST MX 730. Graduate Prerequisites: QST MX 710 ; QST MX 720 ; QST MX 730. Leaders in today's organizations must work to understand and identify creative solutions to leverage known and unknown opportunities. Topics include: applying principles of design-thinking, managing the innovation portfolio, analyzing growth opportunities, and driving corporate and entrepreneurial innovation.",
        "prerequisites": "QST MX 710 or QST MX 720 or QST MX 730."
    },
    {
        "course_code": "QST OM 323",
        "course_title": "Operations and Supply Chain Management",
        "description": "Undergraduate Prerequisites: QST AC221; MO221; QM221; QM222 or BA222; SM131; SM132; SM275 Component of QST SM323, The Cross Functional Core. Focuses on the elements of operations management that are of particular importance in the context of new product development. These include: product and process design, process analysis, supply chain configuration, inventory management, and capacity and production planning. A semester-long business plan explores the interaction between operations management and marketing, information systems, and finance decisions.",
        "prerequisites": "QST AC221; MO221; QM221; QM222 or BA222; SM131; SM132; SM275"
    },
    {
        "course_code": "QST OM 353",
        "course_title": "Project Management",
        "description": "Undergraduate Prerequisites: QST SM131 and sophomore standing Formerly OM453. Focuses on project management from two perspectives. First, the course explores management of projects on a day-to-day basis at the functional, operational level, dealing with the management of tasks, resources, risks and timelines within an individual project. The course also covers project management on a more strategic level, program management, which identifies linkages between and among a portfolio of projects at the business unit or firm level. The course covers the tools, techniques, roles, and responsibilities that are critical in managing programs effectively and managing projects to completion.",
        "prerequisites": "QST SM131 and sophomore standing"
    },
    {
        "course_code": "QST OM 440",
        "course_title": "Supply Chain Strategy",
        "description": "Undergraduate Prerequisites: QST OM 323. Explores the ability of an organization's operations to satisfy its strategic requirements by investigating the influence of decisions made about the structure capacities, facilities, technology, and vertical integration and infrastructure workforces, quality, production planning and control, and organization of an organization's operations and its capabilities. These decisions are considered in the context of different types of performance improvement plans organizations use: quality management, lean, reengineering, supply chain management, strategic alliances, and performance management. 4 cr.",
        "prerequisites": "QST OM 323."
    },
    {
        "course_code": "QST OM 441",
        "course_title": "Supply Chain Analysis",
        "description": "Undergraduate Prerequisites: QST OM 323. Presents tools and modeling frameworks that are relevant to solving today's supply chain problems. The class is a mixture of case discussions, lectures, games, and outside speakers. Case discussions cover subjects including designing new-product supply chains, optimizing inventory levels, quick response, and capacity management. Lectures provide the theoretical foundation for the course; the major subjects are inventory theory and forecasting. Although the course is not overly focused on mathematics, enough detail will be provided so that students can apply the material in practice. Games including the distribution game, the OPT game, and the Beer Game reinforce the concepts in a constructive way. Finally, outside speakers present real-world examples of how supply chain models are being developed in practice. This course is designed for students that will be working in consulting or supply chain management after graduation. For students majoring in areas like Finance or Marketing, it is a solid exposure to an area that is integral to any product-focused company. 4 cr.",
        "prerequisites": "QST OM 323."
    },
    {
        "course_code": "QST OM 447",
        "course_title": "Operations Management in Service Sector",
        "description": "Undergraduate Prerequisites: QST OM 323. Introduces students to the special challenges of designing and managing service operations. The course focusses on the problems and opportunities presented by the presence of the customer in the operation which creates and delivers the service; on professional service operations; and on systematic ways to improve performance in service operations. Students carry out a small project developing a new service and the operation which will deliver it. The course demonstrates that a service manager must combine operations, marketing, and human resource skills into an integrated service system general manager approach. The course incorporates the following topics: service strategy, service system design, service quality, professional service operations, improvement programs in services, and multisite service operations.",
        "prerequisites": "QST OM 323."
    },
    {
        "course_code": "QST OM 451",
        "course_title": "Environmentally Sustainable Supply Chains",
        "description": "Undergraduate Prerequisites: QST BA222, QST QM222, CAS MA116, CAS MA214, CAS EC204, CAS EC304, ENGME366, or ENG EK381 This course explores initiatives that enable a company to reduce its environmental impact. We will study the initiatives based on where the impact occurs in the supply chain: within the four walls of the company, at extended suppliers, in logistics, and at customer or use phase. We will start with making a business case for sustainability, learning about the complex structure of supply chains, and different ways to assess environmental impact. In addition, we will cover food waste, sustainable agriculture, green product design, eco-labeling, sustainable business models, and supply chain risk management. 4 cr.",
        "prerequisites": "QST BA222, QST QM222, CAS MA116, CAS MA214, CAS EC204, CAS EC304, ENGME366, or ENG EK381"
    },
    {
        "course_code": "QST OM 467",
        "course_title": "Global Sourcing",
        "description": "Undergraduate Prerequisites: QST OM 323. Develops an understanding of the nature of international problems associated with the supply, distribution, and sourcing of products. Issues such as the operational support of market development in foreign countries, international sourcing, country analysis, and the management of supply and distribution activities are covered. A team project is required.",
        "prerequisites": "QST OM 323."
    },
    {
        "course_code": "QST OM 498",
        "course_title": "Directed Study in Operations and Technology Management",
        "description": "Directed study in Operations and Technology Management. 2 or 4 cr. Application available on Undergraduate Program website."
    },
    {
        "course_code": "QST OM 725",
        "course_title": "Creating Value Through Operations and Technology",
        "description": "This MBA core course is case-oriented and focuses on topics of use to managers in any environment: process analysis, process improvement, supply chain management, and strategic operations decision-making. The course emphasizes the importance of effectiveness and efficiency and evaluates the potential trade-offs between them."
    },
    {
        "course_code": "QST OM 726",
        "course_title": "Creating Value Through Operations and Technology",
        "description": "Graduate Prerequisites: QST AC710 or AC711, QST MO712 or MO713, QST QM716 or QM717 (Recommended: QST MK723 or MK724 or QST FE721 or FE722) This MBA core course is case-oriented and focuses on topics of use to managers in any environment: process analysis, process improvement, supply chain management, and strategic operations decision- making. The course emphasizes the importance of effectiveness and efficiency and evaluates the potential trade-offs between them.",
        "prerequisites": "QST AC710 or AC711, QST MO712 or MO713, QST QM716 or QM717 (Recommended: QST MK723 or MK724 or QST FE721 or FE722)"
    },
    {
        "course_code": "QST OM 832",
        "course_title": "Blockchain and Social Impact",
        "description": "Graduate Prerequisites: QST OM725 or OM726, QST QM716 or QM717 Blockchain technology is transforming societies by decentralizing institutional systems and reducing the need for intermediaries. This course aims to help students understand blockchain technology and the unique business models it enables in various industries. Students will learn how blockchains work, and how their properties enable business models that have never previously been possible. Through an analysis of current programs with existing use cases as well as future models, the course will prepare students to implement models today while anticipating the changes that newer models will bring to the sector",
        "prerequisites": "QST OM725 or OM726, QST QM716 or QM717"
    },
    {
        "course_code": "QST OM 840",
        "course_title": "Improving Organizational Performance with Analytics",
        "description": "Graduate Prerequisites: QST OM725 or OM726, QST QM716 or QM717 This course covers a number of analytical techniques that help improve and control product and process outcomes. These techniques are derived from Lean and Six Sigma, which are powerful improvement methodologies that promote product/process improvement, cost reduction and significant enhancement of bottom-line profitability. During the course, students will pursue an improvement project at an organization of their choice. They will prepare a detailed plan for the project, which outlines various elements including: voice of the customer, project charter, statistical process control charts, process capability ratios, process map, design and analysis of experiments, risk response matrix, and recommendations for improvement. These skills are useful for students considering a career in consulting.",
        "prerequisites": "QST OM725 or OM726, QST QM716 or QM717"
    },
    {
        "course_code": "QST OM 851",
        "course_title": "Environmentally Sustainable Supply Chains",
        "description": "This course examines supply chain practices that reduce environmental impact for a firm These include eco-efficiency initiatives such as reduction in waste, energy and water usage, green logistics, product design for recycling, and supplier management. It covers additional topics such as complexity of supply chains, environmental impact assessment, the circular economy, food waste, eco- labeling, and sustainable business models (e.g., through servicing)."
    },
    {
        "course_code": "QST OM 855",
        "course_title": "Project Management",
        "description": "Graduate Prerequisites: QST OM725 or OM726 Projects are increasingly the way that work gets done in companies of all types and sizes. In this new course you will learn the strategic dimensions of project management, including critical aspects of project selection, definition, planning, execution, and monitoring. Concepts and approaches for dealing with complexity, uncertainty, vague mandates, temporary staff, partners, stakeholders, dynamic risk, and time-critical deadlines are emphasized. Cases and readings cover a wide range of industry and organizational contexts. This course requires that students apply these topics and considerations to a real project of their choice either by analysis of publicly available information or direct field study. Many MBAs are tested on the job through tough assignments in project settings. Your performance there is highly visible. Doing especially well can accelerate your subsequent career opportunities. Prepare now for success in strategic project management by developing the skills and perspectives covered in OM855!",
        "prerequisites": "QST OM725 or OM726"
    },
    {
        "course_code": "QST OM 880",
        "course_title": "Product Design and Development",
        "description": "Graduate Prerequisites: QST OM725 or OM726 This course explores central managerial challenges in the effective design, development, and introduction of new products. Topics covered include reducing the time to market while meeting cost and quality targets; managing cross-functional projects and inherent technological risks while keeping a focus on customer requirements; and integrated problem-solving by industrial designers, engineers, manufactures, and marketing specialists. [Case studies, readings, guest lecturers, field project]",
        "prerequisites": "QST OM725 or OM726"
    },
    {
        "course_code": "QST OM 921",
        "course_title": "App Prob Mdls",
        "description": null
    },
    {
        "course_code": "QST OM 922",
        "course_title": "Theory of Technology and Operations Management",
        "description": "This seminar's objective is to expose the students to the traditional research associated with Operations Management. Early work done in the areas of inventory, scheduling, facility layout and logistics are generally considered the foundation on which traditional OM research has built. While highly quantitative, the seminar focuses on the means by which the research was (1) conducted, (2) linked to real problems, (3) implemented (or not implemented), and (4) the research opportunities that have been or could be exploited."
    },
    {
        "course_code": "QST OM 926",
        "course_title": "Supp Chain Mods",
        "description": null
    },
    {
        "course_code": "QST OM 990",
        "course_title": "Current Topics Seminar",
        "description": "For PhD students in the Operations Management department. Registered by permission only."
    },
    {
        "course_code": "QST PL 330",
        "course_title": "The U.S. Healthcare System in Transition",
        "description": "Undergraduate Prerequisites: Sophomore standing Formerly PL430. The U.S. health care system has undergone sweeping change as a result of the Patient Protection and Affordable Care Act (ACA) of 2010. Knowledge of how the reform law is affecting health care organizations, health professionals, consumers, and American businesses is essential for everyone, especially those planning careers in management or business. This rigorous seminar, which counts toward the Health & Life Sciences concentration and the Law and Public Policy concentration, provides an in-depth look at the economic, political, social and organizational challenges facing the nation as attempts to repeal-and-replace the ACA are debated by Congress. Students read and analyze articles, business cases, issue briefs, and legal opinions from diverse perspectives to learn how the U.S. health care system came to be and how it will change in the future. Effective Spring 2021, this course fulfills a single unit in the following BU Hub area: Social Inquiry II. BU Hub Learn More Social Inquiry II",
        "prerequisites": "Sophomore standing",
        "BU_Hub": [
            "Social Inquiry II"
        ]
    },
    {
        "course_code": "QST PL 498",
        "course_title": "Directed Study in Markets, Public Policy, and Law",
        "description": "Directed study in Markets and Public Policy. 2 or 4 cr. Application available on Undergraduate Program website"
    },
    {
        "course_code": "QST PL 705",
        "course_title": "Introduction to Business Law",
        "description": "This course will survey contemporary issues in selected areas of law and ethics. We will introduce pivotal areas of law, so that students begin to anticipate legal problems, analyze how to avoid them, and realize how legal principles can be employed to add value in their chosen fields. The subjects are torts, contracts, employment law, securities regulation and corporate governance. We expect that this overview of a few disciplines will encourage students to explore other legal topics relevant to their business interests. We will also offer an analytic structure that enables students to identify ethical issues in business, analyze options and make choices consistent with their own values."
    },
    {
        "course_code": "QST PL 727",
        "course_title": "Organizations, Markets, and Society",
        "description": "Understanding and analyzing the core strategic decisions facing businesses in competitive markets. Students will examine how businesses achieve their fundamental goals given the need to produce goods and services efficiently and a market environment reflecting consumer preferences (demand) and the strategies and strengths of competitors. Students will develop analytic skills necessary for understanding core business models and how different models create value for the business as well as the larger society."
    },
    {
        "course_code": "QST PL 730",
        "course_title": "Economics and Management Decisions",
        "description": "Graduate Prerequisites: QST MO712 or MO713 (QST QM716 or QM717 recommended) The aim of the course is to present many of the decision problems managers face and to present the economic analysis they need to guide these decisions. Microeconomic tools are used to structure complicated decision problems about production, pricing, investment, and other strategic issues, address uncertainty through probabilistic forecasts and sequential decisions. An important part of the course is to develop an understanding of the external environment in which firms operate by analyzing the implications of market structure, macroeconomic developments and policy, and other forms of public policy toward business.",
        "prerequisites": "QST MO712 or MO713 (QST QM716 or QM717 recommended)"
    },
    {
        "course_code": "QST PL 834",
        "course_title": "Macroeconomics in the Global Environment",
        "description": "Macroeconomics is the study of the aggregate behavior of global market participants, i.e. consumers, firms, workers, governments, central banks, foreign investors. Decision making by investment bankers, product/sales managers, policy makers, or consumers inevitably rely on an understanding of the main forces driving GDP, inflation, unemployment, interest rates, and exchange rates. Consider these questions: 1. Should new consumer durable products be launched during recessions? 2. Are countries that experience high productivity growth good investment targets? 3. Will interest rates drop if the US government starts buying back its debt? 4. With significant liquidity demands by the US economy from the public sector, the household sector and businesses, what explains the low US interest rates? Are these factors expected to keep interest rates low also in the future? 5. Can the Euro boost productivity in Europe in the medium to long run and what are the competitiveness challenges for US businesses of such changes? 6. What are the economic effects of wars and how should they be financed? These and other issues will come up in the course. The main goal of this course is to provide a coherent framework that you can use to understand economic events as you confront them in your work environment."
    },
    {
        "course_code": "QST PL 843",
        "course_title": "Business Law and Discrimination",
        "description": "Many companies struggle with how to support diverse employees, and the need to do so has become even more urgent in the wake of events like the death of George Floyd. Navigating these issues requires understanding how the lived experiences varies systematically among different ethnic groups, genders, gender identities, and sexual orientation. Successfully addressing inequities and adopting practical solutions necessitates understanding the history of racism, sexism, and other \"isms\" in America. This course will address these and other relevant issues in the context of the corporate environment. It will cover doctrinal issues regarding the ethical and legal obligations of corporations as it relates to managing discrimination in the workplace (e.g., history of antidiscrimination legislation, Title VII of the Civil Rights Act of 1964), but will also delve into some of the more practical aspects of the tools and techniques companies can or should adopt to achieve a more inclusive work environment."
    },
    {
        "course_code": "QST PL 855",
        "course_title": "Energy Sector Market Dynamics",
        "description": "This course is designed as a multi-dimensional approach to understanding the energy sector. This includes production, development, distribution, financing, and consumption relating to the two distinct sectors - Power Generation and Transportation, both domestically and internationally. For Power Generation, we will explore the fundamentals of Generation, Transmission (G&T), and Distribution as well as major feedstocks, including wind, solar, nuclear, natural gas, and coal. This includes an in-depth discussion of both challenges and opportunities inherent to altering the current system."
    },
    {
        "course_code": "QST PL 861",
        "course_title": "Emerging Issues in Business and Law",
        "description": "You ask your outside lawyer or your company's legal department whether you can undertake some activity without violating the law. You are annoyed when you are told \"Well, maybe. It depends\". You want a yes-or-no answer, not a game of twenty questions. Why can't your lawyers give you a straight answer? Why do they make everything more complicated? What language are they speaking? Most business people ask these questions. If you do business you cannot avoid dealing with lawyers. You can allow your interactions with lawyers to frustrate you, or you can learn how lawyers think so that you can better manage them. Emerging Issues in Business Law introduces graduate business students to fundamentals of legal analysis by focusing on timely legal problems of particular interest to business. Students develop familiarity with substantive legal principles and leave the course with the ability to recognize legal issues, discuss them intelligently, and understand why the lawyers seem incapable of giving a simple answer. The course uses lectures to provide a common foundation of knowledge. It is primarily discussion based, using a question and answer format to engage students in the process of legal analysis."
    },
    {
        "course_code": "QST PL 945",
        "course_title": "Behav Econ Sem",
        "description": null
    },
    {
        "course_code": "QST QM 221",
        "course_title": "Probabilistic and Statistical Decision-Making for Management",
        "description": "Undergraduate Prerequisites: QST SM131; CAS MA120, MA121 or MA123 previous or concurrent. Exposes students to the fundamentals of probability, decision analysis, and statistics, and their application to business. Topics include probability, decision analysis, distributions, sampling, estimation, hypothesis testing, and chi-square. Effective Fall 2018, this course fulfills a single unit in the following BU Hub area: Quantitative Reasoning I. BU Hub Learn More Quantitative Reasoning I",
        "prerequisites": "QST SM131; CAS MA120, MA121 or MA123 previous or concurrent.",
        "BU_Hub": [
            "Quantitative Reasoning I"
        ]
    },
    {
        "course_code": "QST QM 222",
        "course_title": "Modeling Business Decisions and Market Outcomes",
        "description": "Undergraduate Prerequisites: CAS EC101, QST QM221, and QST SM131 Examines the use of economic and statistical tools for making business decisions. The course emphasizes linking data analysis to spreadsheet modeling of decision making. Topics include multiple regression, causal inference, forecasting, demand modeling, and optimization. Case studies apply concepts to practical business problems. Effective Fall 2018, this course fulfills a single unit in the following BU Hub area: Quantitative Reasoning II. BU Hub Learn More Quantitative Reasoning II",
        "prerequisites": "CAS EC101, QST QM221, and QST SM131",
        "BU_Hub": [
            "Quantitative Reasoning II"
        ]
    },
    {
        "course_code": "QST QM 323",
        "course_title": "Analytics",
        "description": "Undergraduate Prerequisites: QST AC221; MO221; QM221; QM222 or BA222; SM131; SM132; SM275 Component of QST SM 323, The Cross Functional Core. Teaches quantitative methods and modeling techniques that will improve the student's ability to make informed decisions in an uncertain world. The two major modules of the course are models for optimal decision-making and decision- making under uncertainty. The first module focuses on methods and predictive models for decision-making; how optimization models are used to identify the best choice; and how choices change in response to changes in the model's parameters (sensitivity analysis). The second module covers the measurement and management of risk and Monte Carlo simulation. Throughout the semester, we will perform hands-on analysis that will improve Excel modeling skills; discuss the ethical use of data analytics; and learn to recognize pitfalls and biases in quantitative decision-making. cr. N",
        "prerequisites": "QST AC221; MO221; QM221; QM222 or BA222; SM131; SM132; SM275"
    },
    {
        "course_code": "QST QM 717",
        "course_title": "Data Analysis for Managerial Decision-Making",
        "description": "Graduate Prerequisites: QST MO 712 or QST MO 713. The overall goal of this course is to improve student ability to learn from data, specifically to 1) assess the validity of conclusions that have been drawn from statistical analyses; 2) recognize the extent to which variation characterizes products and processes, and understand the implications of variation on organizational decisions when interpreting data; and 3) portray, summarize and analyze data to support operational and strategic decisions associated with the core business models. Students will increase their understanding of the use of probabilities to reflect uncertainty; how to interpret data in light of uncertainty to assess risk; and how to build and interpret regression models, which can be used to inform core business and organizational decisions.",
        "prerequisites": "QST MO 712 or QST MO 713."
    },
    {
        "course_code": "QST QM 877",
        "course_title": "Intro to Python Bootcamp",
        "description": "In this Bootcamp, students will learn the most essential aspects of Python programming. The topics are tailored toward data analysis; no prior programming experience is required. We will cover variables, data types and data structures, DataFrames, conditionals, loops, and functions. We will also cover reading and writing raw files and the core APIs in analysis and visualization. With the basics under our belt, we will complement it with some of the most popular libraries for data analysis in Python, such as Pandas and Numpy for data manipulation, Matplotlib and Seaborn for visualization, and Jupyter Notebook for reporting. These packages will facilitate workflow and enhance the basic Python functionalities. Using them, one can effortlessly clean up a dataset, create elaborate plots, analyze and summarize the data, and produce presentable reports. During this module, you solidify your new skills by applying the concepts you have learned to analyze several datasets. You will have a chance to live-code during the sessions and troubleshoot your code with your classmates and the instructor. You will walk out of this Bootcamp with newly-forged Python coding skills, knowledge of several of the most important data science libraries and tools, and the resources for learning more. 1.5 cr"
    },
    {
        "course_code": "QST QM 878",
        "course_title": "Deep Learning with Python Bootcamp",
        "description": "Graduate Prerequisites: QM877, IS833, IS834 or instructor permission In this bootcamp, students will learn the most essential aspects of machine learning, and in particular, deep learning in Python. Prior programming experience in Python is required. We will cover some standard machine learning algorithms and solve business problems using tabular, time-series, and image data using deep learning algorithms. During this module, students solidify their new skills by applying the concepts they have learned to analyze several datasets. They will have a chance to live-code during the sessions and troubleshoot their code with their classmates and the instructor. 1.5 cr.",
        "prerequisites": "QM877, IS833, IS834 or instructor permission"
    },
    {
        "course_code": "QST SI 250",
        "course_title": "Ideas to Impact",
        "description": "This course is required for the Innovation and Entrepreneurship minor. The goal of this course is to expose students to the conceptual frameworks that guide ideation and innovation. Thus it will include all five learning principles the guide design of the Innovation and Entrepreneurship minor. The course analyzes the conditions that foster innovation as well as the process by which ideas progress from conception to implementation and execution, and the creation of either economic or social impact. Students will be exposed to theories on the conditions that affect the generation and development of creativity and innovation within individuals, teams, cities, and regions. To foster experiential learning, the whole class will be structured around the process of innovation with a \"live case\" that focuses on creating social innovations for the City of Boston. When people think about great social challenges, they often look afar to distant countries. Yet, many social problems lie right around the corner from students' daily lives. Students will develop a toolkit comprised of brainstorming, design thinking, human centered design, prototyping, storyboarding and field research. Students will conduct original field research within the City of Boston and identify a challenge or problem to address which they will focus on for the duration of the course, culminating in final presentations. Effective Fall 2019, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry I, The Individual in Community, Creativity/Innovation. BU Hub Learn More Social Inquiry IThe Individual in CommunityCreativity/Innovation",
        "BU_Hub": [
            "Social Inquiry I",
            "The Individual in Community",
            "Creativity/Innovation"
        ]
    },
    {
        "course_code": "QST SI 340",
        "course_title": "Family Business Management",
        "description": "Undergraduate Prerequisites: Sophomore standing This course explores the dynamic and complex world of family businesses across the globe. The course is primarily intended for students who have experience of a family business as well as students who are considering joining a family-owned enterprise or starting one. It counts toward the Innovation and Entrepreneurship minor and the Questrom Business minor. Family business historically represents a significant part of the U.S. economy and an even larger proportion of the global economy. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Global Citizenship and Intercultural Literacy, Historical Consciousness, Critical Thinking. BU Hub Learn More Historical ConsciousnessGlobal Citizenship and Intercultural LiteracyCritical Thinking",
        "prerequisites": "Sophomore standing",
        "BU_Hub": [
            "Historical Consciousness",
            "Global Citizenship and Intercultural Literacy",
            "Critical Thinking"
        ]
    },
    {
        "course_code": "QST SI 360",
        "course_title": "Strategy Lab",
        "description": "Undergraduate Prerequisites: QST FE323, QST MK323, QST OM323, and QST QM323 Graduate Prerequisites: QST FE323, MK323, OM323, and QM323 This course is a project-focused experiential course for sophomores and juniors. The overarching goal is to provide students with an authentic look at what it is like to be an \"associate consultant\" inside a top consulting firm, an experience which also includes training on Strategy content elements. Course activities include a live project, introduction of relevant Strategy content, development of a \"consulting toolkit,\" and an introduction to and perspectives on careers in consulting through talks with alumni guest speakers. 4 cr.",
        "prerequisites": "QST FE323, QST MK323, QST OM323, and QST QM323"
    },
    {
        "course_code": "QST SI 422",
        "course_title": "Strategy, Innovation, and Global Competition",
        "description": "Undergraduate Prerequisites: QST FE323, MK323, OM323, and QM323; First Year Writing Seminar (e.g.,WR 100 or WR 120) Provides students with a powerful set of tools which will prepare them to analyze, formulate, and implement business firm strategy with the aim of attaining sustainable competitive advantage. Adopts the perspective of the general manager, challenging student knowledge in each functional area in the effort to create integrative strategies that serve the needs of shareholders, as well as other stakeholders inside and outside the company. The course includes conceptual readings, which elucidate the fundamental concepts and frameworks of strategic management, as well as case analyses. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Global Citizenship and Intercultural Literacy, Writing-Intensive Course, Creativity/Innovation. BU Hub Learn More Global Citizenship and Intercultural LiteracyCreativity/InnovationWriting-Intensive Course",
        "prerequisites": "QST FE323, MK323, OM323, and QM323; First Year Writing Seminar (e.g.,WR 100 or WR 120)",
        "BU_Hub": [
            "Global Citizenship and Intercultural Literacy",
            "Creativity/Innovation",
            "Writing-Intensive Course"
        ]
    },
    {
        "course_code": "QST SI 430",
        "course_title": "Cleantech Venture Consulting Practicum",
        "description": "Undergraduate Prerequisites: QST SM131; CAS EE150 or ENG EK225 Required course for the Undergraduate Minor in Sustainable Energy. Serves as the capstone project providing students with a multidisciplinary experience that applies ALL three disciplines on the Undergraduate Minor in Sustainable Energy, i.e. Business, Environmental Sciences and Engineering. The practicum is offered in conjunction with a \"sponsoring company\" to provide students with a hands-on experience with a real-world sustainable energy project.",
        "prerequisites": "QST SM131; CAS EE150 or ENG EK225"
    },
    {
        "course_code": "QST SI 435",
        "course_title": "Entertainment Management",
        "description": "Undergraduate Prerequisites: QST FE 323 ; QST MK 323 ; QST OM 323 ; QST QM 323. (Offered in Los Angeles) Surveys the application of management concepts and principles to the film, television, video, new media and music industry. This course examines administration and finance, development, production, and distribution, and introduces students to the organizations and people (such as studios, independent production companies, talent managers, and agents) who manage, invest, and eventually profit in this creative industry. Much of the class time is spent in discussion of current entertainment industry trends. Students gain the skills to achieve their own entertainment goals.",
        "prerequisites": "QST FE 323 ; QST MK 323 ; QST OM 323 ; QST QM 323."
    },
    {
        "course_code": "QST SI 438",
        "course_title": "Talent Representation and Management",
        "description": "(Offered in Los Angeles) Using case studies and business models, students examine the manner in which critical players interact and attempt to work together in behalf of clients in an effort to make their \"professional dreams\" come to fruition. Participants will gain an understanding of the different areas of talent representation, how each one functions in the scope of a talent's career and what the responsibilities are for each position in each area of representation. Participants will also gain a clear view of what the business of Entertainment Representation has to offer as a chosen career. 4 cr."
    },
    {
        "course_code": "QST SI 445",
        "course_title": "Managing a Growing Enterprise",
        "description": "Undergraduate Prerequisites: QST FE 323 ; QST MK 323 ; QST OM 323 ; QST QM 323. Designed to help students understand the intricacies of running a small company. The course addresses the major challenges in small companies, including valuation, negotiation, deal structure, personnel and compensation, and marketing and financing. Exposes students to a wide range of business activities, emphasizing significant differences between large and small enterprises. The course uses a competitive computer simulation to provide students with the opportunity to \"run\" their own business. Please click here to watch a 1 minute video overview of the course.",
        "prerequisites": "QST FE 323 ; QST MK 323 ; QST OM 323 ; QST QM 323."
    },
    {
        "course_code": "QST SI 451",
        "course_title": "Organizing for Design and Innovation",
        "description": "Undergraduate Prerequisites: QST SM131, or QST SI250, or QST SI480, or COM FT591, or SHA HF307; Junior standing This course examines how managers and leaders can create the conditions for innovation at the individual, team and organizational levels and how those conditions differ for startup and mature organizations. Managing innovation includes the generation of ideas; the integration of those ideas into new product concepts; and the commercialization of those ideas. While core strategy courses address the questions of what innovations to pursue and whether and when those innovations will bring value, this course addresses the question of how managers can create organizations to deliver sustainable innovations of value.",
        "prerequisites": "QST SM131, or QST SI250, or QST SI480, or COM FT591, or SHA HF307; Junior standing"
    },
    {
        "course_code": "QST SI 453",
        "course_title": "Strategies in Environmental Sustainability",
        "description": "Undergraduate Prerequisites: QST SM131, or QST SI250, or QST SI480, or COM FT591, or SHA HF307; Junior standing With the growing global call for climate action, firms are recognizing business imperatives for climate resiliency. This course broadens our vision of corporate strategy to incorporate environmental initiatives as a way to create value. If you are a student who embraces the power of the private sector to lead climate imperatives, you will find this course particularly applicable. You will leave this course with a clear and actionable framework for implementing sustainability initiatives at all levels of the firm. Effective Spring 2021, this course fulfills a single unit in each of the following BU Hub areas: Digital/Multimedia Expression, Teamwork/Collaboration. BU Hub Learn More Digital/Multimedia ExpressionTeamwork/Collaboration",
        "prerequisites": "QST SM131, or QST SI250, or QST SI480, or COM FT591, or SHA HF307; Junior standing",
        "BU_Hub": [
            "Digital/Multimedia Expression",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "QST SI 464",
        "course_title": "Intellectual Property Strategies",
        "description": "Undergraduate Prerequisites: QST SM 131 or QST SI 480. This course looks at how companies can best use intellectual property (patents, trademarks, copyrights, trade secrets) to protect their proprietary ideas and investments in knowledge assets, shape competition, and realize value from innovation.",
        "prerequisites": "QST SM 131 or QST SI 480."
    },
    {
        "course_code": "QST SI 469",
        "course_title": "Real Estate Development",
        "description": "Undergraduate Prerequisites: QST FE323, MK323, OM323, and QM323. Pre-req for SHA students: SHA HF410; HF260; HF307; HF478 Real estate development is a process rather than a product. Too often, assumptions about occupancy, market absorption, rental income growth, valuation and competition are based on guesswork and interest in specific product types. The course reviews the underlying demographic market data that drives demand; utilizing data such as population and job growth, market and marketability analysis. The focus then shifts to site selection and feasibility analysis, the available methods of gaining site control and the process of assembling the professional team. Later, the course reviews the regulatory control process, along with budgeting and contract award and review of the construction control processes. The course is introductory in nature and assumes students have little or no knowledge about the development process.",
        "prerequisites": "QST FE323, MK323, OM323, and QM323. Pre-req for SHA students: SHA HF410; HF260; HF307; HF478"
    },
    {
        "course_code": "QST SI 471",
        "course_title": "International Entrepreneurship",
        "description": "Undergraduate Prerequisites: QST FE323, MK323, OM323, and QM323; or SI480 Designed for students who may at some point be interested in pursuing managerial careers in the international entrepreneurial sector, and covers the development of skills to identify, evaluate, start, and manage ventures that are international in scope. Over the course of the semester, the class \"travels\" to more than fifteen countries on five continents, and analyze operations at each stage of the entrepreneurial process. The course covers market entry, forming alliances, negotiations, managing growth, and cross-border financing. Support from local governments, and the cultural, ethical, legal, and human resource issues facing the entrepreneur is also covered. Please click here to watch a 1 minute video overview of the course.",
        "prerequisites": "QST FE323, MK323, OM323, and QM323; or SI480"
    },
    {
        "course_code": "QST SI 480",
        "course_title": "The Business of Technology Innovation",
        "description": "Undergraduate Prerequisites: ENG juniors and seniors only Provides an introduction to entrepreneurship and business for the engineer. Topics include finding business ideas; recognizing good from bad; understanding the importance of business model; turning technology into a business, including what to sell and how to sell it; the role of engineering within a business; business financial statements; and startups and venture capital, including starting a company or joining a startup. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Historical Consciousness, Social Inquiry I. BU Hub Learn More Historical ConsciousnessSocial Inquiry I",
        "prerequisites": "ENG juniors and seniors only",
        "BU_Hub": [
            "Historical Consciousness",
            "Social Inquiry I"
        ]
    },
    {
        "course_code": "QST SI 482",
        "course_title": "Strategy for Technology-Based Firms",
        "description": "Undergraduate Prerequisites: QST FE323, MK323, OM323, and QM323; or QST SI 480 Serves Questrom students concentrating in entrepreneurship or who are interested in high-technology sectors, and ENG students who have taken SI480. This interdisciplinary course covers technology life-cycles, the co-evolution of industries and technologies, strategies for commercialization of new technologies (appropriability, acquiring complementary assets and capabilities, managing technical teams, and impact of regulatory and other environmental factors on commercialization). Special emphasis is placed on joint learning and interdisciplinary teamwork by students across Engineering and Questrom.",
        "prerequisites": "QST FE323, MK323, OM323, and QM323; or QST SI 480"
    },
    {
        "course_code": "QST SI 498",
        "course_title": "Directed Study in Strategy and Innovation",
        "description": "Directed study in Strategy and Innovation. 2 or 4 cr. Application available on Undergraduate Program website."
    },
    {
        "course_code": "QST SI 630",
        "course_title": "Cleantech Venture Consulting Practicum",
        "description": null
    },
    {
        "course_code": "QST SI 750",
        "course_title": "Competition, Innovation, and Strategy",
        "description": "Graduate Prerequisites: QST AC710 or AC711, QST MK723 or MK724, QST MO712 or MO713, QST OM725or OM726 \"Competition, Innovation, and Strategy\" is an integrative course designed to capitalize on your understanding of Finance, Operations Management, Marketing, and other functional issues. The course draws on a number of academic disciplines, especially economics, organization theory, and sociology, to build a fundamental understanding of how and why some firms achieve and sustain superior performance. We also study why some firms persistently generate returns that are lower than average. The course is analytically focused and requires that you evaluate both the external environment and the internal capabilities of organizations. Corporate diversification and global management are important topics that are also featured.",
        "prerequisites": "QST AC710 or AC711, QST MK723 or MK724, QST MO712 or MO713, QST OM725or OM726"
    },
    {
        "course_code": "QST SI 751",
        "course_title": "Competition, Innovation, and Strategy",
        "description": "Graduate Prerequisites: QST AC710 or AC711, QST MK723 or MK724, QST MO712 or MO713, QST OM725or OM726 \"Competition, Innovation, and Strategy\" is an integrative course designed to capitalize on your understanding of Finance, Operations Management, Marketing, and other functional issues. The course draws on a number of academic disciplines, especially economics, organization theory, and sociology, to build a fundamental understanding of how and why some firms achieve and sustain superior performance. We also study why some firms persistently generate returns that are lower than average. The course is analytically focused and requires that you evaluate both the external environment and the internal capabilities of organizations. Corporate diversification and global management are important topics that are also featured.",
        "prerequisites": "QST AC710 or AC711, QST MK723 or MK724, QST MO712 or MO713, QST OM725or OM726"
    },
    {
        "course_code": "QST SI 814",
        "course_title": "Intellectual Property Strategies",
        "description": "Graduate Prerequisites: QST AC710 or AC711, QST FE721 or FE722, QST MK723 or MK724, QST MO712or MO713, QST QM716 or QM717, or permission of the instructor. This course covers the ways in which companies use intellectual property to protect their investments in knowledge assets. Traditionally a concern for technology-intensive businesses, patents, copyrights, trademarks, and trade secrets have become important business tools throughout the knowledge-based economy. A good understanding of what IP assets are and how they work has become essential for managers in all types of organizations. This is not a law course, nor a how-to manual rather it is intended to develop your analytical understanding of fundamental economic and legal aspects of intellectual property systems, and how they drive competition and strategy.",
        "prerequisites": "QST AC710 or AC711, QST FE721 or FE722, QST MK723 or MK724, QST MO712or MO713, QST QM716 or QM717, or permission of the instructor."
    },
    {
        "course_code": "QST SI 830",
        "course_title": "Corporate Strategies for Growth",
        "description": "Graduate Prerequisites: QST SI 750 or QST SI 751. This course will examine strategies for firm growth that involve expanding the range of the firm's business activities. We will study strategic logics underlying vertical integration, franchising, related and unrelated diversification, alliances, corporate venturing and spinouts, and other such strategies. We will also study the management challenges associated with these strategies, including designing organizational structures and managerial incentives, managing acquisitions, structuring supplier relationships, and fostering organizational cultures.",
        "prerequisites": "QST SI 750 or QST SI 751."
    },
    {
        "course_code": "QST SI 835",
        "course_title": "Real Estate Development, Finance, and Management",
        "description": "Graduate Prerequisites: QST FE721 or FE722, QST MK723 or MK724, QST OM725 or OM726, QST QM716or QM717 This is an introductory course that covers the basics of real estate investing and managing. Subject materials include mortgages, lenders, forms of ownership, tax laws affecting real property, financial analysis, and valuation techniques.",
        "prerequisites": "QST FE721 or FE722, QST MK723 or MK724, QST OM725 or OM726, QST QM716or QM717"
    },
    {
        "course_code": "QST SI 836",
        "course_title": "Decarbonization of the Global Economy",
        "description": "Graduate Prerequisites: QST PL 727 or QST PL 730. The changing relationship between business and the natural environment offers both challenges and opportunities for firms. In this course we will discuss many facets of business, including financing, risk management, measurement, competitive positioning, innovation, and strategy in the context of increasing pressures for improved environmental sustainability. The course will be interactive and discussion-oriented, with a case discussion in most class sessions, supplemented by debates, simulation exercises, visitors, student presentations, discussions of recent news articles, and mini-lectures. The course is appropriate for all students interested in how demands for sustainability will continue to change the business environment.",
        "prerequisites": "QST PL 727 or QST PL 730."
    },
    {
        "course_code": "QST SI 839",
        "course_title": "Design Thinking and Innovation",
        "description": "Graduate Prerequisites: QST SI 750 or QST SI 751. This class will examine how managers and leaders can create the conditions for innovation at the individual, team and organizational levels - and how those conditions differ for startup and mature organizations. Managing innovation includes the generation of ideas; the integration of ideas into new product concepts; and the commercialization of ideas. While core strategy courses address the questions of what innovations to pursue and whether and when those innovations will bring value, this course addresses the question of how managers can create organizations to deliver innovations of value. Thus, the course will focus on the practices and processes that mangers need to put in place to enable organizations to execute on an innovation strategy. In doing so, students will evaluate how to balance the challenges of organizing, managing and leading innovation with the need to produce concrete, routine and expected outcomes within the organization. To be innovative, any new idea must resolve the innovation paradox - introducing enough novelty to appeal to new markets while retaining enough familiarity to tap into existing behaviors. Because design and innovation are frequently inseparable in managing this paradox, the class will assess how design contributes to innovation in product, process and business models across industry sectors. The course will also consider the role that all sources of innovation play - including communities, networks, brokers and other forms of open innovation. Students will be asked to reflect upon innovations that have been critical to their lives, and how these innovations were produced and gained market traction. Final group projects will explore how to \"rescue\" innovations in trouble with turnaround teams.",
        "prerequisites": "QST SI 750 or QST SI 751."
    },
    {
        "course_code": "QST SI 842",
        "course_title": "Real Estate Development",
        "description": "Graduate Prerequisites: QST SI 750 or QST SI 751. The course provides a framework for evaluating the aspects underlying successful real estate development from concept and feasibility, through site control to regulatory review and construction. The course is taught utilizing class discussion, cases and outside speakers to reinforce the functional areas in the development process.",
        "prerequisites": "QST SI 750 or QST SI 751."
    },
    {
        "course_code": "QST SI 845",
        "course_title": "Technology Strategy",
        "description": "Graduate Prerequisites: QST AC710 or AC711, QST FE721 or FE722, QST MK723 or 724, QST MO712 or MO713, QST PL727 or PL730, QST SI750 or SI751 Technology Strategy is an advanced graduate class that equips students with an array of interrelated frameworks, concepts, and tools for analyzing and managing businesses in an environment with rapid technological change. The course complements both a core strategy course and other strategy and functional electives. It should be particularly valuable for students who want to work in or start businesses in high-technology sectors, and also those who want to better understand how growth and wealth are created through technological innovation in a modern economy. Technology Strategy provides a comprehensive review of the key theories and tools needed to understand: (a) how technological change creates new markets and prompts new business models; (b) how technology- based firms can outcompete rivals in fast-growing markets characterized by high uncertainty; (c) how firms assemble the resources required to commercialize an innovative technology; and (d) how the evolution of technology affects the type of firm capabilities needed to succeed in an industry over time. Specific topics covered in this class include: technology diffusion, models of industry evolution, technological discontinuities and disruptive innovation, R&D management, intellectual property, complementary assets needed to profit from innovation, industry standards, platform dynamics, and technology policy.",
        "prerequisites": "QST AC710 or AC711, QST FE721 or FE722, QST MK723 or 724,  QST MO712 or MO713, QST PL727 or PL730, QST SI750 or SI751"
    },
    {
        "course_code": "QST SI 849",
        "course_title": "Corporate Sustainability Strategy",
        "description": "Graduate Prerequisites: QST SI 750 or QST SI 751. Focuses on embedding sustainability (ESG/CSR) into corporate strategy as an approach for creating long-term shareholder/stakeholder value, where value covers the broad spectrum of economic, environmental and social outcomes. Through readings, lectures, case discussions, in-class exercises, lab session and a team project, this course will: 1) Introduce students to problem framing and environmental scanning techniques as methods for understanding macro-level social, economic and environmental systems and their implications; 2) Apply a variety of long-range strategic forecasting and analysis methods, techniques and tools through a scenario planning lab simulation; 3) Develop decision frameworks for corporate strategy development focused on creating/capturing value and managing risk through a sequence of strategic actions over time; 4) Explore newly emerging paradigms for sustainability-driven innovations in product/service, value chain and business model development and stakeholder-based, non-market actions.",
        "prerequisites": "QST SI 750 or QST SI 751."
    },
    {
        "course_code": "QST SI 852",
        "course_title": "Starting New Ventures",
        "description": "Graduate Prerequisites: QST FE721 or FE722, QST MK723 or 724, QST OM725 or OM726, QST QM716 or QM717 This course focuses on the process of identifying and obtaining the necessary resources to launch an entrepreneurial venture through the development of a business plan. A well-written business plan will communicate the business concept in a way that attracts the various resource providers necessary for the venture's success. Students will individually develop a business concept and prepare and present a professional business plan.",
        "prerequisites": "QST FE721 or FE722, QST MK723 or 724, QST OM725 or OM726, QST QM716 or QM717"
    },
    {
        "course_code": "QST SI 855",
        "course_title": "Entrepreneurship",
        "description": "Graduate Prerequisites: QST FE721 or FE722, QST MK723 or 724, QST OM725 or OM726, QST QM716 or QM717 The course is a comprehensive introduction to the entrepreneurial process from idea generation through venture launch and later growth. Initial lectures and case studies focus on idea generation and concept feasibility along with the skills, competencies and perspectives entrepreneurs must develop to manage the organization through each phase of development. Later lectures and cases emphasize the issues faced by entrepreneurs in scaling innovative enterprises; use of strategic alliances, attracting funding and managing investors, managing growth expansion and choosing among exit options.",
        "prerequisites": "QST FE721 or FE722, QST MK723 or 724, QST OM725 or OM726, QST QM716 or QM717"
    },
    {
        "course_code": "QST SI 857",
        "course_title": "Dilemmas in Scaling New Ventures",
        "description": "The purpose of this class is to increase students' chances of success in their early stage ventures by helping them avoid common team-related mistakes. We explore specific dilemmas that founders face --decisions that arrive early on, can be uncomfortable, and that need to be made with minimal information -- but that can have far-reaching consequences. Whether the founding team stays together, whether the venture achieves an attractive exit, and the extent to which the founder(s) share in those rewards can all be largely determined by early-stage choices."
    },
    {
        "course_code": "QST SI 858",
        "course_title": "Innovation Eco-Systems",
        "description": "Graduate Prerequisites: QST SI 750 or QST SI 751. This course is designed to help students to understand the importance of entrepreneurial eco-systems and the opportunities and support given to new ventures within these eco-systems. It provides a mechanism for MBA students to learn how the components of this innovation cycle interact with and complement each other. It will develop unique points of view on the role of Israel as a source of technology innovation and transformation and will present a mirror to examine the similarities and differences to the innovation culture that exists in the USA in general but Boston in particular. It will also develop a framework to identify the components that constitute an innovation eco-system to permit comparative analyses of how eco-systems differ in the ways they support innovation and entrepreneurship (e.g. Silicon Valley, Route 128, Israel, etc.).",
        "prerequisites": "QST SI 750 or QST SI 751."
    },
    {
        "course_code": "QST SI 859",
        "course_title": "Strategy Implementation",
        "description": "Graduate Prerequisites: QST FE721 or FE722, QST MK723 or MK724, QST OM725 or OM726 Gain the skills and know-how to manage up and across your organization, passing the normal organizational tests along the way from technical expert to cross-functional integrator to directing the future course of your organization. This is strategy implementation for the middle manager who needs to 1) size-up the situation and 2) determine how to gain the power needed to achieve their objectives. One of the qualitative factors that will be explored in great detail is personal style choice vis a vis different stakeholders and organizational politics and the resultant perceptions of you and your programs. Students will study both successful and less-successful managers through cases and readings, honing their own, personal managerial style.",
        "prerequisites": "QST FE721 or FE722, QST MK723 or MK724, QST OM725 or OM726"
    },
    {
        "course_code": "QST SI 860",
        "course_title": "Managing Corporate Innovation",
        "description": "Graduate Prerequisites: QST SI750 or SI751 recommended but not required This course will give students an understanding of the challenges of undertaking innovation within an existing corporate organization or other large institution such as governments or universities. Established industries are being disrupted by innovative products and services at an increasingly fast pace. Corporate leaders are confronting a dynamic shift from formal stage gate innovation approaches toward more entrepreneurial, iterative, fast-paced innovation processes such as agile development, design thinking, lean startup, rapid prototyping, and the business model canvas. To deliver innovative results, corporations must bridge ideas generated in the labs of tomorrow with current operations. This course aims to accelerate learning on corporate innovation by examining how corporate innovators can stay nimble and enable smart experimentation without risking the competencies that made them great. As the need to innovate becomes a matter of \"life and death,\" how do large organizations successfully innovate? We will examine how techniques and frameworks developed in the startup world are being adapted for the corporate one and how established organizations select from a portfolio of options to foster innovation. 3 cr.",
        "prerequisites": "QST SI750 or SI751 recommended but not required"
    },
    {
        "course_code": "QST SI 868",
        "course_title": "International Consulting Project",
        "description": "Graduate Prerequisites: QST SI 750 or QST SI 751. Have you ever dreamed of climbing the Great Wall of China? How about consulting to a Chinese firm in Beijing? The International Consulting Project is an MBA course that involves consulting work during the fall semester on campus, with a trip to Asia in to deliver the team's recommendation personally to the client at their offices. Examples of past projects and more background can be found on this link: http://www.bclob.com/icp-home/ Much of the past students' work over the years has both been implemented and widely published in the Chinese business press.",
        "prerequisites": "QST SI 750 or QST SI 751."
    },
    {
        "course_code": "QST SI 871",
        "course_title": "Strategies for Bringing Technology to Market",
        "description": "Graduate Prerequisites: QST SI 750 or QST SI 751. Strategies for Bringing Technology to Market is a unique course that guides student teams as they undertake commercial go-to-market strategy for scientific and engineering breakthroughs. By collaborating with faculty and graduate students in the University's research labs and mentors from the business community, teams will assess the economic and social prospects of recent technology innovations, outline the technical and market risks and the key commercial milestones and make recommendations for the most effective commercialization strategy. \u2028\u2028Project work is supported by lectures that focus on critical skills required. Guidance will be provided in assessing critical commercialization milestones by a combination of faculty and mentors from the business community.",
        "prerequisites": "QST SI 750 or QST SI 751."
    },
    {
        "course_code": "QST SI 917",
        "course_title": "Research Seminar in Technology Strategy and Innovation",
        "description": "This doctoral seminar serves as a survey course to the broad area of technology and innovation management. We will review and critique a large and diverse body of literature that can be considered \"core\" to the field. We will place emphasis on both classic theories and seminal contributions as well as on recent research that builds upon or extends the established theories. One key differentiator of this research seminar is that five professors actively doing research in the field will teach it. While having multiple instructors brings some coordination challenges (these are less critical in doctoral seminars than they are in masters level classes), it has one major advantage: it allows each faculty to lead those sessions that deal with topics of her or his direct research expertise. Students can expect to cover each topic with researchers that have been important contributors to the intellectual debate in the topic they teach. The seminar will cover key issues in the management of technology and innovation including innovation definitions and patterns (e.g. industry life cycle), entry timing strategies, platforms and standards, networks, dynamic capabilities, organizing for innovation, open and community-based innovation, licensing & patenting, technology diffusion, geography of innovation, and science and innovation policy. SI917 provides a solid base to critically explore many key topics of research in technology and innovation management. It is therefore aimed at doctoral students who plan to do research in technology and innovation management, or those who need a solid exposure to these topics to inform their research in related areas."
    },
    {
        "course_code": "QST SI 920",
        "course_title": "Organizations in Strategy and Economics",
        "description": "This doctoral seminar will compare and contrast ideas about organizational design and the performance consequences of organizational decisions from the closely related fields of Strategy and Economics. The first half of the semester will focus on the role of organizations (typically firms) in several schools of thought within Strategic Management. The second half of the semester will cover similar topics from an economic perspective, which places more emphasis on incentives, formal contracts and specific kinds of information problems (i.e. moral hazard and adverse selection). At the end of this course, students should be able to explain how the role of organizations differs across several key theoretical lenses used in Strategic Management (e.g. the Knowledge Based View vs. Strategic Human Capital Theory). Identify the core incentive and informational problems that underpin most economic models of organization. Articulate areas where Strategy and Economics have reached a consensus on the key drivers of organization, as well as questions where the two fields make different assumptions and/or reach different conclusions and describe key empirical regularities and associations that have informed organizational theory-building efforts in both strategy and economics."
    },
    {
        "course_code": "QST SI 990",
        "course_title": "Current Topics Seminar",
        "description": "For PhD students in the Strategy and Innovation department. Registered by permission only."
    },
    {
        "course_code": "QST SM 101",
        "course_title": "Introduction to Management",
        "description": "Online offering. A broad introduction to the nature and activities of business enterprises within the United States' economic and political framework. Course content introduces economic systems, essential elements of business organization, production, human resource management, marketing, finance, and risk management. Key objectives of the course are development of business vocabulary and a fundamental understanding of how businesses make money. This course is intended for non-business majors. It may not be taken by Questrom students for credit nor can it be used by Boston University students toward the Business Administration minor. Non-Questrom students may register for this course directly via the Student Link."
    },
    {
        "course_code": "QST SM 131",
        "course_title": "Business, Ethics, and the Creation of Value",
        "description": "Undergraduate Prerequisites: Required of all Questrom 1st-semester freshmen. Open to non-Questrom students who have completed a semester of FT work at BU. Required of all Questrom 1st-semester freshmen. Open to non-Questrom students who have completed a semester of FT work at BU. *This course explores local and global ethical problems that managers face in markets for goods, services, labor, or capital. Through identification and discussion of the basic business disciplines, students uncover the interdependencies in the creation, delivery and capture of value. Students explore the complex analyses necessary to make ethical decisions vis-a-vis a multiplicity of stakeholders and in service of diverse personal and institutional goals. Effective Fall 2023, this course fulfills a single unit in each of the following BU Hub areas: Ethical Reasoning, Teamwork/Collaboration. BU Hub Learn More Ethical ReasoningTeamwork/Collaboration",
        "prerequisites": "Required of all Questrom 1st-semester freshmen. Open to non-Questrom students who have completed a semester of FT work at BU.",
        "BU_Hub": [
            "Ethical Reasoning",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "QST SM 132",
        "course_title": "Measuring Financial Value",
        "description": "Undergraduate Prerequisites: SM131 previous or concurrent. Open to non-Questrom students who have completed a semester of FT work at BU. This course offers an overview of fundamental financial analyses, such as time value of money, interest rates, basic valuation of cash flow streams, and basic stock and bond valuation. The content is relevant to understand a broad class of problems and decisions for businesses or individuals. It offers applications across decision domains. The teaching materials include online problem solving and case writing. Students may not take SM132 and FE101 for credit.",
        "prerequisites": "SM131 previous or concurrent. Open to non-Questrom students who have completed a semester of FT work at BU."
    },
    {
        "course_code": "QST SM 275",
        "course_title": "Management Communications",
        "description": "Undergraduate Prerequisites: QST SM131, CAS WR120 or WR150, and sophomore standing Persuasive written and oral communications are essential skills that are required for success in every business discipline. In this course, students will learn how to communicate clearly and persuasively. Course objectives include learning how to inspire action through compelling, high-impact communications by taking a point of view and supporting it with logic and evidence, generating insights with meaningful conclusions and recommendations, and understanding and applying the principles of logical reasoning to organize information and lead an audience to action. Students will learn to write simply and clearly in a variety of formats. They will also master presentation delivery by connecting authentically to the audience, harnessing the power of storytelling, and using body language to positively reinforce the message. Finally, students will enhance professional skills that are integral to business success. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, Research and Information Literacy, Writing, Research & Inquiry. BU Hub Learn More Writing, Research, and InquiryOral and/or Signed CommunicationResearch and Information Literacy",
        "prerequisites": "QST SM131, CAS WR120 or WR150, and sophomore standing",
        "BU_Hub": [
            "Writing, Research, and Inquiry",
            "Oral and/or Signed Communication",
            "Research and Information Literacy"
        ]
    },
    {
        "course_code": "QST SM 303",
        "course_title": "Cross-Functional Core",
        "description": "Cross-Functional Core is made up of FE323, MK323, OM323 and QM323 as well as a semester-long business plan project. The semester-long business plan project where students collect primary and secondary research explores the interactions and the cross functional integrations between marketing, operations, and finance, while leveraging business analytics. Effective Fall 2019, this course fulfills a single unit in each of the following BU Hub areas: Digital/Multimedia Expression, Research and Information Literacy, Teamwork/Collaboration, Creativity/Innovation. BU Hub Learn More Digital/Multimedia ExpressionResearch and Information LiteracyTeamwork/CollaborationCreativity/Innovation",
        "BU_Hub": [
            "Digital/Multimedia Expression",
            "Research and Information Literacy",
            "Teamwork/Collaboration",
            "Creativity/Innovation"
        ]
    },
    {
        "course_code": "QST SM 395",
        "course_title": "Mgmt Internship",
        "description": null
    },
    {
        "course_code": "QST SR 841",
        "course_title": "Fundamentals of Nonprofit Management",
        "description": "Graduate Prerequisites: QST AC 710 or QST AC 711. The purpose of this course is to teach students about the distinctive challenges of managing high-performing organizations in the nonprofit sector. The course will cover a broad range of topics and it is intended to be a gateway course to the sector and to potential electives and pathways of future learning. The two major projects in the semester (one is individual, one in a team) offer students the chance to choose an area of interest to explore in depth. Other assignments challenge students to identify and analyze key indicators of nonprofit performance and to communicate effectively about those issues to selected stakeholders. A strong grounding in nonprofit accounting and financial management is extremely valuable and so we devote considerable attention to those topics. The course also addresses nonprofit marketing, evaluation, fundraising and revenue generation, growth strategy, impact investing, and the confluence of charity and commerce. The course is oriented to practice and will engage experts in the field.",
        "prerequisites": "QST AC 710 or QST AC 711."
    },
    {
        "course_code": "QST SR 850",
        "course_title": "Global Entrepreneurship",
        "description": "This course is designed to: (1) explore the concepts, practices, opportunities, and challenges of social entrepreneurship; (2) provide frameworks and tools that will help students be more effective in this sector; and (3) provide an opportunity for students to create a business plan for a new social enterprise or an income-generating initiative of a nonprofit organization. In the business plan project, student teams will partner with external organizations. Students will identify and analyze opportunities, resources, and risks and apply skills from marketing, accounting, organizational behavior, strategy and other disciplines. Special emphasis will be placed on aspects of business planning and organizational strategy that are particularly challenging or distinctive in the social sector, including mission definition, leadership, organizational structure, raising capital, and measuring results."
    }
]