[
    {
        "course_code": "SED AP 500",
        "course_title": "Directed Study",
        "description": "Undergraduate Prerequisites: Open to undergraduate students only. approval of advisor, the facultymember who is to supervise the study, and department chairman. Prereq: Approval of advisor. Signed plan of study must be submitted in advance of registration on a Directed study form obtained from the SED Office of Records. Var cr.",
        "prerequisites": "Open to undergraduate students only. approval of advisor, the facultymember who is to supervise the study, and department chairman."
    },
    {
        "course_code": "SED AP 520",
        "course_title": "Communications in Education and Human Services Organizations",
        "description": "Prepares education, human service and government agency managers to plan and execute communications and community relations programs within their organization. Explores how to operate professionally and ethically as a communicator on behalf of an organization. 4cr, Summer Term."
    },
    {
        "course_code": "SED AP 524",
        "course_title": "Citizen Participation",
        "description": "Recommended to be taken in conjunction with SED AP 525. Focus on both practical and theoretical perspectives about the relationships between educational institutions and those they are established to serve. Topics include: diverse ways for consumers/clients to influence educational institutions (choice, voice, loyalty, and coproduction); family and student participation in governance; decentralization and community control; planning and managing participatory approaches."
    },
    {
        "course_code": "SED AP 526",
        "course_title": "Family & Community Engagement",
        "description": "Examines the role of schools, families and community agencies and the critical partnerships that must be forged between them to support student learning and well- being.? The primary goal of this seminar is to deepen understanding of the systemic obstacles -- and possibilities - - to improve our school systems and narrow achievement gaps. 2 cr."
    },
    {
        "course_code": "SED AP 555",
        "course_title": "The History of Boston University",
        "description": "How did Boston University evolve from a rural seminary to an elite research university? What implications could the study of BU history have on the practice of professional education? This course explores the intellectual and institutional changes that occasioned \"the spectacular development\" of BU and then uses this history as a reflexive tool. Students access archival materials, tour historic sites, and construct historical narratives. Students also reflect on both their experiences and the work of education to enhance future practice. Effective Summer 2020, this course fulfills a single unit in the following BU Hub areas: Historical Consciousness, The Individual in Community, Creativity/Innovation. BU Hub Learn More Historical ConsciousnessThe Individual in CommunityCreativity/Innovation",
        "BU_Hub": [
            "Historical Consciousness",
            "The Individual in Community",
            "Creativity/Innovation"
        ]
    },
    {
        "course_code": "SED AP 600",
        "course_title": "Diversity and Justice in Education",
        "description": "How schools, colleges, and other education settings are affected by the growing pluralism of our society; the tension between respect for diversity and the maintenance of common purpose. Strategies of integration and separate development and of remediation and enrichment. 4 cr."
    },
    {
        "course_code": "SED AP 601",
        "course_title": "History and Foundations of Higher Education",
        "description": "Provides a foundational understanding of the history of U.S. higher education, while fostering substantive dialogue and analysis of significant perspectives, events, and trends relevant to higher education today. Focuses on the interplay between the goals of the university and the demands placed on higher education by society. 4 cr."
    },
    {
        "course_code": "SED AP 609",
        "course_title": "Analyzing the Role of Education Policy in Social Inequality",
        "description": null
    },
    {
        "course_code": "SED AP 612",
        "course_title": "Governance and Decision-Making in Higher Education",
        "description": "Colleges and universities are large, complex, and oftentimes perplexing organizations. Through this course, students will examine the roles and responsibilities of trustees, presidents, administrators, faculty, and students in governance and decision-making; explore how decisions are made in a variety of functional areas (how they work): and, appreciate how institutional culture, organizational structures, and external factors influence decision-making 4cr."
    },
    {
        "course_code": "SED AP 615",
        "course_title": "Theories of Student Learning & Development in Higher Education",
        "description": "Examines theories of students' personal and social development in college as well as emerging research on student learning in college. Students will employ a theory-to- practice approach that uses campus environment theories to cultivate safe, inclusive, and engaging communities of learning. 4 cr."
    },
    {
        "course_code": "SED AP 619",
        "course_title": "Leadership, Values & Ethics in Higher Education",
        "description": "This course enhances understanding of the theory and practice of higher education leadership, grounded in personal, organizational, and professional values and challenged by ethical dilemmas. It explores multiple leadership theories, methods of values discernment, and tactics of addressing ethical dilemmas in higher education."
    },
    {
        "course_code": "SED AP 620",
        "course_title": "History of Education",
        "description": "Topics in the history of education. Students prepare a paper on a topic selected in consultation with the instructor. 4 cr."
    },
    {
        "course_code": "SED AP 622",
        "course_title": "Student Affairs in Higher Education",
        "description": "Focuses on university divisions intentionally structured to shape students' character, to foster students' development, to provide services, and to educate students via various co-curricular and extra-curricular experiences. Is designed to develop a deep understanding of the history, philosophy, and mission of Student Affairs within the context of higher education. 4 cr."
    },
    {
        "course_code": "SED AP 625",
        "course_title": "Global Higher Education",
        "description": "This course explores the dynamic global landscape of higher education, compares and contrasts differing national models, and delves into how US institutions internationalize their efforts and create professional roles on campuses, both here and abroad, that support global programs and students from other countries."
    },
    {
        "course_code": "SED AP 630",
        "course_title": "Education and Religion",
        "description": "The relationship of government with schools and colleges based on religious convictions and the efforts of educators to shape and maintain a distinctive character in such institutions. Issues of educational freedom and the rights of parents from historical and comparative international perspectives. Students prepare a paper on a topic selected in consultation with the instructor. (Also offered as STH TE 845) 4 cr."
    },
    {
        "course_code": "SED AP 631",
        "course_title": "Child Policy",
        "description": "The purpose of this course is to examine the public policies that address all children's wellbeing in the context of health, education, and social forces. We will take an inter-disciplinary approach (developmental psychology, economics, sociology, and public health) to focus particularly on the needs and vulnerabilities of economically disadvantaged and/or racially or ethnically marginalized children. We will discuss the arguments for policy intervention (both domestic and global) during childhood (ages 0- 12), and we will focus on 4-5 specific policy topics in depth."
    },
    {
        "course_code": "SED AP 632",
        "course_title": "Child & Youth Advocacy",
        "description": "The purpose of this course is to provide hands-on experience with policymaking through networking with community stakeholders, non-profits, and policymakers about child and youth policy issues. The course takes an inter-disciplinary approach (developmental psychology, education, economics, sociology, and public health) to focus on the needs and vulnerabilities of children and youth in society, particularly those who are economically disadvantaged or racially minoritized. The course will examine policies affecting children and youth in the realm of early childhood education, K-12, health, juvenile justice, and special education through readings, interviews with key stakeholders, field outings, and class discussion."
    },
    {
        "course_code": "SED AP 635",
        "course_title": "Public Policy for Researchers",
        "description": "The purpose of this course is to expose students to the basics of the public policy field in order to be able to conduct research, advocate for issues, and develop careers in policy-related fields."
    },
    {
        "course_code": "SED AP 641",
        "course_title": "Equity and Community Partnerships",
        "description": null
    },
    {
        "course_code": "SED AP 652",
        "course_title": "Accountability in Independent, Charter, and International Schools",
        "description": "Methods and resources for student and staff accountability in free-standing schools. How assessment programs like the International Baccalaureate and Advanced Placement tests affect curriculum and school life. Leadership strategies for promoting a shared sense of mission in schools with diverse enrollment and administrative autonomy."
    },
    {
        "course_code": "SED AP 660",
        "course_title": "Economics of Education Policy",
        "description": "This course introduces students to how economists think about education and education policy. We first introduce methods to estimate policy impacts, then read evidence on a variety of pressing education policy issues."
    },
    {
        "course_code": "SED AP 662",
        "course_title": "Strategic Planning and Implementation",
        "description": "Designed to equip students with the knowledge and skills needed to lead or participate in strategic planning at the college/university, school or school district level. Students learn about the entire strategic planning and implementation process, applying the concepts and skills learned to their own practice as aspiring or developing leaders. Through this course, students also gain knowledge of how these organizations assess their mission, goals, and operations and create change in complex environments. 4 cr."
    },
    {
        "course_code": "SED AP 663",
        "course_title": "Project Planning and Leadership",
        "description": "Prereq: restricted to and required for MEd students in Tyngsboro. Introduction to tools and techniques used to successfully manage large, complex projects while simultaneously being flexible enough to manage simple projects such as planning a gathering or moving an office. Managers who possess these skills in today's fast- paced environment have a significant advantage over those who do not."
    },
    {
        "course_code": "SED AP 664",
        "course_title": "Advanced Strategic Planning",
        "description": "Focuses on implementation of strategic plans in large organizations. Resources, tools, equity mindset and management approaches are explored to support managing reform, building capacity and fostering innovation. Theories focus on equity in leadership, organizational development, collaboration and innovation."
    },
    {
        "course_code": "SED AP 675",
        "course_title": "Teacher and School Leader Policy in the K-12 Sector",
        "description": "This course surveys a range of topics related to human capital in the K-12 education sector, focusing mainly on various stages of the teacher and principal pipelines, as well as the education policies that impact their development and career outcomes."
    },
    {
        "course_code": "SED AP 680",
        "course_title": "International Education Policy",
        "description": "This course explores global perspectives of education policy by surveying historical, social, political, economic, and pedagogical issues that affect PK-20 education around the world within in the context of globalization and emerging international standard. 4 cr. Either sem."
    },
    {
        "course_code": "SED AP 701",
        "course_title": "Doctoral Colloquium I",
        "description": "Provides opportunity for (a) discussion of the nature of successful doctoral-level work, (b) reading and discussion of challenging materials, and (c) reflection on common themes among the department's diverse specializations. Strongly recommended for all new doctoral students in Administration, Training, and Policy Studies, and open to others with the permission of the instructor. 2 cr, 1st sem."
    },
    {
        "course_code": "SED AP 702",
        "course_title": "Doctoral Colloquium in Educational Leadership and Development",
        "description": "Develops an understanding of the basic purposes and essential logic of educational inquiry. Students critically examine and discuss selected policy studies, research reports, and literature reviews in order to understand the evidentiary requirements for making factual claims. Connections are drawn to issues of research design. 2 cr."
    },
    {
        "course_code": "SED AP 713",
        "course_title": "Instructional Leadership",
        "description": "Examines the role of the principal in working with teachers and specialists to shape the educational program of a school and to set clear and measurable objectives for outcomes. Meeting the needs of inner-city pupils and responding to program mandates."
    },
    {
        "course_code": "SED AP 720",
        "course_title": "Performance-Based Instructional Leadership",
        "description": "Designed to prepare aspiring and developing school leaders to organize, lead and transform schools and school systems into high performing organizations focused on student achievement. Students will examine and analyze the qualities, characteristics, behaviors and practices of effective leaders, with an emphasis on effective instructional leadership. 4 cr."
    },
    {
        "course_code": "SED AP 730",
        "course_title": "Innovation in Higher Education",
        "description": "Graduate Prerequisites: SED AP 551 or SED AP 761. We live, study, and work in an era of upheaval in higher education. AP 730 explores how innovation occurs -- through contemporary examples, cases, projects, and guest speakers. We examine the influence of technology, public policy and social change -- and the role that faculty, administrators, and outside firms play in guiding change. 4 cr.",
        "prerequisites": "SED AP 551 or SED AP 761."
    },
    {
        "course_code": "SED AP 750",
        "course_title": "Educator Evaluation and Supervision",
        "description": "Develops an understanding of various legal, philosophical, and empirical perspectives on the evaluation and supervision of educational personnel. Emphasis in supervision is on effective patterns of interpersonal communication between subordinate and supervisory personnel. 4 cr."
    },
    {
        "course_code": "SED AP 751",
        "course_title": "School Law",
        "description": "During the last century, many of the greatest barriers to equality-- and many of the most important efforts to overcome such barriers -- have involved the law. Students in this course will learn about laws that impact our schools."
    },
    {
        "course_code": "SED AP 753",
        "course_title": "Educational Policy",
        "description": "Provides an overview of United States' educational policy with a special focus on academically at-risk populations (e.g., living in poverty, attending under- resourced schools, dual language learners, immigrant students, students from ethnic/racial minoritized backgrounds). 4 cr. Either sem."
    },
    {
        "course_code": "SED AP 754",
        "course_title": "Educational Equity and the Law",
        "description": "Student and teacher rights and equal opportunity in K-12 education. 2 cr."
    },
    {
        "course_code": "SED AP 755",
        "course_title": "Legal Issues in Higher Education",
        "description": "This course is designed to assess issues that arise in the administration of higher education through the ethical and legal principles applicable to their resolution. Educational institutions experience difficult legal and policy decisions similar to every other industry, including, but not limited to, situations regarding freedom of speech, expression, and association; due process and right to privacy; discrimination on the basis of identity; use of alcohol; and, ownership and use of intellectual property. Students will examine the foundations of higher education law, analyze cases, and explore the application of the law in practice to help them make sound decisions in their roles in higher education. 4 cr."
    },
    {
        "course_code": "SED AP 757",
        "course_title": "School Labor Relations and Personnel Management",
        "description": "Policies and procedures affecting personnel management in the schools. Topics include: collective bargaining; managing reduction in force; grievance processing; legal liability of employees and officials; and equality considerations in recruitment, promotion, and affirmative action. 2 cr."
    },
    {
        "course_code": "SED AP 758",
        "course_title": "School Governance, Finance, and Operations",
        "description": "Focuses on the economics, politics, and administration of school finance from both theoretical and practical perspectives. Emphasis is placed on the planning, policy, and procedural aspects of school funding, resource allocation, and school plant management. 4 cr."
    },
    {
        "course_code": "SED AP 759",
        "course_title": "School Improvement Science and Implementation",
        "description": "This course, \"School Improvement Science and Implementation,\" is about the heart of the educational enterprise -- schools in which each and every student is intellectually and socially engaged, finds areas of interest and passion, feels known and cared for, and deserves a dignified next step. This is no easy task because the issues are complex. We will carefully examine ways in which collaboration -- within schools, and between practitioners, university researchers, and policy makers -- becomes a fundamental school improvement strategy. We will be guided by the work of Anthony Bryk et al, Charles Kenney, and by the experience and reflections of successful and respected school and school district leaders. We will examine the relationship between practice, research, and policy. There will be an emphasis on collaborative problem-solving in \"networked improvement communities.\" We will carefully explore the history of education reform, and too often, education reform that fails to achieve its inspiring goals. We will work to create new knowledge that can interrupt the failure of school reform, particularly with students from low-income families."
    },
    {
        "course_code": "SED AP 760",
        "course_title": "Group Problem Solving",
        "description": "Emphasizes collaborative models for clarifying and solving problems. Simulations, case studies, and field projects are used as sources of information. The aim is to help students diagnose and solve educational organization problems they have identified. 4cr, 2nd sem."
    },
    {
        "course_code": "SED AP 761",
        "course_title": "Organizational Analysis",
        "description": "Students define and document organizational problems, identify positive and negative stakeholders, analyze possible problem causes using a range of theoretical frameworks, and examine alternative strategies for resolving or ameliorating the problem. 4 cr."
    },
    {
        "course_code": "SED AP 762",
        "course_title": "Advanced Budgeting, Finance and Labor Relations",
        "description": "This course equips students with knowledge and skills needed to manage school finance, budgeting, labor and governance issues. Primarily through in-class case studies, supplemented by lectures, presentations, readings, assignments and other activities, students will learn about management and governance."
    },
    {
        "course_code": "SED AP 763",
        "course_title": "Community Analysis",
        "description": "This seminar analyzes case studies of disadvantaged urban and indigenous communities emerging from crisis and violent conflict in North America and developing countries to explore how diverse partners-- businesses, universities, religious, governmental, non-governmental and community-based organizations-- can collaborate to provide educational, capacity-building and community development services. A Community Education Leadership requirement.4cr,Summer Term."
    },
    {
        "course_code": "SED AP 771",
        "course_title": "Advanced Policy Seminar",
        "description": "Graduate Prerequisites: application required. Students use appropriate theories and methods to examine critically important policy issues in public and private education and in corporate training and development. Includes preparation for departmental comprehensive examination. Instructor permission required. 4 cr.",
        "prerequisites": "application required."
    },
    {
        "course_code": "SED AP 801",
        "course_title": "Professional Development Seminar",
        "description": "Designed to assist students in making meaning of their assistantship, internship, or other field placement experiences in student affairs or academic affairs administration. Aligning experiential learning (jobs, assistantships, and internships) with academic courses, this course helps students apply theory to practice and prepare them for future administrative roles in higher education. Students apply theory to practice to prepare for future administrative roles in higher education. Part I: Institutional types and functional areas, practice self- management, analyze socialization practices, and examine professional competencies, standards, and associations. Part II: Implementation of professional development plans, preparation for the job search, supervision styles and skills, professional evaluations and feedback. 2 cr, May be repeated."
    },
    {
        "course_code": "SED AP 810",
        "course_title": "Prepracticum/Internship Seminar",
        "description": "Students review current research on effective schooling and develop lans to complete the requirements for certification. Requires 75 hours of prepracticum field experience."
    },
    {
        "course_code": "SED AP 811",
        "course_title": "Practicum/Internship Seminar",
        "description": "Required concurrently with the practicum to complete evaluation of competencies and synthesize theory and practice; for principal and superintendent/assistant superintendent certification candidates."
    },
    {
        "course_code": "SED AP 900",
        "course_title": "Independent Study",
        "description": "Graduate Prerequisites: Open to matriculated graduate degree and certificate candidates who have completed three or more semester courses. Prereq: Approval of advisor. Signed plan of study must be submitted in advance of registration on an Independent study form obtained from the SED Office of Records. Variable cr.",
        "prerequisites": "Open to matriculated graduate degree and certificate candidates who have completed three or more semester courses."
    },
    {
        "course_code": "SED AP 999",
        "course_title": "Dissertation Advisement",
        "description": "Graduate Prerequisites: Open to doctoral candidates. Graduate Prereq: Open to doctoral candidates. Students must obtain approval of their advisors and the faculty member who is to supervise the study. Var cr.",
        "prerequisites": "Open to doctoral candidates."
    },
    {
        "course_code": "SED BI 515",
        "course_title": "Methods in Bilingual Education and English as a Second Language (ESL)",
        "description": "Planning and implementing effective assessment and instruction in language, literacy, and the content areas in elementary English as a second language classrooms. Students develop standards-based lesson plans, and analyze texts using current English language development framework. 4 cr. Either sem."
    },
    {
        "course_code": "SED BI 570",
        "course_title": "Educational Issues in Bilingualism",
        "description": "Focus on complexity of bilingualism, literacy, and schooling from a student, school, and socio-political perspective. Examines theoretical, historical, research, and legal bases of educational policy and programs for students who speak a language other than the language of the school. 4 cr. Either sem."
    },
    {
        "course_code": "SED BI 620",
        "course_title": "Educational Issues in Bilingualism",
        "description": "Focus on complexity of bilingualism, literacy, and schooling from a student, school, and socio-political perspective.Examines the theoretical, historical, research, and legal bases of educational policy and programs for students who speak a language other than the language of the school. 4 cr."
    },
    {
        "course_code": "SED BI 650",
        "course_title": "Teaching Emergent Bilinguals with Learning Disabilities",
        "description": "This course will be divided into two main parts, the first part will focus primarily on issues of assessment and identification of ELs with learning disabilities, while the second half will focus on legal implications and instructional practices for when dually classified students. To model the practice of and necessity for intentional and meaningful collaboration between Special Education and English Learner educators this course was co- developed and will be co-taught by a faculty member in Special Education and Language Education. 4 cr."
    },
    {
        "course_code": "SED CE 500",
        "course_title": "Introduction to Counseling",
        "description": "Emphasis on understanding the theoretical basis of counseling. Introduction to learning skills involved in helping relationships. Selected reading in counseling theory and practice are assigned. Various types of counseling are explored. Open to counseling program students; senior undergraduates may also register with the approval of instructor. 4 cr."
    },
    {
        "course_code": "SED CE 610",
        "course_title": "Substance Abuse Issues in Youth Populations",
        "description": "This course provides students with a foundational understanding of the substance use and abuse issues during adolescence. The workshop examines the epidemiology, theories/models of addiction, treatment approaches, and practice issues important to the understanding of adolescent substance abuse. .5cr, 2nd sem."
    },
    {
        "course_code": "SED CE 630",
        "course_title": "Applied Positive Psychology",
        "description": "Focuses on the scientific study of psychological aspects of living a fulfilling and flourishing life. Topics include happiness, empathy, optimism, friendship, goal setting, achievement, emotion, creativity, humor, and mindfulness. Students become familiar with theory and research in this relatively new subfield and critically consider application to their teaching, coaching, leadership, and/or counseling. 4 cr."
    },
    {
        "course_code": "SED CE 635",
        "course_title": "Counseling Skills and Techniques",
        "description": "Introduces students to the counseling skills essential for working directly with children, adolescents, and/or emerging adults in pre-practicum, practicum, and internship settings. Students use the course to develop knowledge and practice with clinical interventions and organizational dynamics. CPAHD students; others with instructor permission. 3 cr."
    },
    {
        "course_code": "SED CE 650",
        "course_title": "Counseling and Applied Techniques in Sport, Exercise, and Performance Psychology",
        "description": "This course will equip students with in-depth theoretical and applied knowledge on counseling skills and applied techniques for Sport, Exercise, and Performance Psychology. Emphasis will be placed on the conceptualization, implementation, and evaluation of psychological skills training programs. 4 cr."
    },
    {
        "course_code": "SED CE 705",
        "course_title": "Lifespan Development",
        "description": "This course addresses human development from the prenatal period to death. Consideration is given to the interplay between social, cultural, cognitive, and biological influenced on the healthy development of children, adolescents, and adults. CPAHD students; others with instructor permission. 3 cr."
    },
    {
        "course_code": "SED CE 710",
        "course_title": "Child and Adolescent Psychopathology",
        "description": "This graduate level course will focus on child and adolescent psychopathology from a developmental framework, with attention to etiology, assessment, and treatment. Emphasis will be placed on DSM-V disorders. Case studies will be used to illustrate the text's descriptions and to reflect the influence of sociocultural factors in symptom manifestation. 3 cr. 2nd sem."
    },
    {
        "course_code": "SED CE 715",
        "course_title": "Evidence Based Practices",
        "description": "Develop an understanding of evidence based practices when counseling children and adolescents.?CPAHD students only; others?with instructor permission. 4 cr."
    },
    {
        "course_code": "SED CE 720",
        "course_title": "SP&Prf Prac",
        "description": null
    },
    {
        "course_code": "SED CE 721",
        "course_title": "Sport & Performance Psychology Practicum II",
        "description": "Two semesters of internships specifically focused on developing counseling and applied sport/performance psychology skills. Training in the conceptual and technical counseling skills and supervision to the students as they strive to become competent sport/performance psychology consultants. CPAHD students only; others with instructor permission."
    },
    {
        "course_code": "SED CE 730",
        "course_title": "Guiding the College Admission Process",
        "description": "A review of the theoretical and empirical literature on universal educational access to the counseling practice of fostering college aspirations and guiding students through the choice and application process. Developmentally appropriate guidance across the lifespan applicable to diverse educational settings and the construction of useful tools will be emphasized. 2 cr."
    },
    {
        "course_code": "SED CE 735",
        "course_title": "Issues in School Counseling",
        "description": "An examination of issues faced by the developmental school counselor. Topical areas include the history, principles, and practices of school counseling, tenets, and guidelines of developmental counseling, schools as institutions, counselor reform, Massachusetts curriculum frameworks, MCAS and other forms of school- based appraisal, students with special needs, school-based prevention and intervention, legal and ethical issues, college and career counseling, referral, group counseling in educational settings, consultation, the development of the school counselor, and the future of school counseling. Restricted to matriculated students or permission of instructor. 4 cr."
    },
    {
        "course_code": "SED CE 739",
        "course_title": "Psychology of Vocational Development",
        "description": "Theories of vocational development and work as a social issue. Counseling and information are presented as tools to facilitate the vocational and personal development of diverse populations in a variety of work settings. Current trends in the world of work. 4 cr."
    },
    {
        "course_code": "SED CE 740",
        "course_title": "Ethics and Professional Responsibilities",
        "description": "Examines the professional identity and responsibilities of licensed mental health counselors and licensed school counselors, and an introduction to the role of ethics in the practice of counseling in both theoretical and practical terms. CPAHD students; others with instructor permission. 3 cr."
    },
    {
        "course_code": "SED CE 741",
        "course_title": "Cross-Cultural Perspectives",
        "description": "A historical, philosophical, and clinical examination of subcultural considerations in counseling psychology professional practice and inquiry. 4 cr."
    },
    {
        "course_code": "SED CE 746",
        "course_title": "Clinical Practice",
        "description": "Provides development of advanced counseling skills by combining academic work with fieldwork, in a school or clinical setting, through a two-semester field placement under dual supervision. Required for approved counseling interns. Registration restricted to Master's students in counseling. 3 cr."
    },
    {
        "course_code": "SED CE 769",
        "course_title": "Substance Abuse and Treatment",
        "description": "This course provides a comprehensive overview of the field of substance abuse, its prevention practices, and treatment modalities. Using a biopsychosocial perspective, students will learn the physiological and psychological effects of alcohol and other drugs, and the effects of substance abuse on individuals, families, and communities. 4cr."
    },
    {
        "course_code": "SED CE 801",
        "course_title": "Cog Affect Bases of Behavior",
        "description": "The course will examine the central themes of cognitive psychology and how emotion/affect relate to these themes. Findings from experimental cognitive psychology, cognitive neuroscience, and emotion research will be considered. 4 cr. Either sem."
    },
    {
        "course_code": "SED CE 802",
        "course_title": "Social Bases of Behavior",
        "description": "An overview of the major social psychological theories and issues, including seminal and contemporary studies. Examines the central themes of social psychology and how emotion/affect, cognition, and behavior all relate to these themes. 4 cr. Either sem."
    },
    {
        "course_code": "SED CE 809",
        "course_title": "History & Systems of Psychology",
        "description": "Surveys the philosophical and theoretical foundations of psychology. Examines and interrogates psychology's Western worldviews and conceptions of knowledge, claims of objectivity, and sociopolitical neutrality. Also investigates the theories that shaped the emergence of mental health treatment and approaches to treatment. 4cr. Either sem."
    },
    {
        "course_code": "SED CE 820",
        "course_title": "Comprehensive Project",
        "description": "The Comprehensive Project is an elective for all School or Child and Adolescent Mental Health Counseling students, to be completed in their final semester of study. Under the direction of their advisor, students develop and execute a research project, complete a comprehensive literature review, or develop and initiate an intervention, program, or curriculum. CPAHD students only; others with instructor permission. 3 cr."
    },
    {
        "course_code": "SED CE 826",
        "course_title": "Intellectual and Behavioral Assessment (Child)",
        "description": "An applied/practical review of various forms of clinical child/family assessments including: structured and unstructured clinical interviewing; cognitive and achievement testing; behavioral and observational techniques; and visual-motor tasks; and assessments specifically designed to target symptoms of particular psychological disorders. 2 cr. Either sem."
    },
    {
        "course_code": "SED CE 840",
        "course_title": "Psychodynamics of Marriage and Family",
        "description": "This is an introductory course that includes a comprehensive overview of the field of family systems and family therapy. This course will serve as an introduction to the theory and techniques of couples and family therapy. An attempt will be made to integrate theory and practice through assignments, class activities, and personal and professional self- reflection. Students will have the opportunity to reflect upon how they might actually use course content professionally in their respective disciplines. 4 cr."
    },
    {
        "course_code": "SED CE 841",
        "course_title": "Theories of Human Development (Infancy, Childhood, and Early  Adolescence)",
        "description": "Provides opportunities for understanding the fundamental inquiries, assumptions, theories, methodologies, and controversies that comprise the discipline of developmental psychology. Presents an in-depth historical and contemporary approach to the yet-enigmatic processes of human development throughout infancy, childhood, and early adolescence. required for all counseling students. Permission of instructor necessary. 4cr, 1st sem."
    },
    {
        "course_code": "SED CE 842",
        "course_title": "Theories of Human Development (Adolescence and Adulthood)",
        "description": "Provides opportunities for understanding the fundamental inquiries, assumptions, theories, methodologies, and controversies that comprise the discipline of developmental psychology. Presents an in-depth historical and contemporary approach to the yet-enigmatic processes of human development during adolescence and throughout adolescence and adulthood. Required for all counseling students. Permission of instructor necessary. 4cr, 2nd sem."
    },
    {
        "course_code": "SED CE 846",
        "course_title": "Practicum",
        "description": "Graduate Prerequisites: Graduate Prerequisites: Open only to matriculated graduate students who have completed prerequisites. Supervised field experience with students assuming responsibility for counseling, testing, placement, and follow-up of clients. Fieldwork w/lecture. 4 cr. Either sem.",
        "prerequisites": "Graduate Prerequisites: Open only to matriculated graduate students who have completed prerequisites."
    },
    {
        "course_code": "SED CE 847",
        "course_title": "Theories of Group Counseling",
        "description": "A conceptual and experiential introduction to group dynamics. Participation in ongoing training group while studying the dynamics of group development. Covers group counseling approaches and models, issues of small group leadership, and styles of leadership. Treatment of group counseling goals, composition, phases, and research. 4 cr."
    },
    {
        "course_code": "SED CE 848",
        "course_title": "Proseminar on Effective Interventions (Child)",
        "description": "An in-depth review of the principles of counseling youth, with particular emphasis on empirically supported treatments (EST's). Reviews theoretical perspectives and their research bases; explores change processes and outcomes associated with child psychotherapy; examines current state of the \"EST's\" literature. 2 cr. Either sem."
    },
    {
        "course_code": "SED CE 849",
        "course_title": "Proseminar on Effective Interventions (Adults)",
        "description": "An in-depth review of the principles of counseling with adults, with particular emphasis on empirically supported treatments. Reviews theoretical perspectives and their research bases; explores change processes and outcomes associated with adult psychotherapy; examines current state of the literature. 2 cr. Either sem."
    },
    {
        "course_code": "SED CE 850",
        "course_title": "Proseminar on Counseling and Psychotherapy Supervision and Consultation",
        "description": "Introduction to contemporary counseling and psychotherapy supervision and consultation theory, research and practice. Examines current models and relevant efficacy research, encourages students to identify models and approaches that are consistent with their developing professional theoretical orientation and interests. 2 cr. Either sem."
    },
    {
        "course_code": "SED CE 851",
        "course_title": "Proseminar on Vocational Psychology",
        "description": "An advanced exploration of contemporary vocational theory, research, and practice. Examines current research and pedagogy in vocational psychology, particularly in relation to equity, social justice, and multiculturalism. 2cr. Either sem."
    },
    {
        "course_code": "SED CE 852",
        "course_title": "Prevention in Counseling Psychology",
        "description": "An advanced exploration of contemporary counseling psychology research and methods in the field of prevention, with a particular focus on issues of equity, social justice, and multiculturalism. 2cr. Either sem."
    },
    {
        "course_code": "SED CE 853",
        "course_title": "Proseminar on Counseling Health Psychology",
        "description": "Critical reviews of contemporary counseling psychology research topics and methods in the field of health psychology. Issues of equality and social justice, and multiculturalism will be explored in relation to health and wellness promotion and outcomes. 2 cr. Either sem."
    },
    {
        "course_code": "SED CE 854",
        "course_title": "Proseminar on Advanced Research in Counseling Psychology",
        "description": "An advanced exploration of contemporary research topics and methods in the field of Counseling Psychology. Students develop research ideas that will advance the counseling psychology knowledge base. 2cr. Either sem."
    },
    {
        "course_code": "SED CE 926",
        "course_title": "Advanced Clinical Child Assessment Practicum",
        "description": "Graduate Prerequisites: courses in psychopathology, psychological testing, and personality theory. This serves as an advanced practicum addressing the domain of clinical child assessment. Emphasis is placed on evidence-based assessment practices and culturally competent, ecologically-based, case conceptualization. Fldwk w/ seminar. Instructor permission required. 2cr. Either sem.",
        "prerequisites": "courses in psychopathology, psychological testing, and personality theory."
    },
    {
        "course_code": "SED CE 946",
        "course_title": "Advanced Practicum",
        "description": "Graduate Prerequisites: Open only to matriculated graduate students who have completed prerequisites. Supervised field experience with students assuming major responsibility for counseling, testing, placement, and follow-up of clients. Fieldwork w/lecture. Variable credit. Either sem.",
        "prerequisites": "Open only to matriculated graduate students who have completed prerequisites."
    },
    {
        "course_code": "SED CE 947",
        "course_title": "Externship Practicum Placement",
        "description": "Graduate Prerequisites: SED CE 847; Open only to matriculated graduate students who have completed prerequisites. Supervised field experience completed in the 4th year or beyond with students assuming major responsibility for counseling, testing, placement, and follow- up of clients. Fieldwork w/lecture. Variable credit. Either sem.",
        "prerequisites": "SED CE 847; Open only to matriculated graduate students who have completed prerequisites."
    },
    {
        "course_code": "SED CE 948",
        "course_title": "Practicum in Supervision in Counseling",
        "description": "Examination of supervision of counseling in theory, process, and practice. Assumption of direct supervisory responsibility. Permission of the instructor required. Fldwk w/ seminar. Variable credit. Either sem."
    },
    {
        "course_code": "SED CE 949",
        "course_title": "APPIC Internship in Counseling Psychology",
        "description": "Graduate Prerequisites: Open only to matriculated graduate students who have completed prerequisites. APPIC internship, with students assuming major responsibility for counseling, testing, placement, and follow-up of clients. Fieldwork. 2 cr. Either sem.",
        "prerequisites": "Open only to matriculated graduate students who have completed prerequisites."
    },
    {
        "course_code": "SED CF 510",
        "course_title": "Child and Adolescent Mental Health",
        "description": "Provides students with initial competencies to understand, assess, and critique diagnostic issues of the major psychological disorders of childhood and adolescence. Cross-cultural comparisons introduce students to a wide variety of help-seeking and help-giving models to assist children and adolescents coping with adversity. Effective Fall 2022, this course fulfills a single unit in the following BU Hub area: Global Citizenship and Intercultural Literacy. BU Hub Learn More Global Citizenship and Intercultural Literacy",
        "BU_Hub": [
            "Global Citizenship and Intercultural Literacy"
        ]
    },
    {
        "course_code": "SED CF 617",
        "course_title": "Bereavement Care",
        "description": "Examines theories about loss and bereavement and individual responses to various types of losses. Prepares students to provide bereavement interventions for individuals and groups. 4 cr"
    },
    {
        "course_code": "SED CF 737",
        "course_title": "Working with Parents",
        "description": "Examines principles for organizing individual and group parenting education that builds on parental knowledge and responds to parental needs. Examines supportive, therapeutic, and educational models, materials, and resources. Develops communication skills and leadership capacities to work with parents in school, healthcare, family support, and home settings. 4 cr"
    },
    {
        "course_code": "SED CH 515",
        "course_title": "Curriculum Methods, 1-6",
        "description": "Graduate Prerequisites: Graduate students only. Stamped approval required. Examines theories of and develops specific competencies in reading and language arts, social studies and science education; general teaching strategies; basic elements of curriculum design; and institutional policies and practices of elementary education. Develops competency in providing effective instruction across the curriculum to culturally and linguistically diverse learners. Includes application of these competencies in field settings. Application of these competencies in field settings. Instructor permission required. Seminar with fieldwork. 10 cr.",
        "prerequisites": "Graduate students only. Stamped approval required."
    },
    {
        "course_code": "SED CH 516",
        "course_title": "Elem Ela Method",
        "description": "Examines theories of and develop specific competencies in reading and language arts; general teaching strategies; basic elements of curriculum design; and institutional policies and practices of elementary education. Develops competency in providing effective instruction across the language arts curriculum to culturally and linguistically diverse learners. 3 cr."
    },
    {
        "course_code": "SED CH 517",
        "course_title": "Elem Sci Method",
        "description": "Examines theories of and develop specific competencies in social studies; general teaching strategies; basic elements of curriculum design; and institutional policies and practices of elementary education. Develops competency in providing effective social studies instruction across the curriculum to culturally and linguistically diverse learners. 3 cr."
    },
    {
        "course_code": "SED CH 518",
        "course_title": "Elem Soc Method",
        "description": "Examines theories of and develop specific competencies in science education; general teaching strategies; basic elements of curriculum design; and institutional policies and practices of elementary education. Develops competency in providing effective science instruction across the curriculum to culturally and linguistically diverse learners. 3 cr."
    },
    {
        "course_code": "SED CH 656",
        "course_title": "S/Tch Elem 1-6",
        "description": "Supervised student teaching in a classroom for grades 1-6. Includes curriculum development, methods of instruction, and evaluation of the learner. Open only to degree candidates who have completed methods courses. Fldwk w/ seminar."
    },
    {
        "course_code": "SED CL 210",
        "course_title": "Child and Family Health Systems",
        "description": "Introduces students to the history and development of the U.S. health care system from a family-centered care perspective, including identification of the organizations and professional disciplines serving children and their families. Focuses on the psychosocial, financial and emotional costs of health care and introduces students to the profession of Child Life. 4 cr"
    },
    {
        "course_code": "SED CL 520",
        "course_title": "Child Development and Family in Healthcare",
        "description": "Introduces research and literature on the psychosocial needs of children and families in health care settings. Focuses on theories of development, play, preparation, coping and delivery of family-centered care in the context of health care. 4 cr"
    },
    {
        "course_code": "SED CL 521",
        "course_title": "Methods and Materials in Child Life",
        "description": "Explores relationships between child life play activities and child development theories, stressing the acquisition of practical skills needed for child life programming. 4 cr"
    },
    {
        "course_code": "SED CL 522",
        "course_title": "Clinical Issues in Child Development and Child Life",
        "description": "Provides skills to plan, implement, document, and assess developmentally appropriate child life interventions including coping with medical procedures, family-centered care, ethics, expressive activities, crisis intervention, and pain management. 4 cr"
    },
    {
        "course_code": "SED CL 523",
        "course_title": "Clinical Internship and Seminar I (400 hr)",
        "description": "Provides a 400-hour internship opportunity under the direct supervision of a certified Child Life Specialist in a hospital setting with focus on developing skills based on the Child Life Competencies. Students participate in weekly process seminar at the college. 8 cr"
    },
    {
        "course_code": "SED CL 620",
        "course_title": "Child Life Program Development",
        "description": "Provides skills to plan, implement, document, and assess Child Life program objectives and strategic planning, including child health systems, alternative settings, grant writing, professional presentations, group dynamics, interdisciplinary collaboration, and supervision. 4 cr"
    },
    {
        "course_code": "SED CL 621",
        "course_title": "Clinical Internship and Seminar II (200 hr)",
        "description": "Provides a 200-hour internship opportunity under the direct supervision of a certified Child Life Specialist in a community, outpatient, or primary care setting with a focus on developing skills based on the Child Life Competencies. 4 cr"
    },
    {
        "course_code": "SED CT 375",
        "course_title": "Pre-Practicum in Secondary Schools",
        "description": "Undergraduate Prerequisites: course only open to students matriculated in a secondary education major (Social Studies, English Education, Modern World Language education) Pre-practicum experience that engages students in observing and assisting in middle and/or high school classrooms. 2cr. Effective Fall 2019, this course fulfills a single unit in the following BU Hub area: Teamwork/Collaboration. BU Hub Learn More Teamwork/Collaboration",
        "prerequisites": "course only open to students matriculated in a secondary education major (Social Studies, English Education, Modern World Language education)",
        "BU_Hub": [
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED CT 500",
        "course_title": "Directed Study",
        "description": "Prereq: Approval of advisor. Signed plan of study must be submitted in advance of registration on a Directed study form obtained from the SED Office of Records. Student initiated directed study to be completed with faculty member. Var cr."
    },
    {
        "course_code": "SED CT 526",
        "course_title": "Family & Community Engagement for Teachers",
        "description": "Explores the ways that schools can work closely with families, communities, and community agencies to increase connections and mutual assistance. Consistent with DESE regulations, this course emphasizes collaborative relationships with families and with community partners such as youth- serving organizations, health and safety agencies, and other groups and businesses. 4cr."
    },
    {
        "course_code": "SED CT 534",
        "course_title": "A Practical Approach to Classroom Management",
        "description": "Designed to support middle and secondary teachers in developing a practical, effective and low-stress approach to classroom management. The course focuses on a classroom management system with four components: classroom structure, limit-setting, responsibility training and back-up systems. Participants will develop effective classroom management practices, break current \"high cost\" and ineffective strategies, and establish a proactive, positive classroom setting that maximizes time on learning and minimizes classroom disruptions. 2 cr."
    },
    {
        "course_code": "SED CT 556",
        "course_title": "Classroom Assessment",
        "description": "Emphasizes principles and procedures of assessment that are of primary importance to educational practitioners. Includes diagnostic tests, construction of classroom tests, observation techniques, and performance measures; norm- and criterion-referenced assessment; uses of standardized tests, current issues and controversies. 4cr."
    },
    {
        "course_code": "SED CT 721",
        "course_title": "Analysis and Design of Curriculum",
        "description": "This course explores theoretical approaches to curriculum design. Students analyze and critique curricula through a critical lens, and develop their own original curriculum map and unit plan for a course in their area of teaching using principles of backward design."
    },
    {
        "course_code": "SED CT 750",
        "course_title": "Basic Principles for Curriculum and Teaching",
        "description": "This course explores research into how people learn, contrasts models of teaching, and examines contemporary research- and standards-based approaches to teaching and learning. Students engage in micro-teachings and design learning plans using principles of backward design. 4cr. either sem."
    },
    {
        "course_code": "SED CT 799",
        "course_title": "Master's Thesis in Curriculum and Teaching",
        "description": "Students seeking to complete a master's thesis must present a proposal and secure approval of their advisor. 4 cr."
    },
    {
        "course_code": "SED CT 802",
        "course_title": "Field Experience in Curriculum and Teaching",
        "description": "Graduate Prerequisites: Open only to matriculated graduate students who have completed prerequisites. Consent of department chairman required. Supervised field experience for students holding professional appointments. Must meet field of knowledge requirements and professional preparation that is equivalent to licensure sequence. Open only to matriculated graduate students who have completed prerequisites. Instructor permission required. 8 cr",
        "prerequisites": "Open only to matriculated graduate students who have completed prerequisites. Consent of department chairman required."
    },
    {
        "course_code": "SED CT 900",
        "course_title": "Independent Study",
        "description": "Prereq: Approval of advisor. Signed plan of study must be submitted in advance of registration on an Independent study form obtained from the SED Office of Records. See SED AP 900 for description. Var cr."
    },
    {
        "course_code": "SED CT 999",
        "course_title": "Dissertation Advisement",
        "description": "See SED AP 999 for description."
    },
    {
        "course_code": "SED DC 900",
        "course_title": "Independent Study",
        "description": "Prereq: Approval of advisor. Signed plan of study must be submitted in advance of registration on an Independent study form obtained from the SED Office of Records. See SED AP 900 for description. Var cr."
    },
    {
        "course_code": "SED DE 300",
        "course_title": "Introduction to the Deaf World",
        "description": "Designed to provide a general overview to the lives, orientations and typical experiences of American Deaf people who use American Sign Language. This course aims to understand some of the fundamental factors that impact the lives of Deaf People, both positively and negatively. Finally, we will generate ideas about how to enhance the general perspective of the Deaf World as a vibrant cultural and linguistic minority. The intention is for students to be better equipped to be advocates and partners with Deaf People. Effective Fall 2022, this course fulfills a single unit in each of the following BU Hub areas: Global Citizenship and Intercultural Literacy, The Individual in Community, Teamwork/Collaboration. BU Hub Learn More The Individual in CommunityGlobal Citizenship and Intercultural LiteracyTeamwork/Collaboration",
        "BU_Hub": [
            "The Individual in Community",
            "Global Citizenship and Intercultural Literacy",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED DE 340",
        "course_title": "Dynamics of Diversity, Oppression, and Social Justice within Deaf Communities",
        "description": "Examines theories and applications of diversity, dynamics of oppression, and social justice through a Deaf Studies lens. Explores the interrelated principles of social justice, equity, access, participation, and human rights, and the impact of these movements on Deaf communities. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry I, Ethical Reasoning, Critical Thinking. BU Hub Learn More Social Inquiry IEthical ReasoningCritical Thinking",
        "BU_Hub": [
            "Social Inquiry I",
            "Ethical Reasoning",
            "Critical Thinking"
        ]
    },
    {
        "course_code": "SED DE 350",
        "course_title": "Deaf History and Culture",
        "description": "Analysis and discussion of the historical and cultural aspects of Deaf Culture; the influence of geographic, cultural, educational, and economic forces on Deaf people; and the patterns of social change during the nineteenth and twentieth centuries. Introduces students to specific cultural and historical experiences and acquaints them with literature in the field. 4 cr Effective Spring 2023, this course fulfills a single unit in each of the following BU Hub areas: Global Citizenship and Intercultural Literacy, The Individual in Community, Teamwork/Collaboration. BU Hub Learn More The Individual in CommunityGlobal Citizenship and Intercultural LiteracyTeamwork/Collaboration",
        "BU_Hub": [
            "The Individual in Community",
            "Global Citizenship and Intercultural Literacy",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED DE 351",
        "course_title": "Deaf Literature and Visual Arts",
        "description": "An investigation of the narrative traditions of the Deaf community that weaves together threads from a variety of disciplines and analytical perspectives resulting in a comprehensive study of literature, visual arts, performance, as well as culture. The study will provide insights into the fundamental role that literature and artistic compositions play in revealing culture and the natural inclination humans have to share \"stories.\" Students become more thoughtful consumers of creative art and enhance their appreciation for the contributions of the Deaf World. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Digital/Multimedia Expression, Aesthetic Exploration, Creativity/Innovation. BU Hub Learn More Aesthetic ExplorationDigital/Multimedia ExpressionCreativity/Innovation",
        "BU_Hub": [
            "Aesthetic Exploration",
            "Digital/Multimedia Expression",
            "Creativity/Innovation"
        ]
    },
    {
        "course_code": "SED DE 352",
        "course_title": "Capstone - Deaf Studies",
        "description": "Students work collaboratively to create a large project that showcases the skills and knowledge they have acquired and benefits the Deaf community in some way. This course is intended for senior majoring or minoring in Deaf Studies. 4 cr. Either sem."
    },
    {
        "course_code": "SED DE 372",
        "course_title": "Social Psychology and the Deaf World",
        "description": "This courses explores the psychological, sociological, and educational constructions of Deaf people and how cultural, social, and medical models contribute to our perceptions about social arrangements, \"bodies,\" and the politics of difference. We will use ideas from a host of disciplines, events, and experiences to illuminate how many of the issues related to the Deaf World are universal, human issues. Finally, we will hope to arrive at conclusions that showcase how studying the Deaf World can have many important implications for understanding human development. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Philosophical Inquiry and Life's Meanings, Social Inquiry I. BU Hub Learn More Philosophical Inquiry and Life's MeaningsSocial Inquiry I",
        "BU_Hub": [
            "Philosophical Inquiry and Life's Meanings",
            "Social Inquiry I"
        ]
    },
    {
        "course_code": "SED DE 381",
        "course_title": "American Sign Language I",
        "description": "Introduces American Sign Language (ASL) and Deaf Culture, focusing on frequently used signs, basic rules of grammar, non-manual aspects of ASL, introductory fingerspelling, and some cultural features of the Deaf community. 4cr."
    },
    {
        "course_code": "SED DE 382",
        "course_title": "American Sign Language II",
        "description": "This is the second level of American Sign Language (ASL). It is designed for the further development of students' proficiency in ASL, focusing on somewhat less frequently used signs, more complex lexical and grammatical structures, and more advanced conversational skills. Effective Fall 2019, this course fulfills a single unit in each of the following BU Hub areas: The Individual in Community, Oral and/or Signed Communication. 4cr. Prereq: SED DE 381/581. 4 cr. BU Hub Learn More The Individual in CommunityOral and/or Signed Communication",
        "BU_Hub": [
            "The Individual in Community",
            "Oral and/or Signed Communication"
        ]
    },
    {
        "course_code": "SED DE 383",
        "course_title": "American Sign Language III",
        "description": "An intermediate course designed for students who have completed a minimum of ASL 2 offers a more in-depth exposure to ASL with an emphasis on receptive and expressive skills. This course will present further exposure to more sophisticated dialogues, vocabulary, acquiring ASL expressions, proficiency in ASL grammar and basic ASL discourse as well as register forms, pragmatics, and storytelling. Prereq: SED DE 382/582. 4 cr."
    },
    {
        "course_code": "SED DE 384",
        "course_title": "American Sign Language IV",
        "description": "An advanced course designed for students who have completed a minimum of American Sign Language 3. ASL 4 offers a more in-depth discussion in ASL with an emphasis on receptive and expressive skills. This course will present further exposure to more sophisticated dialogues, vocabulary, acquiring ASL expressions, proficiency in ASL grammar and basic ASL discourse as well as register forms, pragmatics, and storytelling. Prereq: SED DE 383/583. 4 cr."
    },
    {
        "course_code": "SED DE 385",
        "course_title": "Applied ASL",
        "description": "Open to students who have completed two years of ASL who are ready for advanced language training. This course will focus on the production, analysis, and evaluation of advanced vocabulary, syntax and register variation in ASL. 4cr, either sem."
    },
    {
        "course_code": "SED DE 386",
        "course_title": "Academic ASL",
        "description": "Focus on academic ASL in the bilingual teaching of content areas (English, Language Arts, History, Mathematics, Science) paying special attention to concepts vocabulary and terminology that commonly appear in the content areas. 4 cr."
    },
    {
        "course_code": "SED DE 472",
        "course_title": "Sign Language Structure",
        "description": "Covers the structure of sign languages, with a primary focus on American Sign Language. Topics include phonology, morphology, syntax, lexicology, language variation, psycholinguistics, and language emergence. Effective Spring 2021, this course fulfills a single unit in each of the following BU Hub areas: Scientific Inquiry I, Research and Information Literacy. BU Hub Learn More Scientific Inquiry IResearch and Information Literacy",
        "BU_Hub": [
            "Scientific Inquiry I",
            "Research and Information Literacy"
        ]
    },
    {
        "course_code": "SED DE 500",
        "course_title": "Introduction to the Deaf-World",
        "description": "Designed to provide a general introduction to the lives, history, and culture of American Deaf people who use American Sign Language (ASL) as their vernacular language. The role of schools in the formation of the community and maintenance of ASL will be examined. 4 cr."
    },
    {
        "course_code": "SED DE 550",
        "course_title": "History and Culture of the Deaf",
        "description": "Analysis and discussion of the historical and cultural aspects of the Deaf; the influence of geographic, cultural, educational, and economic forces on Deaf people; and the patterns of social change during the nineteenth and twentieth centuries. Introduces students to specific cultural and historical experiences and acquaints them with literature in the field. 4 cr."
    },
    {
        "course_code": "SED DE 551",
        "course_title": "Teaching Deaf Literature and Visual Arts",
        "description": "An applied course designed to highlight, review, and organize instructional practices as they apply to Deaf Literature and visual compositions. We will work to understand how ASL literature and visual arts can be integrated into a comprehensive approach to Standards for composition and literature analysis."
    },
    {
        "course_code": "SED DE 553",
        "course_title": "Introduction to Counseling Deaf Individuals",
        "description": "Introduction to the theory and practice of counseling Deaf children, adolescents, and adults."
    },
    {
        "course_code": "SED DE 572",
        "course_title": "Social Psychology and the Deaf World",
        "description": "A study of concepts and research related to the psychological, sociological, and educational constructions of Deaf people (children and adults). Ideas from a host of disciplines, events, and matters -large and small- will illuminate how Deaf World issues are often universal, human issues. This graduate level work will focus on the implications for future teachers."
    },
    {
        "course_code": "SED DE 573",
        "course_title": "Topics in Speech, Language, and Hearing for Deaf Educators",
        "description": "Provides an overview of the roles of speech-language pathologists and audiologists as they relate to deaf and hard hearing children. This course offers foundational knowledge and practical methodology in teaching spoken language skills to deaf and hard of hearing children. Review of medical, speech, language and hearing research related to Deaf and hard-of-hearing children will be included. This course also describes the assessment of hearing levels, interpreting audiograms, function and maintenance of hearing assistive technologies (e.g., hearing aids, cochlear implants, and BAHAs), and understanding educational supports available via Early Intervention, IFSPs and IEPs. 2cr."
    },
    {
        "course_code": "SED DE 575",
        "course_title": "ASL Development in Deaf Children",
        "description": "Graduate Prerequisites: SED LS 560 and SED LS 565. The first in a two-part sequence designed to develop an understanding of language development in deaf children. Topics include acquisition of ASL, the effect of delayed language exposure on later development, visual attention, bilingual language development, the relationship between language and cognitive skills, and the development of meta-linguistic awareness. The focus is on major theories and research findings, as well as how to apply these findings in designing classroom instruction for deaf children from a range of backgrounds.",
        "prerequisites": "SED LS 560 and SED LS 565."
    },
    {
        "course_code": "SED DE 576",
        "course_title": "Bilingual ASL/English Development, Assessment, and Planning for Deaf Children",
        "description": "Graduate Prerequisites: SED DE 575. The second in a two-part sequence designed to develop an understanding of language development in deaf children. Emphasizes the application of concepts covered in the first semester. Specific topics include classroom placement, assessment of ASL ability, application of bilingual approaches, and language planning. 4 cr.",
        "prerequisites": "SED DE 575."
    },
    {
        "course_code": "SED DE 577",
        "course_title": "ASL/English Bilingual Instruction",
        "description": "This course is part 1 of a 2-part series (along with DE 578). Students will review a range of (ASL/English) bilingual instructional strategies. We will explore novel ways to include both ASL and written English in the delivery of content-area teaching. A focus is on designing instruction that encourages Deaf and hard of hearing children to access various literacy tasks in both ASL and English."
    },
    {
        "course_code": "SED DE 578",
        "course_title": "ASL/English Literacy Instruction",
        "description": "This course is part 2 of a 2-part series about teaching ASL and English as a subject matter. Special focus is on building metalinguistic awareness about ASL and English, considerations for applied literacy in each language, and principles of instruction all designed to build \"bridges\" that link the disparate structures of ASL and English."
    },
    {
        "course_code": "SED DE 581",
        "course_title": "American Sign Language I",
        "description": "Introduces American Sign Language (ASL) and Deaf Culture, focusing on frequently used signs, basic rules of grammar, non-manual aspects of ASL, introductory fingerspelling, and some cultural features of the Deaf community. 4cr."
    },
    {
        "course_code": "SED DE 582",
        "course_title": "American Sign Language II",
        "description": "This is the second level of American Sign Language (ASL). It is designed for the further development of students' proficiency in ASL, focusing on somewhat less frequently used signs, more complex lexical and grammatical structures, and more advanced conversational skills. Effective Fall 2019, this course fulfills a single unit in each of the following BU Hub areas: The Individual in Community, Oral and/or Signed Communication. 4cr. Prereq: SED DE 381/581. 4 cr. BU Hub Learn More The Individual in CommunityOral and/or Signed Communication",
        "BU_Hub": [
            "The Individual in Community",
            "Oral and/or Signed Communication"
        ]
    },
    {
        "course_code": "SED DE 583",
        "course_title": "American Sign Language III",
        "description": "An intermediate course designed for students who have completed a minimum of ASL 2 offers a more in-depth exposure to ASL with an emphasis on receptive and expressive skills. This course will present further exposure to more sophisticated dialogues, vocabulary, acquiring ASL expressions, proficiency in ASL grammar and basic ASL discourse as well as register forms, pragmatics, and storytelling. Prereq: SED DE 382/582. 4 cr."
    },
    {
        "course_code": "SED DE 584",
        "course_title": "American Sign Language IV",
        "description": "An advanced course designed for students who have completed a minimum of American Sign Language 3. ASL 4 offers a more in-depth discussion in ASL with an emphasis on receptive and expressive skills. This course will present further exposure to more sophisticated dialogues, vocabulary, acquiring ASL expressions, proficiency in ASL grammar and basic ASL discourse as well as register forms, pragmatics, and storytelling. Prereq: SED DE 383/583. 4 cr."
    },
    {
        "course_code": "SED DE 585",
        "course_title": "Applied ASL",
        "description": "Open to students who have completed two years of ASL who are ready for advanced language training. This course will focus on the production, analysis, and evaluation of advanced vocabulary, syntax and register variation in ASL. 4cr, either sem."
    },
    {
        "course_code": "SED DE 586",
        "course_title": "Academic ASL",
        "description": "Focus on academic ASL in the bilingual teaching of content areas (English, Language Arts, History, Mathematics, Science) paying special attention to concepts vocabulary and terminology that commonly appear in the content areas. 4 cr."
    },
    {
        "course_code": "SED DE 640",
        "course_title": "Dynamics of Diversity, Oppression, and Social Justice within Deaf Communities",
        "description": "Examines theories and applications of diversity, dynamics of oppression, and social justice through a Deaf Studies lens. Explores the interrelated principles of social justice, equity, access, participation, and human rights, and the impact of these movements on Deaf communities. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry I, Ethical Reasoning, Critical Thinking. BU Hub Learn More Social Inquiry IEthical ReasoningCritical Thinking",
        "BU_Hub": [
            "Social Inquiry I",
            "Ethical Reasoning",
            "Critical Thinking"
        ]
    },
    {
        "course_code": "SED DE 672",
        "course_title": "Sign Language Structure",
        "description": "Undergraduate Prerequisites: SED DE 571. Graduate Prerequisites: SED DE 571. Covers the structure of sign languages, with a primary focus on American Sign Language. Topics include phonology, morphology, syntax, lexicology, language variation, psycholinguistics, and language emergence. Effective Spring 2021, this course fulfills a single unit in each of the following BU Hub areas: Scientific Inquiry I, Research and Information Literacy. BU Hub Learn More Scientific Inquiry IResearch and Information Literacy",
        "prerequisites": "SED DE 571.",
        "BU_Hub": [
            "Scientific Inquiry I",
            "Research and Information Literacy"
        ]
    },
    {
        "course_code": "SED DS 502",
        "course_title": "Introduction to Adolescent Development",
        "description": "Develops important understandings of cognitive, social-emotional, and identity developing during adolescence, as well as the role that educators can play in fostering the mindsets, skillsets, character strengths and contexts that adolescents need to grow into healthy and high-performing adults. 2 cr. Effective Fall 2018, this course fulfills a single unit in the following BU Hub area: Social Inquiry I. BU Hub Learn More Social Inquiry I",
        "BU_Hub": [
            "Social Inquiry I"
        ]
    },
    {
        "course_code": "SED DS 504",
        "course_title": "Adolescent Development",
        "description": "Overview of diverse development theories of preadolescence, adolescence, and young adult development. Cognitive, sociomoral, personal, and identity development are examined as well as physical, motor, and fitness development. 3 cr."
    },
    {
        "course_code": "SED DS 700",
        "course_title": "Advanced Seminar in Sport, Exercise, and Performance Psychology",
        "description": "Current and advanced topics in the field of Sport, Exercise, and Performance Psychology will be covered in this course, which is based on the scientist- practitioner model. Students will learn how to design research projects and evidence-based interventions in the field. 4 cr."
    },
    {
        "course_code": "SED EC 305",
        "course_title": "Child Development and Early Childhood Education",
        "description": "Undergraduate Prerequisites: CAS PS 101; Stamped approval required. Wheelock Students Only Analyzes the physical, cognitive, language, social, and emotional domains of development in young children from birth to middle childhood. Includes both descriptive information (milestones) and theory (processes accounting for development) and stresses application of these to early education. Prereq: CAS PS 101. 4 cr. Effective Fall 2019, this course fulfills a single unit in the following BU Hub area: Social Inquiry I. BU Hub Learn More Social Inquiry I",
        "prerequisites": "CAS PS 101; Stamped approval required. Wheelock Students Only",
        "BU_Hub": [
            "Social Inquiry I"
        ]
    },
    {
        "course_code": "SED EC 350",
        "course_title": "Introduction to Early Childhood Education",
        "description": "Presents key topics in early childhood education so that students establish basic understandings of the field, including: historical foundations, the role of the teacher, nature of the young child and the role of play in early education. This course is designed for students who are majors in Early Childhood Education or are considering this field of study. 4 cr. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, The Individual in Community, Teamwork/Collaboration. BU Hub Learn More The Individual in CommunityOral and/or Signed CommunicationTeamwork/Collaboration",
        "BU_Hub": [
            "The Individual in Community",
            "Oral and/or Signed Communication",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED EC 405",
        "course_title": "Preschool Curriculum and Fieldwork",
        "description": "Undergraduate Prerequisites: SED ED 200 and SED EC 305; Stamped approval required. Supervised teaching of 2.93-to-5-year-olds. Emphasis on applying knowledge of development and child observation skills to planning curriculum, guiding behavior, arranging a classroom environment, and adapting teaching to special learners, including English language learners, in a play-based setting. Fldwk w/ seminar. Instructor permission required. 8 cr.",
        "prerequisites": "SED ED 200 and SED EC 305; Stamped approval required."
    },
    {
        "course_code": "SED EC 453",
        "course_title": "Early Childhood Practicum K",
        "description": "Undergraduate Prerequisites: SED EC 350 and SED EC 405; Stamped approval required. Develops competency in reading and language skills, social studies and science education, basic elements of curriculum design, and the institutional policies and practices of early childhood education. Includes 100 hours of supervised student teaching in a public school kindergarten classroom. Fldwk w/ seminar. Instructor permission required. 8 cr.",
        "prerequisites": "SED EC 350 and SED EC 405; Stamped approval required."
    },
    {
        "course_code": "SED EC 502",
        "course_title": "Special Topics in Early Childhood Education",
        "description": "Graduate Prerequisites: Open to graduate students only. Open to graduate students only. Focuses on a topic of current interest in early childhood education. Master's students may take this course for credit toward their degrees.",
        "prerequisites": "Open to graduate students only."
    },
    {
        "course_code": "SED EC 506",
        "course_title": "Current Issues & Early Childhood Education",
        "description": "Topics pertinent to current educational issues and practices concerning Early Childhood Education. Policy, pedagogical practices, and educational philosophies are among the topics. Course focus varies in response to opportunities such as exhibits and prominent changes in educational research. 2cr."
    },
    {
        "course_code": "SED EC 507",
        "course_title": "Role of Play in Early Child Education",
        "description": "Examines theories of play and the r. Role of play in cognitive, affective, and social development of the child. Strategies for applying research on playful learning in classrooms are explored; play and creativity. Field observation and analysis. 4 cr."
    },
    {
        "course_code": "SED EC 510",
        "course_title": "Preschool Practicum",
        "description": "Undergraduate Prerequisites: Stamped approval required. Graduate Prerequisites: Stamped approval required. Required in provisional certification program for majors. Includes 150 hours of supervised teaching of 3-to-5-year-olds. Emphasis on curriculum development, instructional planning, classroom management, assessment/evaluation, and adaption of teaching to special learners.",
        "prerequisites": "Stamped approval required."
    },
    {
        "course_code": "SED EC 511",
        "course_title": "Field Experiences in Early Childhood Curriculum and Prepracticum",
        "description": "Seminars and fieldwork in early childhood classrooms. Seminars examine instructional practices in literacy and language arts, social science, and science. Includes 100 hours of field experience in a public school kindergarten classroom. Fldwk w/ seminar. 4 cr, var cr."
    },
    {
        "course_code": "SED EC 512",
        "course_title": "Early Childhood Prek/K Fieldwork",
        "description": "Undergraduate Corequisites: SED EC 513. Students work with preschool/ kindergarten grade children and families to integrate theories of child development and culturally responsive developmentally appropriate practice. Students assume increasing responsibility for the management of the classroom, preparation of the environment, and implementation of curriculum."
    },
    {
        "course_code": "SED EC 516",
        "course_title": "Early Childhood Curriculum and Practicum, K",
        "description": "Graduate Prerequisites: SED EC 611; Stamped approval required. Open only to matriculated graduate students who have completed prerequisites. Graduate students only. Includes reading and the other language arts, social science and science education, as well as basic elements of curriculum design, instruction, assessment, and classroom management in early childhood classrooms, K-2. Application in field settings. Graduate Prereq: SED EC 611; Stamped approval required. Open only to matriculated graduate students who have completed prerequisites. Graduate students only. Fldwk w/ seminar. 4 cr.",
        "prerequisites": "SED EC 611; Stamped approval required. Open only to matriculated graduate students who have completed prerequisites. Graduate students only."
    },
    {
        "course_code": "SED EC 553",
        "course_title": "Early Childhood Curriculum and Practicum",
        "description": "Undergraduate Prerequisites: SED EC 453; Approval Required Required of students who seek licensure in early childhood education. Supervised student teaching in a 1- 2 classroom (for undergraduates only) including curriculum and planning implementation and evaluation of the learning. Includes twice monthly seminars. Fldwk w/ seminar. Prereq: SED EC 453. 10 cr.",
        "prerequisites": "SED EC 453; Approval Required"
    },
    {
        "course_code": "SED EC 559",
        "course_title": "Classroom-Based Assessment of Young Children, Pre k-2",
        "description": "Prepares individuals working in early childhood to conduct an assessment of children within the classroom. Students will evaluate assessment tools and gain skills necessary for classroom-based assessment. 2 cr"
    },
    {
        "course_code": "SED EC 560",
        "course_title": "STEM and Inquiry-Based Learning",
        "description": "Planning for and assessing inquiry-based learning in classrooms prek-2nd grade, with particular emphasis on STEM. Focus on empowering children and co-constructing learning for deep engagement and sense-making. Analyze and apply standards in science, math, and technology."
    },
    {
        "course_code": "SED EC 571",
        "course_title": "Socially and Emotionally Affirming Classrooms",
        "description": "Presents socially/emotionally affirming, culturally responsive classrooms for young children (prek-2nd). Explores supporting children's positive participation, building relationships with children and families, teaching social/emotional skills, developing interventions for children with a history of trauma, and behaviors that impede learning."
    },
    {
        "course_code": "SED EC 600",
        "course_title": "Ps Curr/Fldwrk",
        "description": null
    },
    {
        "course_code": "SED EC 605",
        "course_title": "Topics in Child Development and Education",
        "description": "Undergraduate Prerequisites: Wheelock Students Only Graduate Prerequisites: Stamped approval required. Analyzes selected aspects of development in young children from birth to middle childhood. In- depth coverage of selected aspects of development in children from birth to seven years. Includes both descriptive information (milestones) and theory (processes accounting for development). Stresses applications of these to early education. Taken concurrently with SED EC 611. Instructor permission required. 4 cr.",
        "prerequisites": "Wheelock Students Only"
    },
    {
        "course_code": "SED EC 608",
        "course_title": "Primary Practicum",
        "description": "Graduate Corequisites: SED EC 609. Supervised minimum 300 hour full semester student teaching in grade 1-2 classroom. Students apply theories of child development and culturally sustaining, developmentally appropriate practice. Increasing responsibility for curriculum, assessment, all aspects of the teacher role culminating in taking lead teacher role."
    },
    {
        "course_code": "SED EC 609",
        "course_title": "Primary Practicum Seminar",
        "description": "Graduate Corequisites: SED EC 608. Students in primary practicum (gr 1-2) meet to acquire and share dispositions, knowledge, strategies for curriculum development, implementation and assessment, teaching practices for anti-racist/anti-bias culturally sustaining learning environments, supporting bi-and multi-lingual learners, promoting social competence, building community, & partnering with families."
    },
    {
        "course_code": "SED EC 611",
        "course_title": "Preschool Curriculum and Prepracticum",
        "description": "Undergraduate Prerequisites: Approval required Graduate Prerequisites: Stamped approval required. Includes supervised teaching of 2.9-to-5-year-olds. Emphasis on applying knowledge of development and child observation skills to planning curriculum, guiding behavior, arranging a classroom environment, and adapting teaching to special learners, including English language learners, in a play-based setting. Open only to matriculated graduate students in the licensure program. 4 cr.",
        "prerequisites": "Approval required"
    },
    {
        "course_code": "SED EC 615",
        "course_title": "Field Experience & Seminar in Early Childhood Leadership, Policy, and Advocacy 1",
        "description": null
    },
    {
        "course_code": "SED EC 616",
        "course_title": "Field Experience & Seminar in Early Childhood Leadership, Policy, and Advocacy 2",
        "description": null
    },
    {
        "course_code": "SED EC 630",
        "course_title": "Child Development & Families in Societal and Cultural Contexts",
        "description": "This course aims to immerse students in major theories and seminal research related to child development and the role of the family. Students will learn about the child's social, emotional, physical, language, and cognitive development between birth and age 8."
    },
    {
        "course_code": "SED EC 653",
        "course_title": "Early Childhood Practicum, Grades 1-2",
        "description": "Undergraduate Prerequisites: Approval Required Graduate Prerequisites: SED EC 611; Stamped approval required. Provides one semester of supervised work in curriculum development, materials design, and classroom organization and management. Requires 5-day-per-week involvement in a Grades 1- 2 classroom and participation in five seminars. Prereq: SED EC 611; Instructor permission required. 8 cr.",
        "prerequisites": "Approval Required"
    },
    {
        "course_code": "SED ED 111",
        "course_title": "Educational Technology",
        "description": "This course focuses on different types of technology that have the potential to increase -- or distract from -- learning in informal and formal environments. We consider specific elements of educational technology scholarship and evaluate design elements of ed tech products."
    },
    {
        "course_code": "SED ED 200",
        "course_title": "Introduction to Justice-Based Education",
        "description": "Undergraduate Prerequisites: First-Year Writing Seminar (WR 120 or equivalent) This exploratory course introduces students to a critical history of schooling in America and the extent to which various philosophies of education can work (and have worked) in service of or in opposition to democratic and justice- oriented ends. Students will begin to cultivate a critically reflective stance toward classroom experiences, educational policies, their identities, and the intersection among them. This course requires 4 hours of field-based experience. Effective Fall 2022, this course fulfills a single unit in each of the following BU Hub areas: Writing-Intensive Course, The Individual in Community, Philosophical Inquiry and Life's Meanings. BU Hub Learn More Philosophical Inquiry and Life's MeaningsThe Individual in CommunityWriting-Intensive Course",
        "prerequisites": "First-Year Writing Seminar (WR 120 or equivalent)",
        "BU_Hub": [
            "Philosophical Inquiry and Life's Meanings",
            "The Individual in Community",
            "Writing-Intensive Course"
        ]
    },
    {
        "course_code": "SED ED 201",
        "course_title": "Tutoring Struggling Readers and Writers",
        "description": "This course is intended for those who are outside the profession of education (e.g. parents, community workers, non-SED students) to support children and adults who find learning to read and write difficult. The course will provide an introduction to the types of texts and teaching strategies that make a difference. 2 cr."
    },
    {
        "course_code": "SED ED 205",
        "course_title": "Designing Learning Experiences",
        "description": "This course focuses on the application of research and theories of teaching and learning to plan learning experiences across a variety of settings. Through a teaching for justice lens, students will develop and apply knowledge of approaches to learning."
    },
    {
        "course_code": "SED ED 206",
        "course_title": "Family & Community Engagement",
        "description": "Students will be invited to explore their own positionality towards and definitions of engagement, community, schools, and family, and learn how to best sustain and affirm the families and communities that they endeavor to serve. Effective Fall 2022, this course fulfills a single unit in each of the following BU Hub areas: Ethical Reasoning, Global Citizenship and Intercultural Literacy. BU Hub Learn More Global Citizenship and Intercultural LiteracyEthical Reasoning",
        "BU_Hub": [
            "Global Citizenship and Intercultural Literacy",
            "Ethical Reasoning"
        ]
    },
    {
        "course_code": "SED ED 213",
        "course_title": "Approaches to Learning",
        "description": "Examines research and theories of learning and their application to teaching and other education practices. Pays special attention to factors that influence learning, such as socio-cultural and linguistic. Provides opportunities for students to apply learning principles and theories to practice."
    },
    {
        "course_code": "SED ED 220",
        "course_title": "Theme-Based Approaches to Studying Complex Issues of Language in Education and    Human Development",
        "description": "Undergraduate Prerequisites: First Year Writing Seminar (WR120) Prerequisite for this course: First Year Writing Seminar (WR120). Effective Spring 2023, this course fulfills a single unit in each of the following BU Hub areas: Writing-Intensive Course, Ethical Reasoning, Critical Thinking. BU Hub Learn More Ethical ReasoningCritical ThinkingWriting-Intensive Course",
        "prerequisites": "First Year Writing Seminar (WR120)",
        "BU_Hub": [
            "Ethical Reasoning",
            "Critical Thinking",
            "Writing-Intensive Course"
        ]
    },
    {
        "course_code": "SED ED 230",
        "course_title": "Introduction to Design as Educational Inquiry",
        "description": "Students will learn how creating learning designs can facilitate understandings of participant learning. They will explore how a variety of learning settings have been designed and think critically about how to design future ones for care, dignity, and justice."
    },
    {
        "course_code": "SED ED 231",
        "course_title": "Tutoring Readers and Writers",
        "description": "This course is intended for those who are outside the profession of education (e.g. parents, community workers, non-SED students) to support children and adults who find learning to read and write difficult. The course will provide an introduction to the types of texts and teaching strategies that make a difference. 2 cr."
    },
    {
        "course_code": "SED ED 245",
        "course_title": "Theory and Practice of Peer Counseling",
        "description": "Examines the theory of peer counseling and the development of specific counseling skills. Students enrolled in this class will serve as peer advisors in the CAS First Year Seminar course. Effective Fall 2018, this course fulfills a single unit in the following BU Hub area: Oral and/or Signed Communication. BU Hub Learn More Oral and/or Signed Communication",
        "BU_Hub": [
            "Oral and/or Signed Communication"
        ]
    },
    {
        "course_code": "SED ED 246",
        "course_title": "Practicum in Peer Leadership and Mentoring",
        "description": "Provides advanced mentoring training and leadership experience for selected students who have completed ED 245 (Theory and Practice or Peer Counseling). Students will mentor the students serving as peer mentors in FY101 (First Year Seminar) and enrolled in ED245. Effective Fall 2018, this course fulfills a single unit in the following BU Hub area: Teamwork/Collaboration. BU Hub Learn More Teamwork/Collaboration",
        "BU_Hub": [
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED ED 350",
        "course_title": "Sense-making in Science, Technology, Engineering, and Mathematics",
        "description": "This course will deepen students' understanding of \"sense-making\" in science, mathematics, and engineering. Students analyze the opportunities they have had to make sense of concepts, explore new phenomena and ideas, attend to others' sensemaking, and connect sense-making to social justice."
    },
    {
        "course_code": "SED ED 410",
        "course_title": "Social Context of Education",
        "description": "Undergraduate Prerequisites: Juniors and seniors only. (SED ED 410 section C1 open to Non-SED students ONLY. All levels.) How culture, race, language, poverty, social change, urban pressures, and rural isolation affect the work of schools and other educational institutions, based upon reading, discussion, field research, and extensive writing by students. SED ED 410 A1 and ED 412 A1 must be taken in the same semester or ED 410 B1 in the fall and ED 412 B1 in the spring. 2cr.",
        "prerequisites": "Juniors and seniors only.  (SED ED 410 section C1 open to Non-SED students ONLY. All levels.)"
    },
    {
        "course_code": "SED ED 415",
        "course_title": "Educational Design for Transformative Social Futures Practicum II",
        "description": "This practicum will provide students with a foundation in ethnographic inquiry essential to educational design that aims to disrupt inequitable, unjust systems, and to create alternative models of learning as lived arguments for the possible."
    },
    {
        "course_code": "SED ED 416",
        "course_title": "Educational Design for Transformative Social Futures Seminar II",
        "description": "Students will delve into core work in ethnography as both a theory-building and interpretive methodological practice, study examples of ethnography in practice, and learn approaches to writing ethnographic fieldnotes and critically debriefing notes and experiences with others."
    },
    {
        "course_code": "SED ED 417",
        "course_title": "Practicum III",
        "description": "In this linked practicum/capstone experience, students will bring their innovative visions for social transformation to life within a practice-oriented Educational Design cohort. In this practicum, students will collaboratively imagine and innovate educational designs across multi-modalities and multiple settings."
    },
    {
        "course_code": "SED ED 471",
        "course_title": "Field Experience in Elementary Education",
        "description": "Use Language Arts as the anchor for an interdisciplinary approach to teaching and learning that disrupts the status quo of systemic inequity in classrooms, schooling, and non-traditional educational settings. Introduces basic elements of curriculum design at the elementary level."
    },
    {
        "course_code": "SED ED 472",
        "course_title": "Field Experience in Special Education",
        "description": "Focuses on educational needs and supports for students with disabilities through school-based special education and related services, and community agencies through two-day per week placement in area schools. Accompanying seminar."
    },
    {
        "course_code": "SED ED 473",
        "course_title": "Field Experience in Social Studies Education",
        "description": "This course supports students in their Humanities education teaching pre- practicum. Students complete teaching observations, reflect on field experiences, evaluate teaching practice against professional teaching standards, and develop and implement micro-teaching lessons."
    },
    {
        "course_code": "SED ED 474",
        "course_title": "Field Experience in World Language Education",
        "description": "Undergraduate Prerequisites: SEDED507 This course supports students in their teaching through a field experience. Students complete observations, reflect on field experiences, evaluate practice against professional standards, and develop and implement micro-teaching lessons.",
        "prerequisites": "SEDED507"
    },
    {
        "course_code": "SED ED 475",
        "course_title": "Field Experience in English Education",
        "description": "Undergraduate Prerequisites: SEDED507 In this seminar style course, students interested in pursuing teaching English/language arts will complete fieldwork in a local ELA classroom or other relevant site that focuses on elements of English/language arts education.",
        "prerequisites": "SEDED507"
    },
    {
        "course_code": "SED ED 476",
        "course_title": "Field Experience in English as Second Language",
        "description": "This course provides students interested in gaining experience in an English as a Second Language (ESL) classroom. Students will conduct observations and interviews, analyze lesson plans, examine professional teaching standards and ESL curriculum, and complete a classroom ethnography."
    },
    {
        "course_code": "SED ED 477",
        "course_title": "Field Experience in Mathematics Education",
        "description": "Undergraduate Prerequisites: SEDED350 Focuses on the experiences of mathematics teachers and students through a one-day per week placement in educational settings. Topics include an introduction of: best teaching practices, equity in math teaching and learning, and the role of curriculum.",
        "prerequisites": "SEDED350"
    },
    {
        "course_code": "SED ED 478",
        "course_title": "Field Experience in Science Education",
        "description": "Undergraduate Prerequisites: SED ED 350. Focuses on the experiences of science teachers and students through a one-day per week placement in schools and other educational settings. Topics include an introduction of: best teaching practices, equity in science teaching and learning, and the role of curriculum.",
        "prerequisites": "SED ED 350."
    },
    {
        "course_code": "SED ED 491",
        "course_title": "Capstone in Global Citizenship in Education",
        "description": "Students will design and enact a project that demonstrates the knowledge and skills they developed during their courses in the Global Citizenship and Education track. The project will be done in collaboration with a community partner."
    },
    {
        "course_code": "SED ED 492",
        "course_title": "Capstone in STEM Education",
        "description": "Undergraduate Prerequisites: SED ED 350. Undergraduate Corequisites: SED ED 477 or SED ED 478. This course requires students to complete a capstone project: identifying a topic related to the equitable teaching and learning of math/science, designing research-based lessons or other teaching-focused projects, and communicating with stakeholders about instructional recommendations.",
        "prerequisites": "SED ED 350."
    },
    {
        "course_code": "SED ED 507",
        "course_title": "Global Citizenship in Education",
        "description": "Students will explore global citizenship through a humanities lens. By engaging in a variety of immersive, collaborative, and multimodal projects, students will work towards developing attributes of a global citizen and understanding how educators help foster global citizenship."
    },
    {
        "course_code": "SED ED 530",
        "course_title": "Fieldwork in Education",
        "description": "Semester-long, 300-hour school-based experience for education majors as an alternative to student teaching. The purpose of this field experience is to provide students an opportunity to observe, participate, and reflect upon classroom organization, management, instruction, and interactions. Does not satisfy requirements for student teaching. Permission of Instructor. 150- 300 hours. Variable cr."
    },
    {
        "course_code": "SED ED 560",
        "course_title": "Dvl Inf/Tod Pgm",
        "description": null
    },
    {
        "course_code": "SED ED 640",
        "course_title": "Origins of Inequity",
        "description": "Explores and critiques, theoretically and practically, the history, politics, and policy implications of social and political inequity in North America and beyond. 4cr."
    },
    {
        "course_code": "SED ED 950",
        "course_title": "Continuing Study",
        "description": "For EdM, CAGS, and EdD candidates who have completed all coursework and who are preparing for comprehensive examinations or dissertation hearings, or are completing theses. 0 cr."
    },
    {
        "course_code": "SED EN 500",
        "course_title": "Lesson Design & Instruction Delivery in the Humanities",
        "description": "Introduces students to different models of lesson planning and unit planning as well as research-based strategies for effective instructional delivery in the secondary humanities classroom. Effective Fall 2020, this course fulfills a single unit in the following BU Hub area: Oral and/or Signed Communication. BU Hub Learn More Oral and/or Signed Communication",
        "BU_Hub": [
            "Oral and/or Signed Communication"
        ]
    },
    {
        "course_code": "SED EN 501",
        "course_title": "Teaching Classic and Contemporary Texts",
        "description": "Students will examine the demands of texts in the secondary classroom and components of successful reading. The course will analyze research-based practices in reading instruction in the middle and secondary English Language Arts classes. Methods for assessing and differentiating according to various dimensions will be introduced. 4 cr."
    },
    {
        "course_code": "SED EN 502",
        "course_title": "Student-Teaching Reflective Seminar",
        "description": "EN 502 offers undergraduate English Education majors engaging in their student-teaching the opportunity to come together weekly with a faculty member to reflect upon successes, challenges, and questions raised by the internship. Students will engage in common readings and write short weekly reflections that synthesize assigned readings and the internship experience. 2 cr."
    },
    {
        "course_code": "SED EN 503",
        "course_title": "Lesson Design & Instruction Delivery in the Humanities",
        "description": "Introduces students to different models of lesson planning and unit planning as well as research-based strategies for effective instructional delivery in the secondary humanities classroom. Effective Fall 2019, this course fulfills a single unit in the following BU Hub area: Oral and/or Signed Communication. 2 cr. BU Hub Learn More Oral and/or Signed Communication",
        "BU_Hub": [
            "Oral and/or Signed Communication"
        ]
    },
    {
        "course_code": "SED EN 506",
        "course_title": "Curriculum Materials and Teaching Strategies in English",
        "description": "Considers research-based strategies for teaching short fiction, poetry, novels, drama, grammar, and vocabulary. The course also considers key aspects of the teaching and learning process such as lesson and unit planning, assessment, and the role of local, state and federal standards in the English/Language Arts classroom. 4 cr."
    },
    {
        "course_code": "SED EN 512",
        "course_title": "Methods of Teaching Writing in Secondary English Language Arts",
        "description": "Introduces aspiring middle and secondary English/Language Arts teachers to research-based practices for effective writing instruction. Topics include writing workshop, mentor texts, genre study, strategy instruction, process- based instruction and revision. Effective Spring 2020, this course fulfills a single unit in each of the following BU Hub areas: The Individual in Community, Creativity/Innovation. 4 cr. BU Hub Learn More The Individual in CommunityCreativity/Innovation",
        "BU_Hub": [
            "The Individual in Community",
            "Creativity/Innovation"
        ]
    },
    {
        "course_code": "SED EN 520",
        "course_title": "Pre-Practicum in English Education",
        "description": "This course supports students in their English education teaching pre- practicum. Students complete teaching observations, reflect on field experiences, evaluate teaching practice against professional teaching standards, and develop and implement micro-teaching lessons. 2 cr."
    },
    {
        "course_code": "SED EN 538",
        "course_title": "Teaching in American Literature",
        "description": "This course focuses on teaching American literature at the high school level. Goals include building a knowledge base in American literary history, modeling deep learning with selected texts, addressing theoretical questions in English Language Arts pedagogy, and learning practical classroom skills. 4 cr. 1st sem. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: The Individual in Community, Teamwork/Collaboration. BU Hub Learn More The Individual in CommunityTeamwork/Collaboration",
        "BU_Hub": [
            "The Individual in Community",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED EN 630",
        "course_title": "Educating for Equity and Literacy in the Humanities",
        "description": "This course examines the teaching and learning of humanities in urban schooling. Considers how issues of race, gender, class, language, and culture affect the nature of literacy learning in schools. Includes field experience working with adolescent students. 2 cr."
    },
    {
        "course_code": "SED EN 701",
        "course_title": "Teaching Classic and Contemporary Texts",
        "description": "Graduate Prerequisites: Open only to matriculated students who have completed prerequisites. Students examine the demands of texts in the secondary classroom and components of successful reading. The course will analyze research-based practices in reading instruction in the middle and secondary English Language Arts classes. Methods for assessing and differentiating according to various dimensions will be introduced. 4 cr.",
        "prerequisites": "Open only to matriculated students who have completed prerequisites."
    },
    {
        "course_code": "SED EN 712",
        "course_title": "Methods of Teaching Writing in Secondary English Language Arts",
        "description": "The course introduces graduate aspiring middle and secondary English/Language Arts teachers to research-based practices for effective writing instruction and contains opportunities for application in a field experience. Topics include writing workshops, mentor texts, genre study, strategy instruction, process-based instruction, and revision. Effective Spring 2020, this course fulfills a single unit in each of the following BU 4 cr. BU Hub Learn More The Individual in CommunityCreativity/Innovation",
        "BU_Hub": [
            "The Individual in Community",
            "Creativity/Innovation"
        ]
    },
    {
        "course_code": "SED HD 121",
        "course_title": "Launching Your Personal Brand",
        "description": "This course focuses on building strategies for communicating your brand, expanding your social capital, and designing a career management plan. Students will learn how to use a range of digital media strategies to establish your professional image. Effective Spring 2023 this course fulfills a single unit in the following BU Hub area: Digital/Multimedia Expression. BU Hub Learn More Digital/Multimedia Expression",
        "BU_Hub": [
            "Digital/Multimedia Expression"
        ]
    },
    {
        "course_code": "SED HD 211",
        "course_title": "Student Motivation",
        "description": "Examines theory and research on ways in which family members, teachers, culture, and society interact to influence the development of attitudes, beliefs, and approaches towards learning and academic achievement in children and youth. Effective Spring 2021, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry I, Research and Information Literacy. BU Hub Learn More Social Inquiry IResearch and Information Literacy",
        "BU_Hub": [
            "Social Inquiry I",
            "Research and Information Literacy"
        ]
    },
    {
        "course_code": "SED HD 224",
        "course_title": "Emotional Development",
        "description": "Provides an overview of emotional development throughout the life span. Explores implications of theory and research for curriculum development, social programs, and policy."
    },
    {
        "course_code": "SED HD 265",
        "course_title": "Social Science Research for Community Impact",
        "description": "Students will collaborate with community organizations to design and conduct small-scale research projects (e.g., economic and educational equity, environmental justice, youth justice and mental health disparities). Research methodologies, qualitative and quantitative, will be determined based on the project. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, Social Inquiry II, Teamwork/Collaboration. BU Hub Learn More Oral and/or Signed CommunicationSocial Inquiry IITeamwork/Collaboration",
        "BU_Hub": [
            "Oral and/or Signed Communication",
            "Social Inquiry II",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED HD 300",
        "course_title": "Educational Psychology",
        "description": "This course is designed to apply psychological theory and research to educational practice. Students will examine how children think and learn, what motivates students and how teachers assess children's learning and progress in school. In addition, students will be encouraged to consider how teachers create learning environments to increase classroom engagement. Through this course, students will explore major theories of child development (cognitive, behavioral, social learning, etc.) and how they relate to education. Topics will include learning, motivation, instructional strategies, personality, and social development, cognitive processes and memory, and students' achievement and abilities. Effective Fall 2020, this course fulfills a single unit in the following BU Hub area: Social Inquiry I. BU Hub Learn More Social Inquiry I",
        "BU_Hub": [
            "Social Inquiry I"
        ]
    },
    {
        "course_code": "SED HD 306",
        "course_title": "Introduction to Human Development",
        "description": "Studies major developmental shifts from conception through the end of late adulthood across social, emotional, biological, and cognitive domains. Emphasis on competing theoretical perspectives, the role of socio-cultural contexts, and cultural diversity. Connections between theory, research, and practice. (Formerly CE306). Effective Fall 2022, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry I, Research and Information Literacy. BU Hub Learn More Social Inquiry IResearch and Information Literacy",
        "BU_Hub": [
            "Social Inquiry I",
            "Research and Information Literacy"
        ]
    },
    {
        "course_code": "SED HD 316",
        "course_title": "Children's Political Lives",
        "description": "Course will reconstruct the development of children's and adolescents' political understanding; explore how political attitudes are shaped by race, class, nationality, the political system and historical circumstance (e.g. war, immigration, climate change); develop strategies for youth's political education and empowerment."
    },
    {
        "course_code": "SED HD 327",
        "course_title": "Asian American Psychology",
        "description": "This course examines the psychological experiences of Asian Americans, including historical, sociopolitical, and cultural influences that shape lived experiences and mental health. Students will critically explore concepts such as culture, ethnicity, race, as they pertain to diverse Asian Americans. They will self-reflect and gain knowledge about cultural competence and advocacy in working with diverse Asian American individuals and communities. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: The Individual in Community, Social Inquiry I. BU Hub Learn More Social Inquiry IThe Individual in Community",
        "BU_Hub": [
            "Social Inquiry I",
            "The Individual in Community"
        ]
    },
    {
        "course_code": "SED HD 330",
        "course_title": "Psychology of Race",
        "description": "Interdisciplinary investigation of the historical, ideological, structural, and individual manifestations of race and racism in society. The course will also examine how the intersection of race with factors such as social class, gender, ethnicity, and identity shape the human experience. 4 cr. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: The Individual in Community, Social Inquiry I. BU Hub Learn More Social Inquiry IThe Individual in Community",
        "BU_Hub": [
            "Social Inquiry I",
            "The Individual in Community"
        ]
    },
    {
        "course_code": "SED HD 331",
        "course_title": "African American School Achievement",
        "description": "How do schools shape the lives of African Americans? Who are the teachers that best educate African American students? How do African American parents shape learning? What are the characteristics of a \"good\" school for African Americans? In this course, students will address these questions and more. Drawing from the disciplines of psychology and education, students will examine historical and contemporary factors that shape school achievement for African Americans. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Ethical Reasoning, The Individual in Community, Teamwork/Collaboration. BU Hub Learn More The Individual in CommunityEthical ReasoningTeamwork/Collaboration",
        "BU_Hub": [
            "The Individual in Community",
            "Ethical Reasoning",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED HD 354",
        "course_title": "Challenging Educational Inequity",
        "description": "Explores roles that institutional racism, school funding, and socioeconomic factors play in contributing to inequality of educational opportunity. Interrogates the influence of cultural beliefs and educational socialization practices mitigating the negative impact of inequality. Examines cutting-edge solutions to equalize opportunities for all students. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry I, Research and Information Literacy. BU Hub Learn More Social Inquiry IResearch and Information Literacy",
        "BU_Hub": [
            "Social Inquiry I",
            "Research and Information Literacy"
        ]
    },
    {
        "course_code": "SED HD 384",
        "course_title": "Restorative Justice in Youth-Serving Settings",
        "description": "Explores ethics, principles and practices of restorative and healing justice by drawing from various current and historical cultural understandings of justice practices across the globe, including First Nations and US criminal justice system. Special focus on applications in youth-serving settings. Effective Spring 2023, this course fulfills a single unit in each of the following BU Hub areas: Global Citizenship and Intercultural Literacy. BU Hub Learn More Global Citizenship and Intercultural Literacy",
        "BU_Hub": [
            "Global Citizenship and Intercultural Literacy"
        ]
    },
    {
        "course_code": "SED HD 385",
        "course_title": "Psychological Trauma",
        "description": "Introduces students to the concept of trauma and psychological consequences associated with exposure to potentially traumatizing events; explores risk and protective factors, inter-generational transmission, treatment of trauma, and post-traumatic growth. Special attention paid to sociological factors associated with post-traumatic adjustment and resilience. 4 cr. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry I, Teamwork/Collaboration. BU Hub Learn More Social Inquiry ITeamwork/Collaboration",
        "BU_Hub": [
            "Social Inquiry I",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED HD 400",
        "course_title": "Internship in Applied Human Development",
        "description": "Opportunity to complete a semester-long, 75-hour internship at a non-profit organization in the Greater Boston community. Bi-weekly seminars to process the experience with peers and to explore career choices with mentors."
    },
    {
        "course_code": "SED HD 410",
        "course_title": "200-Hour Practicum",
        "description": "Undergraduate Prerequisites: SED CE 500 or SED CF 510 or SED CL 210. This course offers 200 hours of professional experience in child and adolescent mental health, opportunities to apply theory and research in human development and clinical psychology in community settings, and to acquire skills relevant for social service careers.",
        "prerequisites": "SED CE 500 or SED CF 510 or SED CL 210."
    },
    {
        "course_code": "SED HD 415",
        "course_title": "Practicum/Capstone Seminar",
        "description": "This course provides opportunities for reflection, self-assessment and program evaluation. Students will produce an e-portfolio documenting the knowledge and practical skills they have gained in the course of completing the specialization in child and adolescent mental health."
    },
    {
        "course_code": "SED HD 500",
        "course_title": "Directed Study",
        "description": "By arrangement; no description."
    },
    {
        "course_code": "SED HD 510",
        "course_title": "Positive Youth Development",
        "description": "This course will introduce students to the historical and contemporary understandings of Positive Youth Development. Students will explore adolescent development and identify developmental milestones, local context, and potential exposure to adversity that may be present during the period of adolescence, as well as the way(s) Positive Youth Development can help foster healthy adolescent development. Various models of Positive Youth Development will be examined in the context of various youth-serving settings, including schools, sports, communities, and after-school programs."
    },
    {
        "course_code": "SED HD 511",
        "course_title": "Social and Policy Perspective in Positive Youth Development",
        "description": "This course explores the broader systemic and policy issues of positive youth development. Understanding of development within diverse cultural contexts and the integration of this knowledge by youth serving systems are critical perspectives in this course."
    },
    {
        "course_code": "SED HD 512",
        "course_title": "Transformational Leadership in Positive Youth Development",
        "description": "Transformational leadership is a model of leadership that emphasizes change, growth, and teamwork. In the often underfunded and overworked fields of Positive Youth Development, transformational leadership is a highly desirable trait in employees and managers. This course will explore the characteristics of transformational leadership and transformational leaders relative to Positive Youth Development settings through readings and case studies."
    },
    {
        "course_code": "SED HD 513",
        "course_title": "Language Development and Culture in PYD",
        "description": "Examines the relationships between language and social identities like culture, class, race, ethnicity, and gender. Explores implications for cross-cultural communication in diverse settings. Considers issues of linguistic diversity within their broad sociopolitical and philosophical contexts."
    },
    {
        "course_code": "SED HD 526",
        "course_title": "Meaning & Development of Play",
        "description": "Examines play from birth through adolescence, its role in social, emotional and cognitive development, its therapeutic and educational value, how the environment, including toys and media, shapes play, and how to promote quality play in diverse settings with diverse children. Graduate. 4 cr."
    },
    {
        "course_code": "SED HD 600",
        "course_title": "AHD Practicum",
        "description": "This seminar is designed to support the practicum experience of students in the semester in which they are completing a practicum working with students in a youth serving organization. The seminars include the presentation of content related to the practicum and discussions related to students' fieldwork placements."
    },
    {
        "course_code": "SED HD 610",
        "course_title": "The Psychology of Oppression and Liberation",
        "description": "Examines psychological effects of social oppression and liberation, and the psychological requirements that sustain these ideas. Explores dynamics of resistance, healing, and liberation. Interrogates systems of oppression regarding race, social class, gender, sexuality, and ability. Integrates intersectional and global perspectives."
    },
    {
        "course_code": "SED HE 221",
        "course_title": "Foundations of Health Education",
        "description": "Provides the foundation for improving health through modification of daily habits and lifestyle decisions. Analysis of nutrition, exercise, stress, substance abuse, and environmental health. 2 cr."
    },
    {
        "course_code": "SED HE 720",
        "course_title": "Selected Problems in Health Education",
        "description": "Health education with emphasis on nutrition, medical self-care, substance abuse, physical exercise, and leisure from Eastern and Western perspectives. Designed for graduate students in health professions, management, and education with interests in comprehensive health care and health promotion. 4 cr."
    },
    {
        "course_code": "SED HE 722",
        "course_title": "Curriculum Development for Health, Movement and Wellness",
        "description": "For individuals in a variety of settings involved in planning curricula related to health, movement and wellness. Explores influences on curriculum development and implementation in a variety of settings, including schools and communities, focusing on effective planning for behavior change in a variety of populations within schools and communities. 4 cr."
    },
    {
        "course_code": "SED LC 500",
        "course_title": "Directed Study",
        "description": "Open to undergraduate students only. Prereq: Signed plan of study must be submitted in advance of registration on a Directed study form obtained from the SED Office of Records. Var cr."
    },
    {
        "course_code": "SED LC 900",
        "course_title": "Independent Study",
        "description": "See SED AP 900 for description. Prereq: Approval of advisor. Signed plan of study must be submitted in advance of registration on an Independent study form obtained from the SED Office of Records. Var cr."
    },
    {
        "course_code": "SED LC 999",
        "course_title": "Dissertation Advisement",
        "description": "See SED AP 999 for description."
    },
    {
        "course_code": "SED LR 501",
        "course_title": "Teaching of Reading",
        "description": "Undergraduate Prerequisites: First-Year Writing Seminar (WR 120 or equivalent). For upper level undergraduate and beginning graduate students without experience in teaching. Study of literacy development in childhood-early adolescence and implications for teaching and learning. Includes integration of educational media/technology, discussion of theory/research, and applications to effective lesson planning. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Digital/Multimedia Expression, Writing- Intensive Course, Creativity/Innovation. 4 cr. Either sem. BU Hub Learn More Digital/Multimedia ExpressionCreativity/InnovationWriting-Intensive Course",
        "prerequisites": "First-Year Writing Seminar (WR 120 or equivalent).",
        "BU_Hub": [
            "Digital/Multimedia Expression",
            "Creativity/Innovation",
            "Writing-Intensive Course"
        ]
    },
    {
        "course_code": "SED LR 503",
        "course_title": "Reading and Writing Assessment",
        "description": "For undergraduate students in Special Education and Elementary Education. Introduction of informal and formal assessment of reading and writing knowledge and strategies among students in general education classrooms. Includes analysis of prototypic case studies. Provides a foundation for a two-credit module (SED SE 515) that addresses the particular needs of special populations. 2 cr."
    },
    {
        "course_code": "SED LR 551",
        "course_title": "Introduction to Reading Development, Assessment, and Instruction",
        "description": "For beginning graduate students without experience in the teaching of reading. Study of reading development in childhood and early adolescence, and the implications for teaching and learning. Discussion of theory and research on effective instruction and assessment, and the application of both to teaching. Not open to students who have completed SED LR 501 and/or LR 503. 4 cr."
    },
    {
        "course_code": "SED LR 732",
        "course_title": "Teaching Reading in the Middle and Secondary Schools",
        "description": "For upper-level undergraduate and graduate students. Study of the development of reading abilities in the middle and secondary years, and discussion of the implications for teaching and learning in the content area. 2 cr."
    },
    {
        "course_code": "SED LR 780",
        "course_title": "Process of Reading",
        "description": "Investigation of the theory and research related to reading. Exploration of implications for assessment, instructional design, and educational planning. Considers impact of new literacies on reading development. 4 cr. 1st sem."
    },
    {
        "course_code": "SED LS 521",
        "course_title": "Sociolinguistics",
        "description": "Introduction to language in its social context. Methodological and theoretical approaches to sociolinguistics. Linguistic variation in relation to situation, gender, socioeconomic class, linguistic context, and ethnicity. Integrating micro- and macro-analysis from conversation to societal language planning. 4cr."
    },
    {
        "course_code": "SED LS 560",
        "course_title": "Introduction to Language and Language Acquisition",
        "description": "Undergraduate Prerequisites: Restricted to Juniors, Seniors, and Graduate Students Introduction to the main aspects of first language acquisition from infancy through childhood. Topics areas include phonology, morphology, syntax, semantics, discourse-pragmatics, language variation, multilingualism, child- directed speech, cognitive development, and theories of language acquisition. 4 cr. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Scientific Inquiry I, Social Inquiry I, Critical Thinking. BU Hub Learn More Scientific Inquiry ISocial Inquiry ICritical Thinking",
        "prerequisites": "Restricted to Juniors, Seniors, and Graduate Students",
        "BU_Hub": [
            "Scientific Inquiry I",
            "Social Inquiry I",
            "Critical Thinking"
        ]
    },
    {
        "course_code": "SED LS 567",
        "course_title": "Structure of English",
        "description": "Linguistic analysis of English grammatical structures and pedagogical application of linguistic concepts in preparation for teaching English as a second or foreign language. Coursework extends implicit linguistic knowledge of English to explicit metalinguistic knowledge necessary for grammar sequencing and instruction. 4 cr."
    },
    {
        "course_code": "SED LS 595",
        "course_title": "Child Second Language Acquisitions",
        "description": "An introduction to contemporary linguistics, including phonological, morphological, and syntactic theory, sociolinguistics, first- and second-language acquisition, and discourse theory. Also covers applications of various branches of linguistics to education, including issues of different cultures in the classroom and the role of language in education. 4 cr."
    },
    {
        "course_code": "SED LS 627",
        "course_title": "Critical Analysis of Children's and Young Adult Literature",
        "description": "Overview of children's and young adult literature, including introduction to authors, illustrators, and literary genres, and exploration and discussion of distinctive portrayals (e.g., genders, cultures, ethnicities, religions). The course is intended to develop overall knowledge of texts, awareness and understanding of critical issues that surround children's and young adult literature, and an understanding of how to evaluate and select texts for use in and out of school settings. This course requires substantial reading of selected children's and young adult literature. 4 cr."
    },
    {
        "course_code": "SED LS 628",
        "course_title": "Exploring Picture Books for All Readers",
        "description": "An overview of up-to-date picture books that communicate complex narrative and non-narrative themes and ideas. In-depth exploration across multiple genres, styles, and authors will allow development of an awareness of the diversity of texts, visual literacy and critical reading skills. Includes modeling of research- based pedagogies to support student literacy development. 4 cr."
    },
    {
        "course_code": "SED LS 632",
        "course_title": "Graphic Novels",
        "description": "Intended for graduate students and inservice teachers. Focuses on critical review of a wide variety of graphic novels appropriate for use with students across a range of grade levels, reading abilities, and content areas. As the basis for critical review, participants read and discuss theory and research related to visual literacy, illustration and design, and literary criticism. Examines approaches to classroom discussion, including a focus on challenging topics, that will support their own students' development as active, engaged, and critical graphic novel readers. 4 cr."
    },
    {
        "course_code": "SED LS 640",
        "course_title": "Critical Applied Linguistics",
        "description": "Critical applied linguistics is the study of language and power in the social world. The objective of this course is to investigate how inequitable systems of power shape language education, while also considering the radical solutions that have been proposed."
    },
    {
        "course_code": "SED LS 658",
        "course_title": "Second Language Acquisition",
        "description": "This course will provide an examination of approaches and major theories of second language acquisition (SLA). What can be observed about how people acquire a second language? How do the various SLA theories, models, and hypotheses explain each of these observations? How can an understanding of SLA theory inform language instruction? We will explore foundational theories and approaches in SLA, investigate contemporary thinking from a variety of perspectives, and form knowledge and ideas of how languages are acquired, based on empirical research. 4 cr"
    },
    {
        "course_code": "SED LS 670",
        "course_title": "Multicultural Literature in the Pre-K-Grade 12 Classroom",
        "description": "An in-depth study of diverse children's and young adult literature in school and community settings. Focused on recognizing high-quality, authentic, linguistically and cognitively complex texts that represent historically under- or misrepresented individuals, groups and communities. Includes modeling of research-based pedagogies to support all students' motivation, engagement, comprehension and response of proficient and struggling readers. 4 cr."
    },
    {
        "course_code": "SED LS 690",
        "course_title": "Classroom Discourse",
        "description": "Focuses on discourse as a central component of teaching and learning, and strategies for building on students' linguistic and cultural backgrounds as learning assets. Examines instructional contexts, pedagogical approaches, and teacher talk moves to support instruction and students' conceptual understanding."
    },
    {
        "course_code": "SED LS 725",
        "course_title": "Discourse, Narrative, and Literacy",
        "description": "This course focuses on theoretical and empirical work from a variety of traditions that addresses relationships among discourse, narrative, literacy and power in teaching and learning. It includes analysis of video and transcripts of classroom and everyday life. 4cr."
    },
    {
        "course_code": "SED LS 727",
        "course_title": "Topical Seminar in Literacy and Language",
        "description": "Focuses on one aspect of research, theory, and practice in literacy and language. Offered by visiting professors or resident faculty. Topics may include critical review of research literature in literacy and review and/or application of theory/research in literacy and language for a specific population. Var cr."
    },
    {
        "course_code": "SED LS 750",
        "course_title": "Culture, Language, and Cognition",
        "description": "This course focuses on theoretical and empirical work investigating relationships among culture, language, and cognition in literacy development. It considers research in various traditions of inquiry, including cultural psychology, cognitive psychology, anthropology, sociocultural theory, activity theory, and learning sciences."
    },
    {
        "course_code": "SED LS 790",
        "course_title": "Literary Assessment to Inform Instruction",
        "description": "Explores the theoretical underpinnings of literacy assessments and ways to use formal and informal assessments to identify learner's strengths and needs. Emphasizes assessment practices that are grounded in teaching interventions that provide insight into instructional practices that support students. 4 cr. Either sem."
    },
    {
        "course_code": "SED LS 792",
        "course_title": "Teaching Adolescent Readers and Writers",
        "description": "Explores current theory and research regarding reading and writing processes and practices among adolescents in and beyond school. Emphasizes the integration of literacy instruction across disciplines and the relevance of adolescents' multiple literacies to classroom instruction. 4 cr."
    },
    {
        "course_code": "SED LS 801",
        "course_title": "Design-Based Research as Educational Inquiry, Part I",
        "description": "This course is part of a two-semester sequence. Students will a) develop a critical understanding of different approaches to design-based research, including their political and ethical commitments, and b) collaboratively design and carry out a small-scale design study. 4 cr. 1st sem."
    },
    {
        "course_code": "SED LS 802",
        "course_title": "Design-Based Research as Educational Inquiry, Part II",
        "description": "This course is part of a two-semester sequence. Students will a) develop a critical understanding of different approaches to design-based research, including their political and ethical commitments, and b) collaboratively design and carry out a small-scale design study. 4 cr. 2nd sem."
    },
    {
        "course_code": "SED LW 736",
        "course_title": "Teaching Writing in Elementary, Middle, and Secondary Schools",
        "description": "Study of research and theory that informs an understanding of the writing process, the development of writing abilities, and writing instruction and assessment. Application of the literature to classroom practice at the elementary, middle and secondary school levels. 4 cr."
    },
    {
        "course_code": "SED LW 781",
        "course_title": "Processes of Writing",
        "description": "Study of the theory and research related to writing. Exploration of implications for theory, research, and practice. 4 cr."
    },
    {
        "course_code": "SED ME 200",
        "course_title": "Introduction to Mathematics Education",
        "description": "The course will provide students with an introduction to the field of K-12 mathematics education, focusing on current issues such as standards, curriculum, diversity, student achievement, parental involvement, instructional methods, and the nature of learning mathematics with understanding. Effective Fall 2018, this course fulfills a single unit in the following BU Hub area: The Individual in Community. BU Hub Learn More The Individual in Community",
        "BU_Hub": [
            "The Individual in Community"
        ]
    },
    {
        "course_code": "SED ME 201",
        "course_title": "Methods for Tutoring Math Students",
        "description": "This course examines the teaching and learning of humanities in urban schooling. Considers how issues of race, gender, class, language, and culture affect the nature of literacy learning in schools. Includes field experience working with adolescent students. 2 cr."
    },
    {
        "course_code": "SED ME 363",
        "course_title": "Problem Solving in Mathematics",
        "description": "Engages in collaborative problem solving and problem posing while exploring the role of productive struggle in the teaching and learning of mathematics. Effective Spring 2019, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, Quantitative Reasoning I, Critical Thinking. 4cr. Either sem. BU Hub Learn More Quantitative Reasoning IOral and/or Signed CommunicationCritical Thinking",
        "BU_Hub": [
            "Quantitative Reasoning I",
            "Oral and/or Signed Communication",
            "Critical Thinking"
        ]
    },
    {
        "course_code": "SED ME 501",
        "course_title": "Methods for Tutoring Math Students",
        "description": "Explores the mathematics tutoring profession and the methodologies that make for an effective grade 3-12 or undergraduate mathematics tutor. Students will gain field experience and have an option of becoming a Massachusetts Certified Tutor. 2cr."
    },
    {
        "course_code": "SED ME 506",
        "course_title": "Pre-Practicum in Mathematics Education",
        "description": "Undergraduate Prerequisites: SED ME 508. Graduate Prerequisites: Open only to matriculated graduate students who have completed prerequisites. Course consists of observation of a secondary teacher that includes questioning, data collecting, and debriefing. Students create and implement lessons in their placement focusing on co-teaching, small group, and whole class lessons. Students reflect on observations and lessons in seminar.",
        "prerequisites": "SED ME 508."
    },
    {
        "course_code": "SED ME 525",
        "course_title": "Assessment in Mathematics",
        "description": "Course introduces the theory and practice of assessment in mathematics and prepares teachers to apply research-supported assessment techniques in their classrooms. Students will also discuss equity-related issues of assessment practices, including biases, assumptions, and providing opportunities to demonstrate mathematical understanding. 2 cr. Either sem."
    },
    {
        "course_code": "SED ME 530",
        "course_title": "Equitable Pedagogies in STEM Education",
        "description": "Interrogates how race, class, language, and culture affect students' opportunities to learn mathematics and science. Different pedagogies (e.g. culturally responsive teaching, teaching for social justice) that target these opportunity gaps are introduced, discussed, and debated. 2 cr. Either sem."
    },
    {
        "course_code": "SED ME 544",
        "course_title": "Early Childhood Mathematics, Pre-K-Grade 2",
        "description": "Supports teachers seeking initial licensure to learn to cultivate equitable mathematics learning environments that enable children in grades PreK-2 to develop deep understanding of key mathematical ideas, fluency with mathematical procedures, and productive mathematics identities. 4cr. Either sem."
    },
    {
        "course_code": "SED ME 551",
        "course_title": "Mathematics for Special Needs Students",
        "description": "Examines programs for mathematics students with special needs in grades K-12, focusing on gifted students, students with learning disabilities, and their intersection. Topics include diagnostic techniques, alternative curricula, appropriate instructional strategies, and classroom organization techniques. 4cr."
    },
    {
        "course_code": "SED ME 563",
        "course_title": "Problem Solving in Mathematics",
        "description": "This course engages participants in collaborative problem solving and problem posing while exploring the role of productive struggle in the teaching and learning of mathematics. Effective Spring 2019, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, Quantitative Reasoning I, Critical Thinking. 4cr. Either sem. BU Hub Learn More Quantitative Reasoning IOral and/or Signed CommunicationCritical Thinking",
        "BU_Hub": [
            "Quantitative Reasoning I",
            "Oral and/or Signed Communication",
            "Critical Thinking"
        ]
    },
    {
        "course_code": "SED ME 568",
        "course_title": "The Design of Secondary Mathematics Curriculum",
        "description": "Considers how to design tasks that compel students to explore challenging mathematical ideas, make new connections, develop arguments and justifications, and spur curiosity and delight by examining the design principles of high-quality mathematics curriculum. 4 cr."
    },
    {
        "course_code": "SED ME 589",
        "course_title": "Designing Professional Development Programs in Mathematics Education",
        "description": "Graduate Prerequisites: SED ME 558; Matriculated Graduate Students who have completed SEDME558 Students examine models for the professional development of mathematics teachers; conduct needs assessment of the teachers in their target groups; and design professional development programs that respond to those needs. Programs focus on upgrading mathematical content knowledge and pedagogical and assessment practices. 4cr.",
        "prerequisites": "SED ME 558; Matriculated Graduate Students who have completed SEDME558"
    },
    {
        "course_code": "SED ME 701",
        "course_title": "Learning Theory and Epistemology in Mathematics Education",
        "description": "Graduate Prerequisites: Open only to matriculated students who have completed prerequisites. This seminar course for advanced graduate students explores the contemporary and historical research and theory with regard to the learning and knowing of mathematics. 4 cr.",
        "prerequisites": "Open only to matriculated students who have completed prerequisites."
    },
    {
        "course_code": "SED ME 702",
        "course_title": "Advanced Study of Mathematics Teaching and Teacher Education",
        "description": "This seminar course for advanced graduate students examines theoretical and empirical research in the areas of mathematics teaching and mathematics teacher education. 4cr."
    },
    {
        "course_code": "SED ME 703",
        "course_title": "Curriculum Research and Theory in Mathematics Education",
        "description": "This seminar course for advanced graduate students explores contemporary and historical research and theory in mathematics education with regard to curriculum, including its analysis, use, design, and effects. 4cr."
    },
    {
        "course_code": "SED ML 530",
        "course_title": "Supporting and Assessing Second Language Development",
        "description": "Examines the use of the WIDA and other assessments to plan ESL instruction for children at different proficiency levels. Develops skill at ESL instruction using sensory, graphic and interactive supports. Explores how to incorporate funds of knowledge and family support into the ESL curriculum. 3 cr."
    },
    {
        "course_code": "SED ML 535",
        "course_title": "First and Second Language Acquisition",
        "description": "Explores theories and research in first and second language acquisition in a variety of sociocultural contexts. Examines stages of second language acquisition with attention to contextual and individual factors affecting pace and outcomes. Considers developmental trajectories in phonology, grammar, lexicon and pragmatics, as well as in receptive and expressive language. 3 cr."
    },
    {
        "course_code": "SED PE 103",
        "course_title": "Introduction to Physical Activity and Movement",
        "description": "In this course, students will examine and analyze contemporary views and practices of health, wellness, and physical activity through review of: historical and philosophical perspectives; evolving issues and discussions in the health, wellness, and physical activity fields; review of sociocultural influences in professional practices and research paradigms; current recommendations for research-based health, wellness, and physical activity practices and/or behaviors. 2 cr."
    },
    {
        "course_code": "SED PE 250",
        "course_title": "Community Leadership through Youth Sport Coaching",
        "description": "This course will enable students to gain an understanding of the roles and responsibilities of the youth sport coach as well as to develop basic coaching skills through classroom study of coaching theory combined with practical involvement in a community sport organization. 2 cr."
    },
    {
        "course_code": "SED PE 375",
        "course_title": "Psychology of Sport",
        "description": "Introduction to the field of sport psychology. An overview of theory and practice related to contemporary issues in the field, including personality and performance, motivation, attention control, leadership styles, stress/arousal/anxiety, athletic counseling, performance enhancement techniques, and testing and performance motivation. 4 cr."
    },
    {
        "course_code": "SED PE 500",
        "course_title": "Universal Design for Working with Youth",
        "description": "Universal Design is a research-based instructional design framework that helps practitioners reduce barriers to comprehension and skill development by creating flexible and inclusive learning environments. In light of the diverse representations of cognitive and physical abilities found among students in youth development settings (such as physical or health education classrooms, sports teams, and after-school programs), the need for flexible means of content delivery, student assessment, student engagement, and environmental design is critical to a program's success. PE 500 will explore the roots of Universal Design, the Universal Design for Learning framework (as developed by the Center for Applied Special Technology), and ways Universal Design for Learning can be applied to a variety of youth development environments. 2 cr."
    },
    {
        "course_code": "SED PE 501",
        "course_title": "Methods of Coaching",
        "description": "Principles and problems in coaching various individual and team sports. Theory and techniques in coaching including offensive and defensive strategy and scouting. Women's and men's sports. 4 cr."
    },
    {
        "course_code": "SED PE 505",
        "course_title": "Motor Learning and Control",
        "description": "Overview of essential concepts in the sport sciences, including: exercise, physiology, sport biomechanics, principles of strength and endurance training, and sport nutrition. Open to advanced undergraduate students and graduate students interested in the sport sciences. 3 cr."
    },
    {
        "course_code": "SED PE 513",
        "course_title": "Practical Applications for PE and HE",
        "description": "Introduces future educators, coaches, and movement professionals to fundamental movement skills, principles of fitness education, sport rules and skills, and teaching methodologies related to movement education. In addition to scheduled course time, students will participate in a 40-hour pre-practicum experience during the semester. 4 cr."
    },
    {
        "course_code": "SED PE 515",
        "course_title": "Institute on Physical Fitness",
        "description": "Development and administration of programs that improve fitness levels. Weight regulation, physical activity, and nutrition and human movement efficiency. 4 cr, Summer Term."
    },
    {
        "course_code": "SED PE 519",
        "course_title": "Corrective and Adaptive Physical Education",
        "description": "Examines methods of adapting physical activities for special-needs students who may have physical, cognitive, social/emotional, learning, and/or sensory disabilities. Through field experiences, students observe exemplary adaptive physical education environments that accord with the Massachusetts Curriculum Frameworks. 2 cr, alternate years."
    },
    {
        "course_code": "SED PE 525",
        "course_title": "PE Safety, Law, and Risk Management",
        "description": "This blended course (online- and classroom-based) introduces physical education licensure students to topics of constitutional law, tort law, risk management, and safety as they apply to sport, physical activity, and education. This class fulfills Massachusetts Physical Education Subject Matter Knowledge standard domain V."
    },
    {
        "course_code": "SED PE 529",
        "course_title": "The Psychology of Coaching Teams",
        "description": "Graduate Prerequisites: SED PE375 or Consent of Instructor This course aims to give students a better understanding of the complex web of psychological factors that coaches contend with when trying to create a successful team. Central topics include leadership, group cohesion, collective-efficacy, systems theory, group psychodynamics and team dynamics. Students study different theories that might explain group and team behavior. As part of their learning students are required to participate in a group project to experience a team dynamic firsthand. The course also focuses on understanding how great coaches accomplish their success. An important aspect of the course is for students to consider the ethical and moral dimensions of coaching in different contexts. In this discussion we examine the central topics of sportsmanship and character development. Graduate Prereq: SED PE 375 or Consent of Instructor. 4 cr.",
        "prerequisites": "SED PE375 or Consent of Instructor"
    },
    {
        "course_code": "SED PE 705",
        "course_title": "Analysis of Teaching Movement",
        "description": "Teaching human movement activities in the context of innovative techniques, current humanizing influences, shared decision-making principles, and psychosocial influences in general motor learning. Converts basic physical educational theories and current research into classroom, gymnasium, and playing field practices. 4 cr."
    },
    {
        "course_code": "SED PE 710",
        "course_title": "Sport Theory and Social Systems",
        "description": "Relationship of sport and cultural dynamics, sociogenic factors underlying competitive physical activity, and the behavioral responses of sport participants to various socio cultural sociocultural motivations. Role of sport in past and current societies. 4 cr."
    },
    {
        "course_code": "SED RE 501",
        "course_title": "Teaching of Reading",
        "description": "Undergraduate Prerequisites: Taken concurrently with CH 300 For advanced undergraduate and graduate students without previous experience in the teaching role. Analysis of literacy development and instruction. Instructional strategies for reading and authentic assessment. Taken concurrently with SED CH 300.",
        "prerequisites": "Taken concurrently with CH 300"
    },
    {
        "course_code": "SED RE 723",
        "course_title": "Practitioner as Researcher",
        "description": "Involves designing and implementing a research project that answers questions about site-based practice. Published practitioner research is reviewed. Examines research as a collaborative process that supports constituent, researcher, institutional, and societal development. Fulfills core requirement in research. 3 cr."
    },
    {
        "course_code": "SED RE 736",
        "course_title": "Developmental Reading Strategies II",
        "description": "Undergraduate Prerequisites: Students must obtain consent of instructor. Analytic comparison of current practices; emphasis on developmental reading programs. Examines the nature of the reading process, evaluational materials, vocabulary building, study skills, pupil interest, and independent reading. Students must obtain consent of instructor.",
        "prerequisites": "Students must obtain consent of instructor."
    },
    {
        "course_code": "SED RS 600",
        "course_title": "Introduction to Research",
        "description": "Designed to introduce students to social science research methods including quantitative, qualitative, and mixed method approaches to education inquiry. Students will develop skills in conducting literature searches, reading empirical research studies and applying these methods. Students leave the course better able to critically examine research presented in the mass media, critically engage with research in the workplace, and participate in research- based efforts to improve education. 4 cr."
    },
    {
        "course_code": "SED RS 615",
        "course_title": "Rsrch As Evidnc",
        "description": null
    },
    {
        "course_code": "SED RS 620",
        "course_title": "Action Research and Practitioner Inquiry",
        "description": "Overview of the foundations and techniques for conducting action research. Encourages the development of an inquiry stance within the practice of teachers, principals, and other school-based practitioners. Students engage in planning, collecting, and analyzing data through an action research project. 4 cr."
    },
    {
        "course_code": "SED RS 652",
        "course_title": "Qualitative Research Methods",
        "description": "The philosophical and theoretical underpinnings and the techniques for conducting qualitative research. Students are introduced to different kinds of qualitative research, consideration of ethical issues, and criteria for rigorous qualitative research studies. Students critique published research and engage in planning a study, collecting and analyzing data, and writing up a report. 4 cr."
    },
    {
        "course_code": "SED RS 653",
        "course_title": "Quantitative Research Methods",
        "description": "Conceptualization of quantitative research problems. Study descriptive and inferential statistics most commonly used for analyzing data in educational research including t-tests, ANOVAs, multiple comparisons, correlation, regression, and chi square. Emphasis placed on interpretation. Research project requires identifying a problem, gathering and analyzing data, and writing the results in APA format. 4 cr."
    },
    {
        "course_code": "SED RS 654",
        "course_title": "Educational Inquiry and Proposal Writing",
        "description": "Overview of foundational questions related to what is important and knowable about educational matters (including issues of objectivity and subjectivity) and how different empirical methods of inquiry respond to such questions. Topics include: standards of believability, persuasiveness, and utility in different kinds of inquiry and the relationships among theoretical, quantitative and qualitative methods in the cycle of scientific discovery. Emphasis is on formulating significant research questions, clarifying important concepts for research, and preparing sound research proposals. Open only to matriculated doctoral students who have completed the prerequisites. 4 cr."
    },
    {
        "course_code": "SED RS 655",
        "course_title": "Mixed Methods Research",
        "description": "This course is an advanced research seminar that provides hands-on training in the use of integrated quantitative and qualitative methods in a single study. Students will gain competency in design, rationale, data collection, analysis, integration of results, and dissemination strategies."
    },
    {
        "course_code": "SED RS 699",
        "course_title": "Research Apprenticeship",
        "description": "Collaboration with a faculty member on funded or unfunded research. Particular focus will depend on the stage of design or implementation of the particular study, and may include formulation and refinement or research questions, design of the methodological plan, data collection, analysis, interpretation, and report of findings. Var cr."
    },
    {
        "course_code": "SED RS 750",
        "course_title": "Advanced Research Seminar",
        "description": "Graduate Prerequisites: Three graduate-level research courses including RS654 and consent of instructor. Provides direction on substantive and procedural issues in the design and conduct of research. Requires students to present drafts of their dissertation proposals for critique in seminar format and to contribute to the constructive criticism of proposals presented by fellow classmates. Graduate Prereq: For doctoral students who have already clarified their research interests and are ready to work on their dissertation proposals. Three graduate-level research courses and consent of instructor. 4 cr.",
        "prerequisites": "Three graduate-level research courses including RS654 and consent of instructor."
    },
    {
        "course_code": "SED RS 751",
        "course_title": "Program Evaluation",
        "description": "Graduate Prerequisites: two graduate-level research courses and consent of instructor. Alternative approaches to evaluation; consideration of stakeholders; specification of multiple outcomes; program monitoring; formative and summative designs; practical guidelines for planning, conducting, reporting, and using evaluations; role of the evaluator; necessary skills; political, ethical, and interpersonal aspects. Applicable to curricular interventions, training programs, social action projects, social policies. Case studies and student proposals are critiqued in seminar. Prereq: Two graduate-level research courses and consent of instructor. Requires some pilot testing. 4 cr.",
        "prerequisites": "two graduate-level research courses and consent of instructor."
    },
    {
        "course_code": "SED RS 752",
        "course_title": "Seminar in Qualitative Research",
        "description": "Undergraduate Prerequisites: RS 652 Introduction to Qualitative Research Methods or equivalent This is an advanced qualitative research course designed for doctoral students who have data ready to analyze. Students engage in data analysis, writing, and peer review throughout the course, with a goal of each student completing a full research paper draft by the end of the semester. Prerequisite: SED RS 652 or a similar introduction to qualitative research course at the graduate level. 4 cr.",
        "prerequisites": "RS 652 Introduction to Qualitative Research Methods or equivalent"
    },
    {
        "course_code": "SED RS 753",
        "course_title": "Causal Design in Education Research",
        "description": "This course will introduce students to research designs commonly used in education research that plausibly allow for causal claims. Topics include randomized field trials, regression discontinuity, differences-in- differences, and instrumental variables."
    },
    {
        "course_code": "SED RS 755",
        "course_title": "Psychometrics",
        "description": "Provides instruction in psychometric and statistical methods of measurement. Introduces two psychometric methods -- Classical Test Theory and Item Response Theory (IRT) -- and will cover a range of measurement issues, such as reliability, validity, bias, and standard-setting."
    },
    {
        "course_code": "SED RS 900",
        "course_title": "Ind Study",
        "description": "Prereq: Approval of advisor. Signed plan of study must be submitted in advance of registration on an Independent study form obtained from the SED Office of Records. Variable cr."
    },
    {
        "course_code": "SED SC 521",
        "course_title": "Introduction to STEM Education Theory and Practice",
        "description": "This course provides an introduction to modern learning theory emphasizing inquiry learning in the classroom for science, engineering and mathematics. 2 cr. Effective Fall 2019, this course fulfills a single unit in the following BU Hub area: The Individual in Community. BU Hub Learn More The Individual in Community",
        "BU_Hub": [
            "The Individual in Community"
        ]
    },
    {
        "course_code": "SED SC 539",
        "course_title": "Introduction to the History and Philosophy of Science for Science Educators",
        "description": "This course provides a basic overview of the history, philosophy, and sociology of science (HPSS, sometimes called \"science studies\") especially as these subjects relate to science teaching and learning. 4 cr."
    },
    {
        "course_code": "SED SC 570",
        "course_title": "Science Teaching Methods I",
        "description": "Emphasizes pedagogical content knowledge through the exploration of methods for teaching science within disciplines (biology, chemistry, general science, and physics) at the middle and high school levels. 4 cr. Either sem."
    },
    {
        "course_code": "SED SC 575",
        "course_title": "Foundations of Science Education",
        "description": "Provides an introduction to modern learning theory emphasizing inquiry learning in the classroom for science and engineering. The four-credit option includes a pre-practicum for pre-service teachers. Var cr."
    },
    {
        "course_code": "SED SC 576",
        "course_title": "Science Teaching Pre-Practicum",
        "description": "Pre-service teachers participate in a semi-weekly pre-practicum experience in local schools and a biweekly seminar where they will have the opportunity to study and practice science teaching methods with an emphasis on equity and diversity in science education. Methods. 2 cr. 1st sem."
    },
    {
        "course_code": "SED SC 645",
        "course_title": "Institutional Racism in Health and Science",
        "description": "This course traces the historical roots of racism in science through to its modern manifestations, examines the harmful consequences on victims' health outcomes, and presents ideas, approaches, and practices to ameliorate and eradicate the presence of racism in our institutions."
    },
    {
        "course_code": "SED SE 250",
        "course_title": "Disability, Education, and Public Policy",
        "description": "Students will examine how disabilities impact students, their families, and their educational/community participation; analyze the historical treatment of individuals with disabilities; discuss contemporary ethical issues; learn federal legislation; and develop a foundational understanding of inclusive educational practices. Effective Fall 2019, this course fulfills a single unit in the following BU Hub areas: The Individual in Community, Ethical Reasoning. BU Hub Learn More The Individual in CommunityEthical Reasoning",
        "BU_Hub": [
            "The Individual in Community",
            "Ethical Reasoning"
        ]
    },
    {
        "course_code": "SED SE 251",
        "course_title": "Special Education and Adolescents",
        "description": "Undergraduate Prerequisites: SED ED100 Students will analyze the impact of disabilities on adolescents, their families, and educational/community participation; learn federal legislation; and, explore behavior support/instructional strategies to ensure that future secondary education teachers will work effectively with all individuals within a diverse student body. Effective Fall 2019, this course fulfills a single unit in the following BU Hub area: The Individual in Community. BU Hub Learn More The Individual in Community",
        "prerequisites": "SED ED100",
        "BU_Hub": [
            "The Individual in Community"
        ]
    },
    {
        "course_code": "SED SE 480",
        "course_title": "Teaching Students with Special Needs",
        "description": "Undergraduate Prerequisites: SED LR 501. Students will acquire the necessary knowledge and skills to design, implement, and evaluate individualized educational programs for students with moderate disabilities PreK-8. Emphasis on explicit instruction framework, evidence-based practice for teaching core academic skills, and data-driven decision-making. Prereq: LR 501. 4 cr.",
        "prerequisites": "SED LR 501."
    },
    {
        "course_code": "SED SE 493",
        "course_title": "Practicum in Disabilities Studies",
        "description": "Through fieldwork experience and accompanying seminar, students develop an understanding of human services agencies for individuals with disabilities, educational service delivery models, policies, roles and responsibilities, and collaboration. Var cr."
    },
    {
        "course_code": "SED SE 500",
        "course_title": "Directed Study",
        "description": "For description, see SED AP 500. Prereq: Approval of advisor. Complete the online Directed study form. Wheelock Office of Records. Var cr."
    },
    {
        "course_code": "SED SE 504",
        "course_title": "An Introduction to Early Childhood Disabilities",
        "description": "Students acquire and demonstrate their knowledge of the etiology, history, service delivery models, and issues and trends related to young children with disabilities. Prereq: SE 250, SE 706, or permission. 2 cr."
    },
    {
        "course_code": "SED SE 505",
        "course_title": "An Introduction to Severe Disabilities",
        "description": "Student acquire and demonstrate their understanding of the etiology of various severe disabilities, historical background, current service delivery models, and issues and trends in the education of individuals with severe disabilities. Prereq: SE 504 or permission. 2 cr."
    },
    {
        "course_code": "SED SE 533",
        "course_title": "The Families of Children with Disabilities",
        "description": "Examines the nature of families and how families evolve with the presence of a child with a disability. Students will develop an understanding of family systems theory and evidence-based approaches to collaborating with families of children with disabilities. 4 cr."
    },
    {
        "course_code": "SED SE 534",
        "course_title": "Classroom and Behavior Management",
        "description": "Designed to develop an understanding of strategies for effective?behavioral support?of students with/without disabilities. Positive Behavioral Intervention and Supports (PBIS) will be used as the framework for school- wide, classroom, and individualized approaches to provide positive and preventative supports. Prereq: SE 250 or SE 706. 2cr."
    },
    {
        "course_code": "SED SE 535",
        "course_title": "Understanding Autism",
        "description": "Students will describe the defining characteristics, school experiences, and evidence- based practices for teaching and supporting individuals with autism spectrum disorder (ASD). The course includes perspectives from individuals with ASD and their families. 2 cr."
    },
    {
        "course_code": "SED SE 536",
        "course_title": "Assessment and Instruction of Students with Autism Spectrum Disorder",
        "description": "Undergraduate Prerequisites: SED SE 535 Students will develop knowledge and skills in assessment and instruction of students with autism spectrum disorder (ASD). Assessment practices including screening, diagnosis, and school-based progress monitoring of students with ASD. Instructional practices emphasize research-based interventions and participation in general education. Prereq: SE 535. 4 cr.",
        "prerequisites": "SED SE 535"
    },
    {
        "course_code": "SED SE 537",
        "course_title": "Assistive Technology",
        "description": "Learners will examine legislation related to assistive technology; develop knowledge of AT for reading, writing, computer access, communication, daily living skills, and environmental control that address needs of students with various forms of disabilities; apply a systematic, collaborative framework to guide the AT selection process."
    },
    {
        "course_code": "SED SE 596",
        "course_title": "Practicum with Students with Autism Spectrum Disorder",
        "description": "Undergraduate Prerequisites: SED SE 535 Students will demonstrate skills in planning, implementing, and evaluating instruction for students with autism spectrum disorders. Student teaching experience (150 hour minimum) and accompanying seminar. Only open to matriculated students who have completed prerequisites. 4 cr.",
        "prerequisites": "SED SE 535"
    },
    {
        "course_code": "SED SE 597",
        "course_title": "Practicum for Teaching Professionals-Moderate Prek - 8",
        "description": "Students will demonstrate skills in planning, implementing, and evaluating instruction for students with moderate disabilities, grades PreK-8. Designed for practitioners. Student teaching experience (300-hour minimum) and accompanying seminar. Only open to matriculated students who have completed prerequisites. 4 cr."
    },
    {
        "course_code": "SED SE 598",
        "course_title": "Practicum for Teaching Professionals-Moderate 5-12",
        "description": "Students will demonstrate skills in planning, implementing, and evaluating instruction for students with moderate disabilities, grades 5-12. Designed for practitioners. Student teaching experience (300-hour minimum) and accompanying seminar. Only open to matriculated students who have completed prerequisites. 4 cr."
    },
    {
        "course_code": "SED SE 601",
        "course_title": "Parent and Professional Collaboration",
        "description": "Designed to develop an understanding of the importance of collaboration with parents and professionals when working with children with disabilities. Focus on effective collaborative strategies, co-teaching models, service delivery models, and cultural responsiveness. 2cr."
    },
    {
        "course_code": "SED SE 650",
        "course_title": "Children at Risk",
        "description": "Theories, research, and practice about children and adolescents whose academic/psychological/physical well-being is at risk. Topics include: poverty, substance abuse, institutionalization of children, adoption, mental illness, school dropouts, physical/emotional abuse, domestic violence, and children with disabilities. 4 cr."
    },
    {
        "course_code": "SED SE 693",
        "course_title": "Practicum in Disabilities Studies",
        "description": "Through fieldwork experience and accompanying seminar, students develop an understanding of human services agencies serving individuals with disabilities, educational service delivery models, policies, roles and responsibilities, and collaboration. Only open to matriculated graduate students who have completed prerequisites. Var cr."
    },
    {
        "course_code": "SED SE 706",
        "course_title": "Introduction to Special Education",
        "description": "Students will examine various disabilities (etiology, diagnostic criteria/process, impacts on learning); analyze historical and contemporary ethical issues including inclusive and culturally-/linguistically-responsive practices; learn federal legislation; and gain foundational understanding of instructional and behavioral management strategies. 4 cr."
    },
    {
        "course_code": "SED SE 744",
        "course_title": "School Administration and Special Needs",
        "description": "Designed to develop an understanding of administration of special education programs, federal and state legislation and local policies, administrative support for implementation of best practices for pre-referral processes and instructional/behavioral interventions, evaluation of program quality, and supervision/evaluation of staff. Prereq: SE 706. 4 cr."
    },
    {
        "course_code": "SED SE 805",
        "course_title": "Research Work in Special Education",
        "description": "Doctoral students work with faculty to investigate a specific research topic. Register for a minimum of 2 credits. Variable cr."
    },
    {
        "course_code": "SED SE 807",
        "course_title": "Field Experience",
        "description": "Graduate Prerequisites: Open only to matriculated graduate students who have completed prerequisites. Graduate students are involved in field experiences in schools, institutions, clinics, and other human services agencies serving students with disabilities. Students must register for a minimum of 2 credits. 2 cr.",
        "prerequisites": "Open only to matriculated graduate students who have completed prerequisites."
    },
    {
        "course_code": "SED SE 900",
        "course_title": "Independent Study",
        "description": "See SED AP 900 for description. Prereq: Approval of advisor. Complete the online Directed study form. Wheelock Office of Records. Var cr."
    },
    {
        "course_code": "SED SE 999",
        "course_title": "Dissertation Advisement",
        "description": "See SED AP 999 for description. Prereq: Approval of advisor. Complete the online Directed study form. Wheelock Office of Records. Var cr."
    },
    {
        "course_code": "SED SO 525",
        "course_title": "Multilingualism and Intercultural Communication",
        "description": "This course describes the role of language, literacy, and communication in globalization by examining their use across cultural, political, and geographic boundaries, and highlighting how language and cultural forms flow in global networks and across cultural boundaries; constructing transcultural and transnational student identities. 4cr, 1st sem."
    },
    {
        "course_code": "SED SO 566",
        "course_title": "Teaching Critical Historical Inquiry",
        "description": "Students will investigate the history, subspecialties, pedagogy, and research in history education for middle and high school, as related to historical thinking, literacy, and problem solving. Students will develop an understanding of historical literacy, historical thinking, inquiry, and problem solving. Students will develop competencies in developing and presenting research-based history lessons. Effective Fall 2019, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry II, Oral and/or Signed Communication, Creativity/Innovation. BU Hub Learn More Oral and/or Signed CommunicationSocial Inquiry IICreativity/Innovation",
        "BU_Hub": [
            "Oral and/or Signed Communication",
            "Social Inquiry II",
            "Creativity/Innovation"
        ]
    },
    {
        "course_code": "SED SO 567",
        "course_title": "History Laboratory",
        "description": "Explores the use of field-based and classroom methods for teaching students with historical sites and museums. The course includes visits to local historical sites and museums. Effective Spring 2020, this course fulfills a single unit in the following BU Hub area: Aesthetic Exploration. BU Hub Learn More Aesthetic Exploration",
        "BU_Hub": [
            "Aesthetic Exploration"
        ]
    },
    {
        "course_code": "SED SO 571",
        "course_title": "Curriculum & Special Methods for History & Social Sciences, 5-12",
        "description": "Examines curriculum and teaching methods in social science education, grades 5-12. Students develop and present research-based lessons and unit plans in history, civics, economics, geography, and other social sciences. Development of teaching materials and classroom techniques for social studies education. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Digital/Multimedia Expression, Ethical Reasoning, Teamwork/Collaboration. BU Hub Learn More Ethical ReasoningDigital/Multimedia ExpressionTeamwork/Collaboration",
        "BU_Hub": [
            "Ethical Reasoning",
            "Digital/Multimedia Expression",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED SO 572",
        "course_title": "Curriculum and Special Methods for History and Social Science, 5-12",
        "description": "Reviews traditional and recent Examines curriculum materials in history or curriculum and teaching methods in social science education for middle, junior, and senior high school. Students develop competencies in developing and presenting research-based lessons and unit plans in history, civics, economics, geography, and the other social sciences. Analysis of curricular goals for grades 5-12. Development of new teaching materials and classroom techniques for social studies education at various age levels. Effective Fall 2019, this course fulfills a single unit in each of the following BU Hub areas: Ethical Reasoning, Digital/Multimedia Expression, Teamwork/Collaboration. This course must be taken for 4 credits. BU Hub Learn More Ethical ReasoningDigital/Multimedia ExpressionTeamwork/Collaboration",
        "BU_Hub": [
            "Ethical Reasoning",
            "Digital/Multimedia Expression",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED SO 574",
        "course_title": "Pre-practicum in Social Studies",
        "description": "Pre-practicum experience that engages students in observing and assisting in middle and/or high school classrooms. 2cr."
    },
    {
        "course_code": "SED SO 933",
        "course_title": "Doctoral Seminar in History Education",
        "description": "Study of the historical, philosophical, theoretical, and curricular foundations of history education. Open to doctoral students; other with permission. 4 cr."
    },
    {
        "course_code": "SED SO 935",
        "course_title": "Advanced Doctoral Seminar in Civic Education and Engagement",
        "description": "Study of the historical, philosophical, theoretical, and curricular foundations of civic education/education for democracy. Open to doctoral students; other with permission. 4 cr."
    },
    {
        "course_code": "SED TL 508",
        "course_title": "Methods of Teaching English as a Second Language (ESL), 5-12",
        "description": "Planning and implementing effective assessment and instruction in language, literacy, and the content areas in secondary English as a second language classrooms. Students develop standards-based lesson plans, and analyze texts using current English language development frameworks. 4 cr. Either sem."
    },
    {
        "course_code": "SED TL 509",
        "course_title": "Foundations of Teaching English to Speakers of Other Languages (TESOL)  Pedagogy",
        "description": "This course offers a foundation in the approaches, methods, and materials for the teaching and learning of second and foreign languages. Focus on topics that provide teachers with a knowledge base adaptable for different educational settings and student populations. 4 cr."
    },
    {
        "course_code": "SED TL 512",
        "course_title": "Introduction to Computer-Assisted Language Learning (CALL)",
        "description": "Survey of current classroom practices in computer-assisted language learning (CALL), Focus on relationships among teaching, learning, and technological environments involving second and foreign language learners and teachers. 4 cr."
    },
    {
        "course_code": "SED TL 520",
        "course_title": "Teaching English Language Learners",
        "description": "Focus on theory/research related to teaching English language learners and the implications for effective language, literacy, and content-area assessment and instructional practices in Sheltered English Immersion classrooms. For students seeking licensure in Early Childhood, Elementary Education, and Special Education. 4 cr."
    },
    {
        "course_code": "SED TL 525",
        "course_title": "Teaching English Language Learners in Middle/High Schools",
        "description": "Focus on theory/research related to teaching English language learners and the implications for effective language, literacy, and content-area assessment and instructional practices in Sheltered English Immersion classrooms in middle/high schools. For students seeking licensure at the 5-12 level. 4 cr."
    },
    {
        "course_code": "SED TL 612",
        "course_title": "Student Teaching Practicum and Seminar for Domestic Students",
        "description": "Graduate Prerequisites: Open only to matriculated graduate students who have completed prerequisites. Supervised student teaching in a college or adult education program in English as a second language. Graduate Prereq: Open only to matriculated graduate students who have completed prerequisites. 6 cr.",
        "prerequisites": "Open only to matriculated graduate students who have completed prerequisites."
    },
    {
        "course_code": "SED TL 614",
        "course_title": "Field Experience and Seminar for International Students",
        "description": "Field observation in a college or adult education program in English as a second language. Open only to matriculated international graduate students who have completed prerequisites. 4 cr."
    },
    {
        "course_code": "SED TL 622",
        "course_title": "Assessment for Language Teaching and Research",
        "description": null
    },
    {
        "course_code": "SED TL 635",
        "course_title": "Introduction to Language Program Management",
        "description": "Designed to introduce students to all aspects of language program management from academic areas of curriculum planning, student assessment, and program design to the management topics of finance, organizational behavior, and human resources. 4 cr."
    },
    {
        "course_code": "SED TL 835",
        "course_title": "Advanced Seminar in TESOL Pedagogy",
        "description": "Graduate Prerequisites: SED TL 509; or consent of instructor. Methodological issues in the teaching of English to speakers of other languages. In- depth treatment of a variety of curricular, pedagogical, and language program topics. Development and demonstration of curriculum projects. 4 cr.",
        "prerequisites": "SED TL 509; or consent of instructor."
    },
    {
        "course_code": "SED WL 503",
        "course_title": "Pre-Practicum in Modern Foreign Languages",
        "description": "This course supports students in their World Language education teaching pre- practicum. Students complete teaching observations, reflect on- field experiences, evaluate teaching practice against professional teaching standards, and develop and implement micro-teaching lessons to prepare for their practicum."
    },
    {
        "course_code": "SED WL 504",
        "course_title": "Student Teaching Seminar in Modern Foreign Languages",
        "description": "This course supports students in their World Language education teaching practicum. Students reflect on-field experiences, evaluate their practice and those of their classmates, develop professional goals, and prepare to enter the job market."
    },
    {
        "course_code": "SED WL 511",
        "course_title": "Teaching Methods in World Language Education",
        "description": "This course examines pedagogical approaches in world language teaching and learning. Students explore standards-based instructional methods, models of teaching, discuss underlying theories, and examine current issues in the field. Students develop lesson plans and practice high-leverage teaching practices. BU Hub Learn More Oral and/or Signed CommunicationDigital/Multimedia ExpressionTeamwork/Collaboration",
        "BU_Hub": [
            "Oral and/or Signed Communication",
            "Digital/Multimedia Expression",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED WL 512",
        "course_title": "Curriculum & Assessment in World Language Education",
        "description": "This course examines curriculum and assessment in world languages. Students develop a deep understanding of ACTFL Proficiency levels, assess learner proficiency, develop performance assessments, conduct Oral Proficiency Interviews (OPIs), and develop thematic curricula and units from a social justice perspective. BU Hub Learn More Oral and/or Signed CommunicationDigital/Multimedia ExpressionTeamwork/Collaboration",
        "BU_Hub": [
            "Oral and/or Signed Communication",
            "Digital/Multimedia Expression",
            "Teamwork/Collaboration"
        ]
    },
    {
        "course_code": "SED WL 513",
        "course_title": "Input & Interaction in the World Language Classroom",
        "description": "This course focuses on developing and demonstrating two essential principles of world language teaching: using the target language and supporting learner interactions. Students develop lessons and complete micro-teachings."
    },
    {
        "course_code": "SED WL 514",
        "course_title": "SED WL 514 Inclusive Principles & Practices in World Language Education",
        "description": "Explores teaching for justice in world language education by developing intercultural citizenship and disrupting inequality. Policies of exclusion, barriers to access, and classroom practices are examined to support an inclusive classroom where all learners experience success. 4 cr. Either sem."
    },
    {
        "course_code": "SED WL 532",
        "course_title": "Young Learners in World Language Education",
        "description": "This course examines models of early language learning and standards-based instructional practices to support young language learners. Students observe and critique teaching videos, develop lessons, and engage in micro-teachings. Different program models, including FLES and immersion programs, are explored."
    },
    {
        "course_code": "SED WL 541",
        "course_title": "Practicum in Arabic as a World Language, PK-6",
        "description": "Students pursuing Arabic licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 542",
        "course_title": "Practicum in Chinese as a World Language, PK-6",
        "description": "Students pursuing Chinese licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 543",
        "course_title": "Practicum in French as a World Language, PK-6",
        "description": "Students pursuing French licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 544",
        "course_title": "Practicum in German as a World Language, PK-6",
        "description": "Students pursuing German licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 545",
        "course_title": "Practicum in Italian as a World Language, PK-6",
        "description": "Students pursuing Italian licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 546",
        "course_title": "Practicum in Japanese as a World Language, PK-6",
        "description": "Students pursuing Japanese licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 547",
        "course_title": "Practicum in Portuguese as a World Language, PK-6",
        "description": "Students pursuing Portuguese licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 548",
        "course_title": "Practicum in Spanish as a World Language, PK-6",
        "description": "Students pursuing Spanish licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 549",
        "course_title": "Practicum in Russian as a World Language, PK-6",
        "description": "Students pursuing Russian licensure in the World Language Education program are assigned a PK-6 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 551",
        "course_title": "Practicum in Arabic as a World Language, 5-12",
        "description": "Students pursuing Arabic licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 552",
        "course_title": "Practicum in Chinese as a World Language, 5-12",
        "description": "Students pursuing Chinese licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 553",
        "course_title": "Practicum in French as a World Language, 5-12",
        "description": "Students pursuing French licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 554",
        "course_title": "Practicum in German as a World Language, 5-12",
        "description": "Students pursuing German licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 555",
        "course_title": "Practicum in Italian as a World Language, 5-12",
        "description": "Students pursuing Italian licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 556",
        "course_title": "Practicum in Japanese as a World Language, 5-12",
        "description": "Students pursuing Japanese licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 557",
        "course_title": "Practicum in Portuguese as a World Language, 5-12",
        "description": "Students pursuing Portuguese licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 558",
        "course_title": "Practicum in Spanish as a World Language, 5-12",
        "description": "Students pursuing Spanish licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 559",
        "course_title": "Practicum in Russian as a World Language, 5-12",
        "description": "Students pursuing Russian licensure in the World Language Education program are assigned a 5-12 student teaching field placement, completing observations and classroom teaching."
    },
    {
        "course_code": "SED WL 586",
        "course_title": "Practicum in World Language Education",
        "description": "This course is for students in the World Language education teaching practicum. Students are assigned to a field placement, observe, and engage in lead teaching."
    },
    {
        "course_code": "SED WL 604",
        "course_title": "Field Experience Seminar in World Languages",
        "description": "This course supports students in their World Language education field experience. Students reflect on field experiences, evaluate their practice and those of their classmates, develop professional goals, and prepare a portfolio documenting standards-based teaching practices."
    },
    {
        "course_code": "SED WL 686",
        "course_title": "Field Experience in World Languages",
        "description": "Supervised field experience for students in World Language education. Students engage in a field placement, are observed and receive feedback and coaching on their teaching."
    },
    {
        "course_code": "SED YJ 201",
        "course_title": "Intro to Youth Justice & Delinquency",
        "description": "Overview of juvenile justice and the nature, extent, and causes of juvenile delinquency. Considers topics of delinquency prevention, youth-police interaction, juvenile court process, correctional intervention, and multi- systemic interactions. Includes an experiential component. 4cr. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, Ethical Reasoning. BU Hub Learn More Ethical ReasoningOral and/or Signed Communication",
        "BU_Hub": [
            "Ethical Reasoning",
            "Oral and/or Signed Communication"
        ]
    },
    {
        "course_code": "SED YJ 301",
        "course_title": "Juvenile Courts and Juvenile Law",
        "description": "Explores the history of juvenile court, juvenile court structure, the adjudication process, constitutional rights of juveniles and the scope of juvenile court jurisdiction over delinquent acts and status offenses. Highlights policy issues, legal case study and significant variation in court practices. 4cr"
    },
    {
        "course_code": "SED YJ 360",
        "course_title": "Positive Youth Development",
        "description": "Explores foundations of adolescent development and principles of positive youth development. Draws from multiple disciplines to examine roles of bio- psycho- social contexts and positive youth development practices and their impacts on the lives of developing adolescents. Applies developmental knowledge to current issues in adolescent development and youth justice and advocacy. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Oral and/or Signed Communication, Social Inquiry I. BU Hub Learn More Social Inquiry IOral and/or Signed Communication",
        "BU_Hub": [
            "Social Inquiry I",
            "Oral and/or Signed Communication"
        ]
    },
    {
        "course_code": "SED YJ 380",
        "course_title": "Youthwork & Advocacy",
        "description": "Application of positive youth development to youth advocacy, youth empowerment and youth activism. The course explores youth assets and strengths and how to develop youth-led strategies and effective advocacy with court-involved youth. Students explore current policy issues related to system-involved youth. 4cr."
    },
    {
        "course_code": "SED YJ 401",
        "course_title": "Practicum in YJA",
        "description": "Undergraduate Prerequisites: SED YJ 201, SED YJ 301, SED YJ 302, SED YJ 360, SED YJ 380 and senior standing. Field placement focuses on professional development for work with youth and families. On-site practicum (16 hours/week, total 200 hours/semester). Taken concurrently with SED YJ 404 for supervision and skill development. Restricted to qualified students in Youth Justice and Advocacy.",
        "prerequisites": "SED YJ 201,  SED YJ 301, SED YJ 302, SED YJ 360, SED YJ 380 and senior standing."
    },
    {
        "course_code": "SED YJ 403",
        "course_title": "Senior Integrative Capstone in YJA",
        "description": "Undergraduate Prerequisites: SED YJ 201, SED YJ 301, SED YJ 302, SED YJ 360, SED YJ 380, SED YJ 401/404 AND SENIOR STANDING This four-credit undergraduate capstone course integrates and applies the conceptual frameworks underpinning coursework in YJA with practice via an experiential learning opportunity and written assignments. The focus is on integration of theory and practice in youth work.",
        "prerequisites": "SED YJ 201, SED YJ 301, SED YJ 302, SED YJ 360, SED YJ 380, SED YJ 401/404 AND SENIOR STANDING"
    },
    {
        "course_code": "SED YJ 404",
        "course_title": "Practice Seminar in YJA",
        "description": "Undergraduate Prerequisites: SED YJ 201, SED YJ 301, SED YJ 302, SED YJ 360, SED YJ 380 AND SENIORSTANDING Integrates conceptual frameworks and skill development with practicum experience. Focus is on professional development for work with youth and families. Meets weekly and includes supervision. Taken concurrently with SED YJ 401. Restricted to qualified students in Youth Justice & Advocacy.",
        "prerequisites": "SED YJ 201, SED YJ 301, SED YJ 302, SED YJ 360, SED YJ 380 AND SENIORSTANDING"
    }
]