[
    {
        "course_code": "SSW CP 759",
        "course_title": "Introduction to Clinical Social Work Practice",
        "description": "Graduate Prerequisites: Required of all students. Graduate Corequisites: Required to be in a field placement with this course This foundation course teaches the clinical skills needed at various stages of the helping process (i.e., engagement, assessment, goal-setting and treatment planning, intervention and termination), whether the client is an individual, group, or family. Clinical methods are highlighted--what the social worker purposefully does as s/he works with individual clients and larger systems (e.g., groups, families, and communities) and how the social worker reacts and interacts in the helping relationship. The helping relationship is seen as requiring collaboration between clinician and client and the strategic use of clinical skills (e.g., strengthening rapport, assessing needs and strengths, reaching for feelings, identifying goals and expectations, setting limits) throughout the process. The helping relationship is also based on sound social work values and ethics, positive regard for the full range of human diversity, and dedication to social and economic justice. While the course emphasizes ways that clinicians can help clients accomplish goals, it also emphasizes the value of the helping relationship as a vehicle for client growth. Because a major hallmark of effective social work practice is the ability to reflect on one's interactions with individual clients and larger client systems, this course highlights the need to develop the capacity for professional self-reflection (i.e., the ability to observe and critique one's actions in relation to clients, supervisors, and colleagues and the integration of personal and professional \"selves\"). Core concepts of individual, family, and group intervention, case management, short-term work, and crisis intervention are introduced. Individual methods focus on developing and maintaining the helping relationship. Family methods focus on joining with the family as an entire system when multiple members are available, or when only an individual is available, intervening with the individual while considering influences and implications for the family system. Group work methods concentrate on group types, group formation, and group development.",
        "prerequisites": "Required of all students."
    },
    {
        "course_code": "SSW CP 762",
        "course_title": "Advanced Group Work",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This advanced group work course is designed for social work students who desire further learning in group practice, to deepen their understanding of the group work method in social work, and for students interested in leadership and supervision roles. Group Work as a method is far-reaching and is utilized across the spectrum of practice, from the micro and clinical interventions to the organizational and macro interventions. The aim of the course is to deepen students' understanding of group dynamics, theories, and method, with a special emphasis on the group-as-a-whole. The relationship between the group and its environment will be woven throughout the course, as will ethics and issues of diversity and difference--class, age, gender, race, ethnicity, religion, and sexual orientation, etc.. Organizationally, the course examines the worker's use of self, the group, program, research, and the environment (although in real life, these aspects of group life are used simultaneously).",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 764",
        "course_title": "Group Dynamics",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This advanced seminar in group modalities and dynamics is designed for social work students who are planning to work with groups of various types and sizes and for those advanced students who wish to further their group work experience. The aim of the seminar is to deepen students' knowledge base and practice with group dynamics and selected group work modalities. The relationship among the group members and between members and the group facilitator(s) is a significant focus in the seminar. Throughout the seminar, emphasis is placed on enhancing students' understanding, application and evaluation of evidence-based group work (EBGW). Attending to issues of ethics and issues of diversity--class, age, gender, race, ethnicity, religion, and sexual orientation -- are woven throughout the seminar. The seminar is organized to include opportunities for a critical analysis of group dynamics, single-session experiential groups, and various group exercises. Priority is given to the further development of the professional 'group worker' in roles as leader, consultant and presenter. A highlighted component of the seminar includes Guest Presenters who are expert in specific group work modalities and/or with specific populations. The Presenters will aid the students in the seminar to hone a deeper understanding of facilitator interventions and use of self in the group setting.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 770",
        "course_title": "Clinical Practice with Individuals",
        "description": "Graduate Prerequisites: SSW CP 759; Required of all clinical students. Graduate Corequisites: Required to be in a field placement with this course. The purpose of this course is to deepen skills of differential assessment, formulation, and intervention with individuals. Three theoretical approaches guide this work: Cognitive (focusing on thoughts, feelings, and behavior), Behavioral (focusing on monitoring and reinforcing positive behavior), and Psychodynamic (focusing on dysfunctional childhood patterns repeated in the present). Using these perspectives, students analyze videotaped treatment sessions, demonstrate therapeutic approaches through classroom skill-practice, and present cases from their field internships for analysis and discussion.",
        "prerequisites": "SSW CP 759; Required of all clinical students."
    },
    {
        "course_code": "SSW CP 771",
        "course_title": "Clinical Practice with Groups",
        "description": "Graduate Prerequisites: SSW CP 759; Required of all clinical students. Graduate Corequisites: Required to be in a field placement with this course. Students acquire knowledge of group stages (from formation through termination), group types (task-oriented, psycho-educational, support and therapy) and group structure (single-session, time-limited, open versus closed groups). They also develop skills for forming and leading groups. The Mutual-Aid model provides the central organizing framework, showing the worker (a) how to mediate between and among three domains-- individual member, the group as a whole, and the environment, (b) how to respond to dynamics such as transference, countertransference, and issues of power and control, and (c) how to promote client and group empowerment. Building on knowledge and skills from CP 759 (Introduction to Clinical Practice), students learn how to use themselves effectively with diverse populations, in various community and clinical settings, and with differing member problems and concerns. Social and environmental stressors on group members and the group as a whole are considered at all stages of group development and with a variety of group types. Since social workers must have the capacity to assume varying roles in groups, students learn to shift the nature of their participation depending on the situation, for example, to be a colleague in an interdisciplinary team of care providers, to be the leader of a neighborhood task force, and to be a clinician providing psycho-educational services to the parents of mentally ill clients. The greatest opportunity for skill development in this course occurs when students take initiative to organize, lead, or co-lead groups in their placement, and all are encouraged to do so, if this is possible within the nature of the placement.",
        "prerequisites": "SSW CP 759; Required of all clinical students."
    },
    {
        "course_code": "SSW CP 772",
        "course_title": "Clinical Practice with Families",
        "description": "Graduate Prerequisites: SSW CP 759; Required of all clinical students. Graduate Corequisites: Required to be in a field placement with this course. Major goals of this course are to help students think systemically and learn skills to conduct family sessions with various family members. Students will learn family systems concepts and theories that are foundational to the practice of family assessment and intervention. A conceptual framework, Liberation Health, will be used to assist students in understanding families within the larger socio-political-cultural context. Students will also learn Structural Family Therapy as an exemplar of a family systems intervention. Skill practice and exercises will illustrate (a) individual versus systemic thinking, and (b) the meaning of the symptom in the system. An important outcome is that students will be able to facilitate communication among family members. As part of this work, students will deepen their ability to build alliances with the family as a whole, assess families using common family assessment tools, and develop hypotheses about the family's experiences, structure and internal dynamics that may have affected the presenting problem. Students will practice family intervention techniques such as circular questioning, maintaining multiple alliances simultaneously, encouraging family members to speak directly to each other, contracting and goal setting, strengthening the caregiver subsystem, exploring the meaning of missing members, and identifying important family secrets and myths. Emphasis is placed on the clinician's use of self in working with diverse individuals and families who present with a range of problems.",
        "prerequisites": "SSW CP 759; Required of all clinical students."
    },
    {
        "course_code": "SSW CP 785",
        "course_title": "Family Therapy",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This advanced practice course builds on foundation year curricula and enhances the systemic paradigm shift by providing a broad overview of major family therapy approaches and of contemporary issues in and research on family therapy. Emphasis will be placed on the development of theory, evidence-based models and clinical practice in assessment and intervention with families. Students then concentrate on a few approaches and populations to facilitate developing family- centered therapeutic skills. Possible populations include but are not limited to: impact of trauma on family life and trauma-focused family practice, special issues for foster and adoptive families, substance use and misuse within families and family-centered approaches, clinical practice with military families and clinical approaches to working with LGBTQ families. The usefulness of utilizing a systems perspective to address issues in an urban context of social justice, at risk-populations and the effects of oppression will be embedded throughout the specific topics addressed in this course. Attention also will be given to diverse client systems and students are encouraged to bring up individuals and families they are working with for class discussion. Students observe and study videotapes of family therapists to practice assessment skills, develop an understanding of evidence-based clinical interventions and build proficiency in helping families with communication, organization and expression of feelings. They also explore and evaluate how the different models fit their own personal style. Class participation, including mini-exercises, role-plays, and discussion, will play a large role in augmenting reading assignments, lectures, and tapes.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 787",
        "course_title": "Clinical Practice with Couples",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This course provides an overview of the major theories and techniques of couples and marital therapy with an emphasis on empirically validated approaches to practice with couples. Throughout the course we incorporate an ecological understanding of family systems within the context of the multiple systems in which couple and family life is lived. Specific attention will be paid to the needs of the following populations; same-sex couples, inter-racial and inter- cultural couples; couples who have experienced physical aggression and infidelity; and couples living with chronic illness, histories of sexual abuse, and substance abuse. Students will explore and evaluate how the different models of social work practice with couples fit their own personal styles. Mini-exercises, skill-practice and class discussion play a significant role, as do lectures and viewing videotapes. As a group, students provide an in-class, theory-based instructional presentation and demonstration of a couples counseling session.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 791",
        "course_title": "Seminar in Anti-Oppressive Practice in Families and Communities",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This advanced seminar will provide a contemporary overview of special topics within family centered social work practice. Central among these topics will be further clinical skills training through the microanalysis of actual family treatment sessions through videos and role-plays, with a particular focus on making the connection between clinical constructs and their application in clinical work. We will utilize family therapy reflecting teams to help students develop new ideas and approaches with their current caseloads. Several different evidence-based models of treatment will be contrasted to consider their strengths/weaknesses in working with particular family constellations and to explore their overall effectiveness from the perspective of evidence-based practice. Other specific topics may include: 1) Working with families who have experienced trauma; 2) Home-based family treatment; 3) Ethical challenges in working with families; 4) Adoptive and foster family work; 5) Culturally sensitive family practices to more effectively address diversity including issues of race, class, gender, and sexual orientation; other topics based on student interest. Students should come away from the course with a more sophisticated understanding of social work with families, a clearer sense of their own clinical \"voice,\" and the means to continuously improve their own effectiveness as practitioners",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 794",
        "course_title": "Clinical Practice with Children",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This advanced practice course builds upon foundation courses and is designed to help students think about the breadth of clinical practice with children and adolescents using theoretical knowledge and practice skills and with consideration of development, trauma, contexts, and systems. Multidisciplinary perspectives and approaches including developmental, biopsychological, and systems/ecological approaches are utilized to understand the strengths and needs of children and adolescents with contexts and systems (e.g., schools, communities). Knowledge, practice skills, and ethics related to engagement, assessment, prevention, intervention, and treatment of diverse children and adolescents will be emphasized. In this course, students will learn about the theory, concepts, and research that are foundational to clinical practice. They will learn about seminal developmental theories that contribute to understanding of developmental processes and outcomes as well as identity formation. There will be a focus on understanding the systems and contexts that children and adolescents interact with to help students collaborate with systems and advocate for their clients. In addition, students will learn about decision-making related to selecting evidence-based and practice-based interventions appropriate for children and adolescents. Social justice will be heavily emphasized, and clinical work will be discussed using an anti-oppressive lens; students will be encouraged to engage in social justice advocacy for their clients and communities. Also, students will use a trauma-informed lens to learn about engagement, assessment, and treatment. Lastly, there will be a strong focus on self-reflection and reflection about the role of social workers, their relationship with their clients, and interactions with systems and contexts. Class time will include discussion of course readings, viewing videos, conducting case assessments, skills development, viewing videos, role-plays, policy presentations, and other interactive activities.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 795",
        "course_title": "Cognitive and Behavioral Treatment",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This elective course is designed to deepen practice knowledge and experience with cognitive and behavioral theory and treatment (CBT) for children and adults, that were introduced briefly in CP756 (Social Work Practice with Individuals). The course begins with a discussion of CBT, social work values, and social justice mission, and considers the strengths and limitations of CBT in the implementation of inclusive, affirming, anti-racist practice. The introduction also includes an overview of theoretical frameworks that underlie CBT, including cognitive models based mainly on A. T. Beck's theories as well as behavioral theory. The course incorporates Third Wave CBT therapies and forms of CBT including mindfulness based therapies as well as complementary approaches such as motivational interviewing. Cognitive/behavioral analysis (also called case formulation) and assessment of specific challenges as well as strengths, are taught using students' current practice experiences with children and adults. Several intervention methods are illustrated using client examples, video, demonstration and role-play where possible. These include developing a case conceptualization, cognitive restructuring, behavioral experiments, and exposure therapy (desensitization for treatment of anxiety). Discussions will include the application of CBT methods with consideration of structural factors, experiences of marginalization and oppression, the client/therapist relationship, the use of CBT methods in group settings, and ethical issues. For the major assignments, students complete two related paper and video assignments: (1) a cognitive and/or behavioral analysis and assessment of a current client in the student's field placement or work setting and (2) a review of the literature and application of relevant cognitive and/or behavioral intervention(s) related to this client. Two additional credit/no credit assignments involve identifying, assessing, analyzing and intervening with a personal habit or challenge that can be discussed in class. This provides personal experience applying CBT and an opportunity to incorporate self-care.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 798",
        "course_title": "Psychodynamic Practice with Adults",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This course builds on psychodynamic knowledge and skills gained in the prerequisite courses of CP 755, 756, and 757. Its purpose is to further the learner's understanding of use of professional self and relationships in longer term therapeutic work with a variety of adults at risk due to poverty, domestic and neighborhood violence, lack of social resources, lack of stable and nurturing life path environments, and current barriers to well-being, constructive relating, and self-fulfillment. Object relations, self-psychology, and relational theory inform learning through reading, assignments, class exercises, and case dialogue analysis. Instructor and students problem solve around issues arising in interpersonal work characterized by mutuality and reciprocity between worker and client productive of growth in both. Empathy is practiced as an assessment tool (vicarious introspection), an expression of support and identification, and a medium for the activation of client strengths and growth potentials. Students practice 'being where the client is\" in very difficult situations, and the long-term effects of prejudice, injustice, and social marginalization are frequently highlighted in assessments and intervention planning. Students learn to reflect on their own personal development and experiences as potential assets and blocks in aligning themselves well with client stories and reactions. Role plays and assignments help in identifying and correcting misalignments in use of self.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 799",
        "course_title": "Brief and Time-Effective Treatment",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This course surveys a range of brief and time effective treatment models including crisis intervention/single session interventions, solution focused brief therapy, narrative therapy, and stages of change/motivational interviewing. Students will develop skills in brief treatment that can be used with children, adolescents, families, and adults who present with substance use, trauma, depression, anxiety, domestic violence, and other issues of concern in multi-stressed urban populations. Students will acquire understanding of the theoretical and empirical bases, strengths, and limitations of each model. Use of in-class and videotaped role plays along with small group exercises will help students become more creative, flexible, and accountable in their approaches to treatment, and will direct students away from a deficit (pathology) model towards a resource (possibility) treatment model. Students learn to collaborate with clients to create well-formed treatment goals, and to measure change as it occurs over time. Finally, students explore how their own values and beliefs about change may help or hinder clinical practice in the current health care environment.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 803",
        "course_title": "Clinical Practice with Adult Trauma",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students Students learn different theoretical approaches to trauma and examine clinical strategies for intervening with traumatized adults from diverse backgrounds. Sources of trauma including natural disasters, the refugee and immigrant experience, interpersonal violence, and the accumulation of traumatic events over the life span are discussed in terms of their physical and emotional consequences. Students examine diagnostic issues including PTSD and complex PTSD, and co-occurring psychiatric disorders. Evidence-based interventions and emerging areas of practice with traumatized adult populations will be highlighted. Larger social, cultural and political forces are considered in shaping both exposure to and recovery from traumatic stressors. Finally, the impact of trauma work on clinicians and strategies for self-care and reducing burnout will be a theme of the course.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 804",
        "course_title": "Clinical Practice with Childhood Trauma",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students Students develop or deepen a working knowledge of different theoretical approaches to trauma and traumatic impact and examine clinical strategies for intervening with traumatized children and adolescents. Multiple types of trauma will be considered ranging from single-incident events to chronic, complex, and developmental trauma. Diagnostic issues, current controversies in the trauma field, and emerging areas of practice with traumatized children and adolescents will be discussed. Emphasis is placed on applying a developmental perspective and on current knowledge regarding the neurobiology of attachment, regulation, and traumatic impact in children and adolescents as the foundation for trauma- focused practice. Students will learn about phase-oriented treatment and study evidence-based models for children from birth through adolescence. Student learning and in-class exercises will focus on developing the specific skills for each model and on case formulation and presentation.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 806",
        "course_title": "Theory and Practice with LGBTQ Populations",
        "description": "Graduate Prerequisites: SSW CP 759 ; SSW CP 770 ; SSW CP 771 ; SSW CP 772; or permission of department chair. This advanced practice course employs affirmative models of clinical practice with LGBT individuals and families. Ecological and strengths-based approaches provide a framework for the course. Additional perspectives include: (1) postmodern perspectives on gender; (2) developmental models for acquiring G/L identity; (3) race and ethnicity, families, youth, and aging; (4) specific challenges facing the LGBT communities such as domestic violence, substance abuse, HIV/AIDS, and how to make agencies safe for LGBT clients and staff; and (5) social work practice with bisexual and transgendered persons. Also addressed will be LGBT individuals living in predominantly hetero-centric environments and ways they cope with these stressors. Material for this course includes relevant research, first person narratives, movies, speakers representing mental health and social service agencies serving LGBT individuals and families, and members of these communities themselves.",
        "prerequisites": "SSW CP 759 ; SSW CP 770 ; SSW CP 771 ; SSW CP 772; or permission of department chair."
    },
    {
        "course_code": "SSW CP 807",
        "course_title": "Clinical Practice with Older Adults",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students This course reviews life cycle and other developmental theories informing clinical practice with aging populations. Discussion highlights the impact of poverty, racism, ageism, and changing economics on the bio-psycho-social phenomenology of aging in urban environments. Special issues related to mental health, substance abuse, and cognitive impairment in this population are reviewed. Students learn methods for interviewing, assessing, diagnosing and intervening with older people, their families, and their networks are taught through case analysis and role play.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW CP 814",
        "course_title": "Advanced Trauma Seminar",
        "description": "Graduate Prerequisites: SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students Graduate Corequisites: SSW CP 755 or SSW CP 756 or SSW CP 757; For Advanced Standing Students The Advanced Trauma Seminar is designed for students to deepen their knowledge of the impact of trauma, increase their skill set in the treatment of diverse people who have experienced trauma, and examine the impact of systems and societal inequality on both people who have experienced trauma and their related clinical care. Multiple conceptualizations of trauma, inequality, and mental health will be discussed, with associations between micro- and macro-level harm and healing being emphasized. This course builds on CP 803 & CP 804, with emphases on critical thinking as it relates to relational harm and healing. Foundations of the course include respect for client agency and autonomy, as well as institutionalized self-care. We will contextualize trauma-related mental health through examining intersectionality, sexual violence, relational harm of interpersonal trauma, and marginalized perspectives on mental health and healing. We will additionally focus on relational approaches to therapy and addressing systems of oppression within therapy. Finally, we will revisit ethics in therapy and identify social workers' roles in advocating for social justice for their clients through macro-level change.",
        "prerequisites": "SSW CP 755 ; SSW CP 756 ; SSW CP 757; For Traditional Track and HSE Students"
    },
    {
        "course_code": "SSW ET 753",
        "course_title": "Ethics and the Social Work Profession",
        "description": "This required seminar is intended to inspire the moral imagination of social work students, and prepare them for competent and compassionate ethical practice as professionals. Ethics and the Social Work Profession (ET 753), examines the issues of social work professionalism, the process of becoming a social work professional, the tensions inherent in the goals of social work, and the ways these interrelate to produce conflicts of values and ethics in social work practice. The course focuses on acquiring and practicing the skills of ethical decision-making, including values clarification, application of ethical theory, utilization of codes of ethics, and models of ethical analysis. Both clinical and macro aspects of social work are explored, with an emphasis on the contemporary challenges of practice in multicultural and urban settings. Issues of self-care, impairment, licensure, malpractice, whistle-blowing and other professional challenges are explored. The course is set in the advanced curriculum as an integrative capstone, designed to be concurrent with the student's final semester in the MSW program."
    },
    {
        "course_code": "SSW FE 800",
        "course_title": "Integrative Field Seminar",
        "description": "Graduate Prerequisites: Required of Charles River students in their first placement. OCP students should consult their program director. The focus of this seminar is professional development and the role of the social work intern in the agency. The seminar meets several times each semester. Instructor sets schedule. Attendance is required.",
        "prerequisites": "Required of Charles River students in their first placement. OCP students should consult their program director."
    },
    {
        "course_code": "SSW FE 801",
        "course_title": "Field Education I",
        "description": "Graduate Corequisites: SSW FE 800. Required of all students in their first semester of the first (foundation) field placement. Also required to be registered for a methods course."
    },
    {
        "course_code": "SSW FE 802",
        "course_title": "Field Education  II",
        "description": "Graduate Corequisites: SSW FE 800. Required of all students in their second semester of the first (foundation) field placement. Also required to be registered for a methods course."
    },
    {
        "course_code": "SSW FE 803",
        "course_title": "Field Education III",
        "description": "Required of all students in their first semester of the standard second (advanced) field placement. Also required to be registered for a methods course."
    },
    {
        "course_code": "SSW FE 804",
        "course_title": "Field Education IV",
        "description": "Required of all students in their second semester of the standard second (advanced field placement). Also required to be registered for a methods course."
    },
    {
        "course_code": "SSW FE 808",
        "course_title": "Fld 4/2 May-May",
        "description": null
    },
    {
        "course_code": "SSW FE 818",
        "course_title": "Field Ed 818",
        "description": null
    },
    {
        "course_code": "SSW FE 819",
        "course_title": "Field Ed 819",
        "description": null
    },
    {
        "course_code": "SSW FE 820",
        "course_title": "Field Ed 820",
        "description": null
    },
    {
        "course_code": "SSW FE 821",
        "course_title": "Field Ed 821",
        "description": null
    },
    {
        "course_code": "SSW FE 822",
        "course_title": "Field Ed 822",
        "description": null
    },
    {
        "course_code": "SSW FE 823",
        "course_title": "Field 4/2 Jan-Jan",
        "description": null
    },
    {
        "course_code": "SSW FE 824",
        "course_title": "Field Ed 824",
        "description": null
    },
    {
        "course_code": "SSW FE 825",
        "course_title": "Field Ed 825",
        "description": null
    },
    {
        "course_code": "SSW HB 720",
        "course_title": "Human Behavior in the Social Environment",
        "description": "Graduate Corequisites: Graduate Corequisites: HB 735; Or permission of department chair. Required of all students. Human Behavior in the Social Environment (HBSE) is designed to help you chart a knowledgeable course through the complexity of human experience. We will explore a select set of theories that help us understand how individuals and communities develop and interact. Because empathic and skillful interventions with individuals, groups, and communities require understanding ourselves as well as others, the course provides an opportunity for increased self-awareness. At the beginning of the course, we focus on the key theories that help us understand the dimensions and expression of human behavior in the social environment. This discussion is followed by an examination of how dimensions of culture and cultural contexts can shape individuals values, beliefs, worldviews, and identities, all of which play a role in the helping process. Through discussion and analysis, we will explore areas of universality and difference in the context of gender, race, ethnicity, sexual orientation, spiritual beliefs, and socioeconomic class, as well as the realities and influence of multiple forms of oppression. Finally, we will examine human development throughout the lifespan, considering the developmental scientific knowledge base regarding opportunities and vulnerabilities during the different stages of the lifecycle, and the biopsychosocial and cultural factors that can influence individual development. HB 720 constitutes the foundation course in the human behavior department and is the underpinning of all courses in the HBSE sequence. The ability to analyze human behavior in the social environment, drawing from theoretically and empirically-grounded evidence bases, is essential for social work practice, whether the primary focus is clinical or macro. Social work has a distinct perspective that emphasizes the interconnection between individuals and their environments. The framework draws from other disciplines, including anthropology, economics, psychology, biology, and sociology. The course will provide an understanding of the interactions among biological, social, and psychological, and cultural systems. Forces that facilitate optimal growth and development will be contrasted with forces that impede development. The course will build on your undergraduate knowledge of basic human behavior theories, adding theoretical breadth, critical contextualization, and professional application."
    },
    {
        "course_code": "SSW HB 723",
        "course_title": "Assessment and Differential Diagnosis with Adults",
        "description": "Graduate Prerequisites: SSW HB 720 or permission of department chair. The goal of this course is to provide students with a framework for understanding human behavior when challenges to healthy adult functioning overwhelm coping mechanisms and resources. A biopsychosocial model of psychopathology is emphasized as we study some of the disorders classified in the DSM-5, including anxiety disorders, mood disorders, psychotic disorders, PTSD, dissociative disorders, personality disorders, eating disorders, and substance abuse/addictions. Complex factors in the etiology of various disorders are considered, including genetic, neurochemical, biological, developmental, familial, sociocultural, and political variables that affect the occurrence, presentation, course, and treatment of a problem. While learning the perspective and language of the phenomenological approach outlined in the DSM-5, we also highlight weaknesses and blind spots in the traditional approach to diagnoses. In particular, we explore the impact of oppression and bias on the naming and treatment of mental disorders, including the influences of race, gender, sexual orientation, class, disability, religion, and ethnicity on the diagnostic process. Students learn to consider the DSM-5 classification system as a social construction that reveals as much about the society and its views of human behavior as it does about the clients with whom social workers have contact.",
        "prerequisites": "SSW HB 720 or permission of department chair."
    },
    {
        "course_code": "SSW HB 727",
        "course_title": "Assessment and Differential Diagnosis with Children",
        "description": "Graduate Prerequisites: SSW HB 720; Or permission of department chair. Grad Prereq: SSW HB 720 or permission of department chair. *This course uses a developmental psychopathological model to explore complex psychological disturbances in children, adolescents, and families with a focus on the urban family experience. It addresses multiple research and theoretical perspectives that promote a way of understanding ?normal? and ?pathological? child and adolescent behaviors that change over time in the context of their genetic make- up, biological processes, interpersonal relationships, culture, and available community resources and support. In this course, developmental, systemic, psychodynamic, neurobiological and behavioral theoretical perspectives inform students? understanding of children and adolescents? adaptive and maladaptive patterns of behavior, which evolve over time in the context of their complex developmental histories and socio-cultural relational experiences. The course promotes the importance of assessing in children and families both the historical and present risks for disturbed behavioral development and the historical and present protective factors that promote healthy and resilient behavioral development.",
        "prerequisites": "SSW HB 720; Or permission of department chair."
    },
    {
        "course_code": "SSW HB 735",
        "course_title": "Racial Justice and Cultural Oppression",
        "description": "Graduate Corequisites: Graduate Corequisites: HB 720; Or permission of department chair. Required of all students This course examines the causes and implications of racism as a dynamic force influencing social work, and the Intersectionality of racism with other forms of oppression. The course builds on and integrates concepts presented in foundation courses. It analyzes and evaluates the social, cultural, political, economic and interpersonal contexts of racism that bear on our current policies and institutional arrangements. The course is designed to familiarize students with 1) theoretical overviews of racism and oppression; 2) historical accounts and contemporary experiences of racism, 3) the formation of complex racial identity, 4) multicultural contexts and fundamentals of cultural competency, and 5) effective social change efforts based on organizational analysis."
    },
    {
        "course_code": "SSW HB 743",
        "course_title": "Social Work with Refugees and Immigrants",
        "description": "Graduate Prerequisites: SSW HB 720; Or permission of department chair. Social workers and other mental health and social service practitioners find themselves increasingly called upon to work with refugees and immigrants from around the world. Social workers are also becoming sought after by international development agencies and non-governmental organizations. In this course we gain an understanding of the refugee and immigrant experience and of the continuum of the acculturation process. We examine the potential problems facing these individuals and families as they seek to rebuild their lives; we learn to recognize and utilize their strengths, cultural resources and natural support systems; and we increase our cultural competence by learning skills for culturally appropriate relationship-building, clinical assessment, and intervention.",
        "prerequisites": "SSW HB 720; Or permission of department chair."
    },
    {
        "course_code": "SSW HB 744",
        "course_title": "Spirituality and Social Work Practice",
        "description": "Graduate Prerequisites: SSW HB 720; Or permission of department chair. The goal of this course is to acquaint the student with current theories regarding religion and spirituality and their role in clinical work. Particular attention is given to the function of spirituality and religion in bridging internal and external adaptations throughout the life cycle. Utilizing psychodynamic and narrative frameworks, this course addresses ways of assessing and working with an individual?s spiritual and existential belief systems and attending to the ways in which spiritual beliefs and practices provide a window into a client?s inner world. In addition, the course addresses issues of transference and countertransference as they arise in the exploration of religious and spiritual material in psychotherapy. The course draws heavily on case material, film, and fiction.",
        "prerequisites": "SSW HB 720; Or permission of department chair."
    },
    {
        "course_code": "SSW HB 750",
        "course_title": "Organizational Behavior and Culture",
        "description": "Graduate Prerequisites: SSW HB 720. This course familiarizes the student with basic concepts related to organizational behavior and culture in human service organizations. The primary focus is on how human service organizations function, with a particular focus on the influence of internal and external factors, and methods for achieving change within these settings.",
        "prerequisites": "SSW HB 720."
    },
    {
        "course_code": "SSW HB 751",
        "course_title": "Human Neuropsychology",
        "description": "Graduate Prerequisites: SSW HB 720. Students develop foundational knowledge in the structure and function of the nervous system with special emphasis on processes underlying common neuropsychological disorders. The course is designed to make basic neuroscience accessible and interesting for students with a minimum of basic science background.We cover basic neurophysiology, neuroanatomy, neurochemistry and nervous system development in the context of neuropsychological disorders to provide a clinical context for material that might otherwise seem overwhelming.",
        "prerequisites": "SSW HB 720."
    },
    {
        "course_code": "SSW IS 100",
        "course_title": "Professional Development Seminar",
        "description": "This seminar is required of all students in the Off-Campus, Online and Hybrid programs. The seminar is comprised of three parts, each part focusing on the students' developmental phase while enrolled in MSW program. There are a total of 12 sessions and students enroll in the seminar each semester. The seminar includes a self-paced component and live classroom sessions. The focus of the seminar includes professional development; an overview of the social work profession, its values and ethics; an orientation to, and integration with, field education; an overview of social work professional licensing and career preparation."
    },
    {
        "course_code": "SSW IS 805",
        "course_title": "Foundations in Trauma-Informed Social Work Practice, Programs, & Policy",
        "description": "The field of trauma has exploded in the last several decades with advances in neurobiology, increased attention to evidence-based and evidence-informed interventions in trauma, and widespread recognition of violence across multiple contexts. Because trauma is a rapidly evolving field, social workers need integrated and cutting edge training to work with and on behalf of diverse populations who are affected by wide ranging traumatic experiences, including gender and race-based violence, interpersonal and/or community violence, natural disasters, combat trauma, and terrorism. Students will learn the foundations of trauma informed and multi-level practice and policy, and apply this knowledge to prevention, intervention, and policy-making to mitigate the impact of violence and trauma on individuals, families, communities and societies. This course is open to macro and clinical practice."
    },
    {
        "course_code": "SSW KC 902",
        "course_title": "Proseminar in Social Work",
        "description": "The PhD program doctoral proseminar is a 14 week course designed for first year or early social work students. The purpose of the proseminar is to facilitate socialization to contemporary academic and research environments in the field and the practice of interdisciplinary social work research. A primary modality for the course will include faculty presentations and discussion with students related to current research and invited guest speakers from across the university. Students work collaboratively to develop mentoring plans and maps and initial specialization statements."
    },
    {
        "course_code": "SSW MP 773",
        "course_title": "Hum Serv Mgt",
        "description": "Graduate Prerequisites: SSW MP 759; Or permission of department chair. This course description is currently under construction.",
        "prerequisites": "SSW MP 759; Or permission of department chair."
    },
    {
        "course_code": "SSW MP 775",
        "course_title": "Strategic Management",
        "description": "Graduate Prerequisites: SSW MP 759 and SSW MP 773; Or permission of department chair. Focuses on strategies for developing, strengthening, and advancing the effectiveness of non-profit organizations. Significant issues and emerging themes in agency administration are examined with an emphasis on equity and inclusion. Students will acquire skills in strategic planning, strategic collaboration, authentic stakeholder engagement, and grant writing through the preparation of a strategic plan and a proposal for grant funding, along with other learning methods.",
        "prerequisites": "SSW MP 759 and SSW MP 773; Or permission of department chair."
    },
    {
        "course_code": "SSW MP 780",
        "course_title": "Advocacy for Equity and Justice",
        "description": "This course combines theory and skill development to enable social workers to shape legislation, regulations, budgets, and institutional policies and practices as advocates committed to respectful engagement with constituents and community partners. The course distinguishes advocacy from other social change strategies, relates advocacy to policy practice, and builds skills in issue framing, testimony, media relations, partnerships, and different forms of advocacy writing to advance strategic objectives. MP780 draws upon the experiences of class members and the instructor and incorporates case studies, guest speakers, and interactive exercises and assignments. Upon completion of the course, students will be prepared to practice effectively as advocates committed to advancing equity and justice in multiple settings."
    },
    {
        "course_code": "SSW MP 781",
        "course_title": "Community Organizing",
        "description": "Graduate Prerequisites: SSW MP 759; Or permission of department chair. Required of all Macro Social Work Practice students. Graduate Corequisites: Required to be in a field placement with this course. MP781 is designed to strengthen the ability of class members to foster progressive social change. It provides knowledge and skills in different models of community organizing, with a focus on collective action to promote social and economic justice, particularly in urban settings. Class members will develop skills in outreach and recruitment, leadership development, issue selection, strategy and tactics, campaign planning, coalitions, and building grassroots community organizations. MP781 emphasizes the responsibility of social workers to facilitate democratic participation and community empowerment based on respect, humility, and commitment to addressing racism and intersecting forms of oppression. In addition to readings and lectures, the course utilizes guest speakers, small group exercises, role play, video, poetry, music, and direct engagement with community-based organizations. Assignments emphasize skill building and integration of organizing theory and practice. The course relates community organizing to policy, planning, and management to underscore its relevance for all macro practitioners.",
        "prerequisites": "SSW MP 759; Or permission of department chair. Required of all Macro Social Work Practice students."
    },
    {
        "course_code": "SSW MP 783",
        "course_title": "Planning and Program Development",
        "description": "Graduate Prerequisites: SSW MP 759; Or permission of department chair. Required of all Macro Social Work Practice students. Graduate Corequisites: Required to be in a field placement with this course. This course introduces students to planning theory, planned social change, organizational development, program development, proposal writing, and leadership. Specific emphasis is placed on basic concepts, principles, skills, and knowledge necessary to effect change at the organizational and community levels.",
        "prerequisites": "SSW MP 759; Or permission of department chair. Required of all Macro Social Work Practice students."
    },
    {
        "course_code": "SSW MP 785",
        "course_title": "Program Evaluation",
        "description": "Graduate Prerequisites: SSW MP 759; Or permission of department chair. MP 785 equips students with the ability to conduct an evaluation as an essential part of the infrastructure of any program or organization designed to advance social change. Students will learn how to select an evaluation design and method that responds to a program's organizational reality, political-policy context, client and/or community input and that promotes a culture of learning and adaption to ensure the highest quality service. Students will design a comprehensive field-based evaluation plan or conduct an evaluation in the field based on their own collection of data.",
        "prerequisites": "SSW MP 759; Or permission of department chair."
    },
    {
        "course_code": "SSW MP 786",
        "course_title": "Health Equity",
        "description": "Graduate Prerequisites: MP 759 Data indicate, people who identify as white in the United States experience better health outcomes across a myriad of chronic conditions. Achieving health equity requires closing the racial health gap. Macro social workers are poised to fight for health equity -- by dismantling white supremacy culture and colonial ideology that shape the systems and structures, social determinants, which produce ill health. During the course of the semester, students will explore and propose organization and community change strategies to promote health equity.",
        "prerequisites": "MP 759"
    },
    {
        "course_code": "SSW MP 787",
        "course_title": "Leadership for Equity and Inclusion",
        "description": "Graduate Prerequisites: MP 759- Comm & Orgs Prepares students to assume leadership roles with a focus on promoting equity and inclusion in order to simultaneously advance social justice and the effectiveness of macro-level systems. Theories and styles of leadership are examined and critiqued as students work to identify and further develop their leadership styles. Students will acquire skills for effective leadership aimed toward dismantling white supremacist culture, heterocentrism, ablism, sexism, and other forms of oppression, and building an organizational culture that embraces and utilizes a wide range of experiences, perspectives, and skills.",
        "prerequisites": "MP 759- Comm & Orgs"
    },
    {
        "course_code": "SSW MP 794",
        "course_title": "Macro Field Seminar",
        "description": "A required monthly seminar in support of field placements for non-MSW-supervised, second-year macro students. There are no readings or assignments."
    },
    {
        "course_code": "SSW SR 743",
        "course_title": "Introduction to Social Work Research I",
        "description": "Graduate Prerequisites: Required of all students. Permission of SSW Registrar for non-SSW students. The goal of this introductory course is to develop the student's ability to use and engage in both quantitative and qualitative research in order to inform and evaluate their own social work practice. The course addresses key research concepts and procedures such as hypothesis formulation, measurement, sampling, research design, and data collection. The course also examines ethical issues in the conduct of social research, including informed consent, anonymity and confidentiality, culturally sensitive research methods, and the NASW Code of Ethics.",
        "prerequisites": "Required of all students. Permission of SSW Registrar for non-SSW students."
    },
    {
        "course_code": "SSW SR 744",
        "course_title": "Social Work Research II",
        "description": "Graduate Prerequisites: Satisfactory completion of SSW SR 743 (C or above) or permission of department chair. Required of all students. Students are introduced to the concepts and procedures that are fundamental to both descriptive and inferential statistics. Empirical research examining the effectiveness of social work practice, particularly in the urban environment, is explored. Utilizing existing national data sets, students generate their own research hypotheses and then formulate and carry out an analytic strategy to answer these questions effectively. Emphasis is also placed on gaining skills in presenting and communicating key findings to relevant audiences and stakeholders",
        "prerequisites": "Satisfactory completion of SSW SR 743 (C or above) or permission of department chair.  Required of all students."
    },
    {
        "course_code": "SSW SR 904",
        "course_title": "Clinical Research Methods in Social Work Practice",
        "description": "Graduate Prerequisites: PHD level course, permission required for graduate students This course builds upon introductory doctoral coursework in research and statistical methods to develop advanced skills in clinical research. The intention is to familiarize and advance students' knowledge and application of design and implementation strategies for clinical research. A variety of practice research approaches will be discussed and critically analyzed and will include clinical trials, clinical process research, program evaluation, measurement construction, longitudinal, mixed methods, implementation science, and survey research. Topics include conceptualization and design, sampling of participants, assessment, data organization and management, analysis plans, evaluation and outcomes, and ethical concerns. Wherever possible, the instructor and guest speakers will present on completed and ongoing research projects. The course will be conducted as a seminar, whereby students will take an active role in discussions and applying knowledge and skills development. We will examine and critique readings (e.g., assigned, independent) as well as present and provide constructive consultation and feedback to other seminar participants. Original study materials such as questionnaires and standardized research measures will be provided to students. The class will focus on experiential exercises to maximize the relevance to students' own research (e.g., dissertation).",
        "prerequisites": "PHD level course, permission required for graduate students"
    },
    {
        "course_code": "SSW SR 906",
        "course_title": "Qualitative Research Methods",
        "description": "This course provides doctoral students with foundational knowledge of some of the major theories and practices of qualitative research. The history of qualitative methods is reviewed to situate this long-standing approach within current practices in the social sciences. A variety of approaches to data collection (ethnography, observation, focus groups and individual interviewing) and analysis (narrative, grounded theory, Listening Guide) are introduced along with ethical issues in the practice of qualitative research. Strategies for enhancing rigor are discussed as are writing qualitative research proposals and publications. A series of exercises culminates in a proposal for a small qualitative research project along with an accompanying IRB application. (SR906 and SR907 comprise a two-course qualitative methods sequence.)"
    },
    {
        "course_code": "SSW SR 907",
        "course_title": "Advanced Qualitative Research Methods",
        "description": "This course is the second in a two-semester sequence (SR906 and SR907) designed to introduce students to qualitative approaches in social science research and foster development of foundational skills in qualitative research design, data collection, data analysis, and presentation of qualitative research findings. The course builds on students' developing understanding of the diversity and philosophical underpinnings of qualitative approaches and provides an opportunity to deepen one's skills in data collection and analysis through the completion of a small-scale qualitative research project. Students are expected to have obtained IRB approval for their projects prior to the start of the semester so that work on these can begin immediately."
    },
    {
        "course_code": "SSW SR 910",
        "course_title": "Doctoral Dissertation Seminar",
        "description": "Designed as a seminar format, this course guides students in the transformation of their latent ideas into novel researchable dissertation projects. The course focuses on enhancing student knowledge and skills necessary to develop the many components of the dissertation in a coherent manner: introduction, literature review, theoretical or conceptual framework, research questions, methods, results and discussion sections. The seminar also addresses a number of dissertation research-related tasks such as creation of the dissertation committee, understanding research ethics and the institutional review board process, exploring dissertation funding and identifying needed resources, creation of realistic timelines for dissertation phases, and strategies for dissemination of work through conference presentations and publications. Each student will develop a complete draft of his/her dissertation prospectus and evaluate the proposed research in terms of its relevance for the field of social welfare, including relevance to the profession's mission to pursue social justice, the rigor of the proposed study, the originality of the research, and the feasibility of the overall proposal."
    },
    {
        "course_code": "SSW SW 908",
        "course_title": "Teaching Seminar",
        "description": "This required, 4-credit course will orient students to teaching methods and skills specific to course instruction in substantive areas required in accredited social work programs at the master's level. Students will explore diverse pedagogical frameworks for teaching social work clinical and community practice, policy, human behavior, and research. The course will emphasize effective teaching grounded in core social work values of social justice and respect for human diversity."
    },
    {
        "course_code": "SSW SW 909",
        "course_title": "Teaching Practicum",
        "description": "Students will complete a teaching practicum with an instructor of record for a traditional in person MSW classroom course. Course assignments will be made according to the needs and interests of the student in collaboration with faculty advisors and course instructors with approval from the doctoral committee and relevant departments."
    },
    {
        "course_code": "SSW SW 981",
        "course_title": "Certified Ft",
        "description": null
    },
    {
        "course_code": "SSW SW 982",
        "course_title": "Certified Ft",
        "description": null
    },
    {
        "course_code": "SSW SW 983",
        "course_title": "Cont Study Pt",
        "description": null
    },
    {
        "course_code": "SSW SW 984",
        "course_title": "Cont Study Pt",
        "description": null
    },
    {
        "course_code": "SSW SW 985",
        "course_title": "Cont Study Ft",
        "description": null
    },
    {
        "course_code": "SSW SW 986",
        "course_title": "Cont Study Ft",
        "description": null
    },
    {
        "course_code": "SSW WP 704",
        "course_title": "Social Policy and Programs on Aging",
        "description": "Graduate Prerequisites: SSW WP 700 and SSW WP 701; Or permission of department chair. This course explores the development and scope of public policies directed toward older persons. It reviews the provisions and workings of current programs, with special attention to implications for social work practice. Program areas investigated include acute and long-term health care, housing and community-based services, and the formal service structure and its relationship to informal service provision. Finally, the course explores emerging policy innovations in aging, such as public and private insurance for chronic-care needs, life care programs, and proposals for more progressive public policies affecting older Americans.",
        "prerequisites": "SSW WP 700 and SSW WP 701; Or permission of department chair."
    },
    {
        "course_code": "SSW WP 705",
        "course_title": "Mental Health and Social Policy",
        "description": "Graduate Prerequisites: SSW WP 700 and SSW WP 701; Or permission of department chair. This course provides an understanding of mental health policy and service delivery in the United States and of the impact of mental health policies on social work practice. It reviews multiple perspectives on mental health and mental illness and the history of social policies influencing mental health care. The class examines current trends in service delivery and financing (such as managed care and health insurance reform) and explores legal and ethical issues in the provision of mental health care. Models of family and consumer advocacy and empowerment are considered.",
        "prerequisites": "SSW WP 700 and SSW WP 701; Or permission of department chair."
    },
    {
        "course_code": "SSW WP 707",
        "course_title": "Social Welfare Policy and Programs on Children",
        "description": "Graduate Prerequisites: SSW WP 700 and SSW WP 701; Or permission of department chair. This course analyzes emerging issues and ideas about children and how these affect social policy and practice. It reviews major social and demographic changes in the family that affect the development of national policies designed to protect and provide for the care of children. The course emphasizes policies in such areas as income provisions, adoption, substitute care, neglect and abuse, social services, and employment.",
        "prerequisites": "SSW WP 700 and SSW WP 701; Or permission of department chair."
    },
    {
        "course_code": "SSW WP 710",
        "course_title": "Family Law and Children's Rights",
        "description": "Graduate Prerequisites: SSW WP 700 and SSW WP 701; or permission of department chair. This course provides a framework for understanding law and social policy. It examines the impact of law on the social work profession. The class discusses issues of marriage and divorce, child custody and support, children's rights, and legal research.",
        "prerequisites": "SSW WP 700 and SSW WP 701; or permission of department chair."
    },
    {
        "course_code": "SSW WP 711",
        "course_title": "Substance Use Policy",
        "description": "Graduate Prerequisites: SSW WP 700 and SSW WP 701; Or permission of department chair. This course in alcohol and drug policy is designed to provide students with a forum to acquire and synthesize knowledge of policy, research, and service organization in the field. The course will include topics such as alcohol and drug research, social problems that interface with alcohol and drug policy (e.g., poverty, gender, and race discrimination), key issues, controversies and trends, ethics and values issues, and the role of social work in the field of alcohol and drug policy and research.",
        "prerequisites": "SSW WP 700 and SSW WP 701; Or permission of department chair."
    },
    {
        "course_code": "SSW WP 713",
        "course_title": "State Legislative Processes and Welfare Policy",
        "description": "Graduate Prerequisites: SSW WP 700 and SSW WP 701; Or permission of department chair. The focus of this course is on developing an understanding of how social policy may be achieved in the legislative arena at the state level. The course (a) introduces students to theories, research findings, and issues about legislative processes; (b) derives working hypotheses, or action principles, which may guide social work practitioners in the legislative process; and (c) applies these working hypotheses toward achieving adoption of proposals by a state legislature.",
        "prerequisites": "SSW WP 700 and SSW WP 701; Or permission of department chair."
    },
    {
        "course_code": "SSW WP 720",
        "course_title": "Family Policy",
        "description": "Graduate Prerequisites: WP700 & WP701 This course will explore how social policies shape the context in which families live and in turn influences family wellbeing. Students will examine the relationship between family functioning and social policies at the local, state, and federal level. We will examine how demographic changes, values, attitudes and perspectives of well-being of families influence the policy debate. Attention will be given to the current debates about the \"proper role\" of government in support of families from different political perspectives. Students will assess the equity and effectiveness of policies and programs aimed at promoting American families' economic, health and social well-being and identify roles social work professionals can play in influencing policy development and implementation. Special attention will be paid to the consequences of various policy debates/alternatives for vulnerable and/or historically marginalized populations.",
        "prerequisites": "WP700 & WP701"
    },
    {
        "course_code": "SSW WP 901",
        "course_title": "Social Justice, Values and the Social Work Profession",
        "description": "What is social justice? What, if any, relationship does it have to social welfare? How do our understandings of social justice and social welfare shape our understanding of social problems? This course will explore these questions and their implications for social work academics through humanities and social science approaches and a history of ideas that have influenced the development of professional social work in the United States. It will also examine social justice, values and some key areas of 21st century social work."
    },
    {
        "course_code": "SSW WP 903",
        "course_title": "Perspectives on Social Welfare Policy",
        "description": "Focusing on theory, process and substance, this course is designed to expose students to different understandings of the American political institutions as they relate to social welfare policy. Attention is paid to institutional and other factors, shaping and constraining the development of social policies in the United States."
    }
]